{"id":"019aa758b9da1000fdce9bbda75c0001","title":"Senior Sales Executive - London Infomediary Data Solutions","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Senior Sales Executive – London Infomediary Data Solutions</b></p><p></p><p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p>At Brown Brothers Harriman, we believe no job is too big or small for any of us to handle if it helps our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of person who speaks their mind, truly listens and steps outside their role to add value wherever they can. Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek someone who takes great pride in their work and is inspired and motivated by their role in protecting and enhancing our client’s financial well-being.</p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p>Brown Brothers Harriman is currently recruiting a Senior Sales Executive to drive revenue growth for our Infomediary® Data Solutions (IDS) business.  In this role you will have primary responsibility for ensuring BBH relationship excellence and new business development across a comprehensive suite of data messaging services, investment operations and middle office technology applications, data managements services. The Senior Sales Executive builds and executes a sales strategy, with both existing clients and new prospects, based on broad industry, product and client insights. Additionally, the Senior Sales Executive is responsible for ensuring satisfaction with current BBH products and services while maximizing profitability and increasing product breadth with clients.</p><p>This role is an individual contributor role that will collaborate extensively across a globally distributed and virtual sales, product, and technology team to achieve actionable group and individual goals. The role will require regular domestic and international travel (~30-40% of the time) to foster and maintain relationships </p><p></p><p><u>Responsibilities of the Role</u></p><p>The Senior Sales Executive will lead a global sales and marketing campaign to generate net revenue by:</p><ul><li><p>Utilizing a solution-focused, consultative selling approach identify new opportunities that leverage BBH’s existing data platform capabilities and extensive asset servicing domain experience to improve our clients’ middle and back office operating models</p></li><li><p>Incrementally expanding overall market share with new, commercially viable use cases that improve client decision making and oversight through the use of our data management platform, data analytics tools, hosted SaaS technology applications, as well as artificial intelligence and machine learning solutions</p></li><li><p>Create and be accountable for all client proposals, due diligence requirements, contracts and any other required documentation according to BBH’s New Business Review and Risk, Compliance and Legal process</p></li></ul><ul><li><p>Coordinate with related BBH Investor Services sales and relationship teams to identify attractive cross selling opportunities</p></li><li><p>Develop deep understanding of our clients’ needs, budgets, decision making and competitive landscapes in order to deliver meaningful insights that accelerate new business outcomes</p></li><li><p>Collaborate directly with BBH’s Product, Client Service, and Technology teams to fully understand the needs of our customers, strategize on product implementations, provide technical guidance, evangelize the joint solutions, and ultimately serve as trusted resource to internal stakeholders</p></li><li><p>Actively track and communicate client and market intelligence back to appropriate BBH</p></li></ul><p></p><p><u>Skills and Experience</u></p><p>Successful candidates for this role will demonstrate:</p><ul><li><p>Extensive business development experience delivering data services space</p></li><li><p>Proven record of driving business growth through impactful relationship building and pre-sales/sales engagement</p></li><li><p>Willingness and capacity to become a product expert on our platform, demonstrating its value proposition to various stakeholders including Traders, Portfolio Managers, Compliance Officers, IT, Accounting and C-level individuals</p></li><li><p>Knowledge of the regulatory environment and other external market forces impacting the asset management industry</p></li><li><p>Familiarity with consultative selling methodologies and the ability to work within a collaborative environment to achieve results</p></li><li><p>A credible executive presence and ability to exude confidence and trust at the highest seniority levels within our industry</p></li><li><p>Excellent oral and written communication skills with the ability to articulate complex concepts simply and clearly to clients, and superior presentation skills, with experience in leading product demonstrations to large and complex audiences</p></li></ul><p></p><p><u>Educational and Training Requirements </u></p><ul><li><p>15&#43; years of experience in sales, operations, and/or technology roles in the asset servicing or financial services digital/data/technology</p></li><li><p>Previous work experience in financial markets, portfolio management, trading, performance and risk, investment accounting, compliance, corporate actions, position management, and trade settlement.</p></li><li><p>MBA or similar graduate level degree in finance, strategy or marketing</p></li><li><p>Specific knowledge of the global asset management industry, including financial instruments, middle and back-office processes, rules and regulations, data requirements, major software and services providers, technology trends, etc.</p></li><li><p>Experience with CRM technology to support sales activity (i.e. Salesforce)</p></li></ul><p></p><p></p><p></p>","location":"London","postedOn":"Posted 30+ Days Ago","startDate":"2023-09-01","timeType":"Full time","jobReqId":"57795","jobPostingId":"Senior-Sales-Manager_57795-1","country":{"descriptor":"United Kingdom","id":"29247e57dbaf46fb855b224e03170bc7"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"London","country":{"descriptor":"United Kingdom","alpha2Code":"GB"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/London/Senior-Sales-Manager_57795-1"}