{"id":"09bf4ca210791001bdc6091031850000","title":"Senior Audit Manager - IT/Systems","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>We value diverse backgrounds, so even if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p>At Brown Brothers Harriman, we believe no job is too big or small for any of us to handle if it helps our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of person who speaks their mind, truly listens, and steps outside their role to add value wherever they can.  Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek someone who takes great pride in their work and is inspired and motivated by their role in protecting and enhancing our client’s financial well-being.</p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you…</p><p></p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you</p><p></p><p><b>Join us as a Senior Audit Manager – IT Cyber and Infrastructure</b></p><p></p><p>Brown Brothers Harriman is currently recruiting a <b>Senior Audit Manager – IT Cyber and Infrastructure </b>to join our Audit Team.  In this role you will provide services that assist BBH’s businesses and support areas in improving their control environments, streamlining their businesses, and achieving operational excellence. The Senior Audit Manager- IT Cyber and Infrastructure is responsible for delivering audit services, as well as risk and controls. S/he manages the work of multiple project-specific teams simultaneously, providing supervision and direction on specific technology audit engagements, and is responsible for providing ongoing progress reports to the business line and audit management.</p><p>The Senior Audit Manager- IT Cyber and Infrastructure may also serve as a key Internal Audit representative in important new business initiatives, new products, special investigations, and other control-related projects, working with senior management to facilitate the identification and resolution of risk and control issues. The Senior Audit Manager- IT Cyber and Infrastructure will in most instances work directly with senior stakeholders from the Systems LOB and will be responsible for reporting and working through audits independently, presenting results to LOB management, and supporting control groups. The individual will play a key role in developing and driving strategic direction to problems and issues.</p><p>Administratively, the Senior Audit Manager- IT Cyber and Infrastructure is responsible for developing and maintaining relationships with business counterparts, developing risk assessments and the annual plan (including resource allocation and scheduling), coordinating regulatory requests, developing staff (including formal performance evaluations and development plans), and leading department initiatives.    </p><p></p><p><b>Some of your key responsibilities include:   </b></p><p><b><i>Management / Staff Leadership</i></b><b>:</b></p><ul><li>Direct and review the activities of the audit managers and maintain ownership for audit reports.</li><li>Provide overall leadership to the team in connection with performance of the work and personal development and growth.</li><li>Plan and conduct effective meetings with staff and internal clients.</li><li>Maintain final accountability and ownership for staff effectiveness and growth.</li></ul><p><b><i>Analysis and Reporting:</i></b></p><ul><li>Participate in more complex audits and/or subject matter and deliver industry expertise and perspective to the team and management.       </li><li>Evaluate risks, controls, policies, and procedures and how management monitors, communicates, and mitigates risk.</li><li>Follow up on identified issues and recommend corrective actions to ensure problem resolution.</li><li>Prepare audit reports that provide a clear description of issues identified, related implications to the business or company as a whole, and recommendations to resolve the issues.</li><li>Maintain final accountability for result messaging to senior management/partners as well as analysis of the evolution of controls.</li></ul><p><b><i>Communications:</i></b></p><ul><li>Maintain effective working relationships at all levels of management in client organizations.</li><li>Escalate significant audit issues, set direction/communicate proposed manner of resolution of audit issues and concerns that have a significant impact.</li><li>Develop and maintain peer relationships with auditors to share best practices.</li><li>Present audit results and recommendations to senior management and partners.</li><li>Provide clear guidance on new business initiatives where Internal Audit is participating.</li><li>Work with senior management to stay abreast of changes in the business and growth plans and provide strategic advice and counsel on risk-related matters.</li></ul><p><b><i>Administrative/Other:</i></b></p><ul><li>Assist regulators and external auditors in accomplishing their goals.</li><li>Recruit, train, supervise, and develop staff.</li></ul><p><b>Qualifications:</b></p><ul><li>Bachelor’s Degree in Finance, Accounting, Information Systems, or a related field of study.</li><li>7 - 10&#43; years audit, audit-related or relevant business line experience.</li><li>Professional audit certifications preferred (CIA, CPA, CISA, CISSP, etc.)</li><li>Resolves complex issues independently, or in close collaboration with the business.</li><li>Can be depended upon to solve problems, negotiate solutions, and act with best judgment for the good of the Firm / Department.</li><li>Able to operate well in an environment of change, savvy in figuring out best people for a task, best approach to a problem, etc.</li><li>Project management experience.</li><li>Excellent analytical, communication and interpersonal skills required with ability to present complex and sensitive issues to senior management.</li><li>Areas of expertise should ideally include abilities in computer systems, banking applications, regulatory, etc.</li><li>Demonstrate technical abilities for most of the following: Access control, Cyber Security, Security policies and standards, Operating systems (Windows NT, UNIX/Linux, MVS) Database platforms (SQL, Oracle, DB2), IT Business Continuity and Recoverability, IT Production Operations, Active Directory, and Third-Party Services (including Cloud)</li><li>Advanced knowledge in IT Frameworks (COBIT, NIST, FFIEC, ISO, ITIL)</li></ul><p></p><p><b>WHAT WE OFFER</b></p><ul><li>A collaborative environment that enables you to step outside your role to add value wherever you can</li><li>Direct access to clients, information and experts across all business areas around the world</li><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>High-quality benefits program emphasizing good health, financial security, and peace of mind</li><li>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</li><li>Volunteer opportunities to give back to your community and help transform the lives of others</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p><b>$150,000 to $200,000</b></p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","postedOn":"Posted 18 Days Ago","startDate":"2023-09-19","timeType":"Full time","jobReqId":"57707","jobPostingId":"Senior-Audit-Manager---IT-Systems_57707","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/Senior-Audit-Manager---IT-Systems_57707","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}