{"id":"11ca40c476011000f0e7ab59ee370000","title":"Change Management Lead Business Analyst","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Lead Business Analyst will support expansion of Greater China business, from mutual fund launch support, client technology management to operational projects within Service Delivery Division.  The Lead Business Analyst will initiate, organize, drive, and complete small projects or segments of large projects (including global projects) that address business goals and needs. S/he may participate in any or all phases of the project life cycle and is responsible for execution of project tasks in accordance with standards and best practices.</p><p>The Lead Business Analyst gathers requirements, analyzes data, researches issues, and devises solutions for the project.  In addition, s/he may lead/coordinate user acceptance testing, and implementation of new and existing applications as defined in a project or product roll-out plan.  The Lead Business Analyst is results-oriented and understands the impact of the project on the organization as a whole. </p><p></p><p><b>Responsibilities:</b></p><p></p><p>1.    Project Management and Execution:</p><ul><li><p>Assist Project Manager and Project Sponsor in defining project scope.</p></li><li><p>Identify business goals and problems in individual business units and across the organization.</p></li><li><p>Perform assessment of feasible solutions and the range of problems they may solve.</p></li><li><p>Lead project segment or work stream. Prepare a plan for the work stream, including task assignments, timelines, phases, dependencies, and critical paths.</p></li><li><p>Work with Project Sponsor to prioritize deliverables and manage resources</p></li><li><p>Ensure thorough testing of all system changes, including user acceptance testing, regression testing, client testing and parallel/pilot testing as required</p></li><li><p>Ensure that Business Analysts adhere to strong project execution methodology standards and best practices throughout the project lifecycle</p></li></ul><p></p><p>2.    Client Onboarding Management:</p><ul><li><p>Manage the four phases of a client on-boarding event (Discovery, Planning, Execution, Day 2 Handover), which includes documenting and maintaining a detailed project plan (and other associated project artifacts, e.g., agendas, minutes, workflow diagrams, etc.) for all areas impacted at BBH and the client</p></li><li><p>Own and maintain project plan across all necessary work streams and business areas (e.g., fund accounting, custody, fund administration, transfer agency, reporting, technology, legal, etc.)</p></li><li><p>Provide ongoing support to the project steering committee by tracking and resolving issues throughout the life of a project</p></li><li><p>Drive and oversee an effective project governance process</p></li><li><p>Chair effective project meetings (e.g., stakeholder meetings, client discussions, third party workshops, steering committees, etc.)</p></li><li><p>Participate in internal and external client workshops/meetings to gather, understand, and document project goals, workflows, business needs, gaps, and opportunities</p></li><li><p>Recognize patterns in complex information across multiple service areas and identify key issues.</p></li><li><p>Remain cognizant of potential BBH capability challenges (servicing, technology, general readiness) exposed by the new and different and escalate to project sponsors.</p></li><li><p>Assist with the development and documentation of proposed solutions to fill gaps where relevant</p></li><li><p>Coordinate and work effectively with colleagues across the Service Delivery and RE Pillars; leverage influence across business areas and project team members to drive toward a common goal</p></li><li><p>Coordinate client requirements and timeframes with Fund Accounting, Custody and TA Conversion Teams</p></li><li><p>For defined projects, document workflows and functional models depicting operational and technical processes in conjunction with business and technology teams.</p></li></ul><p></p><p>3.    Data Collection &amp; Documentation:</p><ul><li><p>Document and/or review business requirements gathered from business users, sponsors and clients, and obtain user signoff on the requirements</p></li><li><p>Identify and interview key individuals to gather needed details and direction to define business requirements.</p></li><li><p>Track and organize open items; understand the time sensitivities of open issues and drive to resolution</p></li><li><p>Communicate defects to Systems developers. Track delivery dates for defect fixes and maintain status reporting. Escalate appropriately.</p></li><li><p>Oversee and/or participate in documentation of new or revised procedures or workflows.</p></li><li><p>Document Change Requests, provide effort estimates and document business requirements for approved Change Requests</p></li></ul><p></p><p>4.    Analysis:</p><ul><li><p>Conduct business analysis to determine how changing business needs will affect the system or product; clearly articulate the business need and potential solutions with support of insightful analysis and documented evidence</p></li><li><p>Demonstrates strong subject matter expertise in the assigned product or discipline, including technical knowledge of associated systems</p></li><li><p>Design creative solutions that meet the goals and objectives of the project and align with product/discipline strategy.</p></li><li><p>Lead design sessions, driving to creative, well thought out, viable solutions</p></li><li><p>Identify gaps between business requirements and existing or proposed design solutions.</p></li><li><p>Recognize patterns in complex information across multiple projects and identify key issues.</p></li><li><p>Work with business areas to identify productivity improvements in workflows and procedures.</p></li><li><p>Work with business areas to identify areas of risk for errors and omissions.</p></li></ul><p></p><p>5.    Communication:</p><ul><li><p>Plan meetings, prepare materials, and lead or participate in meetings with business users and sponsors, systems groups, vendors and clients</p></li><li><p>Prepare project status reporting and other project communications for internal and external stakeholders as needed</p></li></ul><p></p><p>6.    Leadership:</p><ul><li><p>Lead work streams or project segments</p></li><li><p>Lead or participate in client workshops and meetings to identify key issues, requirements, and gaps.</p></li><li><p>Conduct/lead user/client training when necessary.</p></li><li><p>Assist in the creation of product announcements and modification of client demonstration materials as needed.</p></li><li><p>Provide guidance for Business Analysts through coaching, resolving interpersonal conflict, coordinating activity, and assigning work.</p></li><li><p>Based on lessons learned, offers updates to improve best practices, project documentation and standards as applicable.</p></li></ul><p></p><p><b>Requirements:</b></p><ul><li><p>BS/BA degree</p></li><li><p>Minimum 5&#43; years of related work experience</p></li><li><p>Fluency in English and Cantonese/Mandarin will be highly preferred</p></li><li><p>Background in Custody and Fund Services preferred</p></li><li><p>Takes ownership and follow through on tasks; results oriented</p></li><li><p>Flexible and able to handle multiple priorities</p></li><li><p>Creative thinking, intellectual curiosity</p></li><li><p>Problem-solving and sound judgment</p></li><li><p>Analytical and problem-solving skills</p></li><li><p>Strong organizational and time management skills</p></li><li><p>Strong attention to detail</p></li><li><p>Excellent verbal and written communication skills with all level of audiences</p></li><li><p>Negotiation and mediation skills.</p></li><li><p>Experience using established project management principles and methodologies.</p></li><li><p>Proficiency in MS Office product suite</p></li></ul><p></p><p></p><p></p><p></p>","location":"Hong Kong","postedOn":"Posted 30+ Days Ago","startDate":"2023-05-23","timeType":"Full time","jobReqId":"58856","jobPostingId":"Change-Management-Lead-Business-Analyst_58856","country":{"descriptor":"Hong Kong","id":"d4afdeb461d446e4babd204bd102dba8"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Hong Kong","country":{"descriptor":"Hong Kong","alpha2Code":"HK"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Hong-Kong/Change-Management-Lead-Business-Analyst_58856"}