{"id":"2f69decd3e16100151114bf2d6300000","title":"Financial Reporting Manager","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>1. Financial Reporting</p><p>-           Oversee planning, coordination, preparation and reviews of annual, semi-annual and quarterly financial statements and Forms N-PORT, N-CEN, 24F-2, and N-CSR for registered investment companies.</p><p>-           Train staff on applicable laws and regulations as they pertain to the mutual fund industry.</p><p>-           Ensure communication of law and regulation changes that pertain to the mutual fund industry to staff.</p><p>-           Oversee and deliver reporting of statistical and performance data to fund management and industry publications.</p><p>-           Maintain expert knowledge over applicable laws, regulations and interpretations governing financial statements and disclosure, including the Investment Company Act of 1940, the Internal Revenue Code, GAAP, Regulation S-X and other applicable requirements.</p><p>-           Communicate appropriately with Sr. Managers and internal contacts with respect to all timetables, workflows and other relevant financial administrative matters.</p><p>-           Oversees annual fund audit processes.</p><p></p><p>2. Technology and Innovation</p><p>-           Assist in the evaluation and development of enhancements to BBH systems to automate procedures for financial reporting purposes.</p><p>-           Identify, assign and oversee special projects.</p><p>-           Participate in special projects as directed by senior management.</p><p></p><p>3.Leadership and Staff Management</p><p>-           Maintain a leadership role by developing internal relationships with key players in other departments to accomplish goals and resolve issues.</p><p>-           Provide ongoing feedback and coaching to staff to improve individual and team performance.</p><p>-           Manage performance issues and disciplinary process for employees failing to meet team expectations.</p><p>-           Complete and oversee the completion of the BBH annual performance review process.</p><p>-           Participate in selecting and hiring new staff.</p><p></p><p>4.Client Relationship Management</p><p>-           Provide oversight of client service delivery.</p><p>-           Serve as a key point of escalation of contact for client contacts.</p><p>-           Participate in client visits to ensure client satisfaction and communicate product related information. </p><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 30+ Days Ago","startDate":"2023-09-06","timeType":"Full time","jobReqId":"60271","jobPostingId":"Financial-Reporting-Manager_60271-1","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Financial-Reporting-Manager_60271-1"}