{"id":"3305ca8059a01001a25f5c9e008d0000","title":"Senior Trust Officer","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>At Brown Brothers Harriman, we believe no job is too big or small for any of us to handle if it helps our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of person who speaks their mind, truly listens, and steps outside their role to add value wherever they can.  Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek someone who takes great pride in their work and is inspired and motivated by their role in protecting and enhancing our client’s financial well-being.</p><p></p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p></p><p><span>Join us as a Senior Trust Officer</span></p><p></p><p>Brown Brothers Harriman is currently looking for a Senior Trust Officer to join our National Trust Company in our New York headquarters.  The New York Office consists of a team of 14 professionals that administer over $4 billion in trust assets for ultra-high net worth clients for the Private Bank.  In this role, you will be responsible for managing a book of sophisticated trust relationships with the support of administrators, and you will work closely with clients, prospects, advisers, and the relationship management team to provide superior client service.</p><p></p><p><span>Some of your key responsibilities include:  </span></p><p></p><p><u><span>Trust Administration</span></u></p><ul><li>Work with wealth planners and relationship management team to ensure the proper administration of a book of sophisticated trust accounts.</li><li>Responsible for overseeing all aspects of trust administration for a book of accounts, from account opening, funding, distributions, investments, account closing, etc.</li><li>Prepare memos for discretionary actions (e.g., distributions, special investments) and present to the Trust and Investment Committee</li><li>Review governing instruments (e.g., trusts, wills) and prepare trust summaries as part of the initial review and onboarding process; coordinate with client and advisers on execution and funding of trust, including working with predecessor trustees as applicable</li><li>Oversee all trust-related transactions (e.g., sales, loans), coordinating with the client and advisers to ensure transaction documents are reviewed and approved internally</li></ul><p></p><p><u><span>Client Relationship Management</span></u></p><ul><li>Serve as a trusted adviser to clients with respect to trust matters</li><li>Communicate regularly with grantors, beneficiaries and co-trustees regarding planning, trust terms, and solutions to address various issues or opportunities that present during administration</li></ul><p></p><p><u><span>Leadership and Development</span></u></p><ul><li>Oversee trust professionals who support a shared book of business</li><li>Provide guidance to team on day-to-day trust administration responsibilities</li><li>Serve as mentor and coach for team’s career development goals</li><li>Ensures that team is appropriately staffed with the required skillset to serve book of trust business</li></ul><p></p><p><u><span>Qualifications</span></u></p><ul><li>7 to 10 plus years of relevant experience OR Advanced degree with 5&#43; years’ experience</li><li>JD or other advanced degree, preferred</li><li>Strong working knowledge of trust law, the interpretation and application of trust and estate provisions, and the legal framework for trust administration</li><li>Knowledge of income tax, estate tax, gift tax, and GST tax</li><li>Strong oral and written communications skills</li><li>Solutions oriented</li><li>Excellent analytical and critical thinking skills; is solutions-oriented and exercises independent judgment</li><li>Excellent interpersonal skills and the ability to relate with a variety of different people</li><li>Thrives in a team environment, is collaborative and enjoys mentoring and developing others</li></ul><p></p><p><u>What We Offer</u></p><ul><li>A collaborative environment that enables you to step outside your role to add value wherever you can</li><li>Direct access to clients, information, and experts across all business areas</li><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>High-quality benefits program emphasizing good health, financial security, and peace of mind</li><li>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</li><li>Volunteer opportunities to give back to your community and help transform the lives of others</li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$150,000 to <span>$170,000</span>, which is specific to <span>New York, NY</span></p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","postedOn":"Posted 30+ Days Ago","startDate":"2023-07-31","timeType":"Full time","jobReqId":"56997","jobPostingId":"Fiduciary-Tax-Administrator_56997","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/Fiduciary-Tax-Administrator_56997","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}