{"id":"47c0bb1d6c251000ff9b75b3f4300000","title":"Commercial Lending Associate Attorney","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>Join us as an Associate Attorney for Commercial Lending</span></b></p><p></p><p>The Associate Attorney position requires an experienced daily coverage attorney to work alongside another coverage attorney to provide general and transactional legal advice and analysis in support of BBH’s commercial lending business, with a focus on Commodities &amp; Logistics.  Responsibilities will include all stages of the lending cycle, from structuring, drafting, negotiating and reviewing all loan documents in support of commodity trade finance, private client and corporate lending transactions to the enforcement of remedies, collections, dispute resolution and bankruptcy.</p><p></p><p>The Associate Attorney is expected to advise the business on all legal aspects of secured and unsecured bilateral, club and syndicated credit facilities, borrowing base and transactional credit facilities, subordination agreements, revolving and term loan agreements, cash flow loans. participation agreements, documentary and standby letters of credit, securities-based lines of credit, supply chain financing, securitization and other credit products. </p><p></p><p>This attorney will advise the business on all regulatory, compliance and policy matters related to lending, and will have a strong working knowledge of UCC Articles 5, 7, 8 and 9 (particularly with respect to the creation, perfection and priority of security interests in various types of collateral).  The Associate Attorney is expected to support the resolution of complicated legal issues and escalate to the senior attorney whenever appropriate.  This role will work closely and coordinate on various matters with colleagues in the Compliance and Risk groups.</p><p></p><p>This role can be based out of any of the locations listed above and will be a hybrid position of at least three days a week in office in all locations except Houston, which will be a remote arrangement for now.</p><p></p><p><b>Primary Job Responsibilities:</b></p><ul><li>Provide legal and regulatory advice pertaining to commodity finance, syndicated facilities, letters of credit, and related activities</li><li>Advise senior management in the development of new products and services, and support and advise on long-term strategic business initiatives</li><li>Advise on the legal, regulatory and reputational issues and risks arising in transactions and in the non-transactional aspects of the operation and lending activities of the Firm</li><li>Manage outside counsel engagements</li><li>Proactively track relevant legal and regulatory developments</li><li>Review, draft and negotiate various agreements and documents in support of the various lending and financing activities, including loan agreements, letters of credit</li><li>Conduct legal research</li><li>Participate in internal working groups and committees as relevant</li><li>Participate and represent BBH on relevant trade association committees</li></ul><p></p><p><b><span>Qualifications:                                                                </span> </b></p><ul><li>JD Degree; Must be a graduate from an accredited Law School</li><li>Minimum of 5 years’ experience supporting corporate lending transactions and related matters; experience with commodities and logistics <span>preferred.  </span></li><li>Licensed to practice law/member of the bar in respective jurisdiction (New York, New Jersey, Pennsylvania, North Carolina, Tennessee, Illinois, or Texas)</li><li>Strong written and oral communication skills</li><li>Ability to prioritize, take initiative and bring projects to conclusion</li><li>Ability to work effectively with various internal and external constituencies</li><li>Ability to work effectively in a fast-paced environment and manage multiple projects simultaneously</li><li>Ability to identify and manage legal and reputational risk; demonstrates sound business judgment and legal ethics</li></ul><p></p><div><div><div><p><b>What We Offer:</b></p><ul><li>A collaborative environment that enables you to step outside your role to add value wherever you can</li><li>Opportunities to grow your expertise and take on new challenges</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</li></ul></div></div></div><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$150,000-$200,000</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","additionalLocations":["Houston","Nashville","Charlotte","Chicago","Jersey City","Philadelphia","Wilmington"],"postedOn":"Posted 9 Days Ago","startDate":"2023-09-28","timeType":"Full time","jobReqId":"56646","jobPostingId":"Commercial-Lending-Associate-Attorney_56646","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/Commercial-Lending-Associate-Attorney_56646","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}