{"id":"4c26a0cb7c8a10010b846516ead20000","title":"Python Developer (Cyber Security)","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Join us as our Python Developer!</b></p><p></p><p>Brown Brothers Harriman is currently recruiting <b>Python</b><b> Developer </b>to join our<b> Cyber Security</b> organization. </p><p></p><p>Responsibilities</p><ul><li>As a Python Software Engineer, you will be responsible for developing and maintaining software systems using Python, Django, SQL, Bash, Javascript, and other related technologies.</li><li>As a Python developer, you will be working on expanding and maintaining our Django web application, building and maintaining Plotly Dash-based visualizations, building and maintaining Python-based ETL applications, researching emerging technologies, and helping us manage our server infrastructure.</li><li>You will work closely with other engineers, product managers, and stakeholders to deliver high-quality software solutions that meet the needs of internal clients</li><li>You will write clean, efficient, and well-documented code that adheres to industry best practices and standards while utilizing development standards like version control and well-documented testing.</li><li>You will continuously review our software systems and identify areas for improvement, implementing new features, and optimizing performance; you will also leverage your experience to suggest processes to automate.</li><li>You will stay up to date with emerging technologies and industry trends and apply them to software systems as appropriate.</li></ul><p></p><p>Qualifications/Skills</p><p>Bachelor&#39;s degree in Computer Science, Software Engineering, or a related field</p><ul><li>5&#43; years of experience in software development using Python (including Django and Plotly Dash) and SQL. Familiarity and experience with object-oriented design a big plus.</li><li>Strong understanding of software development principles and best practices, including Agile methodologies, version control, and testing.</li><li>Strong problem-solving skills and ability to troubleshoot complex software systems.</li><li>Experience with front-end technologies (like JavaScript and HTML5) used in conjunction with Django and Plotly Dash.</li><li>Experience working with Linux-based infrastructure and services in a corporate setting.</li><li>Experience with secure coding principles and security best practices.</li><li>Excellent communication skills and ability to work collaboratively in a team environment or  independently and manage multiple priorities and deadlines.</li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>95,000 - 135,000 (Jersey City)</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"Jersey City","additionalLocations":["Philadelphia"],"postedOn":"Posted 2 Days Ago","startDate":"2023-10-05","timeType":"Full time","jobReqId":"54818","jobPostingId":"Systems-Programmer-Analyst-II-Java_54818","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Jersey City","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Jersey-City/Systems-Programmer-Analyst-II-Java_54818","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}