{"id":"4c26a0cb7c8a1000d3354a4063ff0000","title":"Client Associate","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Brown Brothers Harriman is currently recruiting Client Associate to join our Private Banking team. In this role you will service increasingly complex, multigenerational families with significant wealth and administrative requirements. The Client Associate will support the Relationship Managers and Relationship Associates within the PWM Team or Office. They will have a deep knowledge of the client and fully understand and anticipate what needs to be done and when. This position is also responsible for assisting with client deliverables (such as Funds Transfers &amp; coordinated tax/bill payments), communication and ensuring adequate support. </p><p></p><p><span>Some of your key responsibilities include:   </span></p><p></p><p><span>Client Service</span></p><p></p><ul><li>Coordinate with RM’s to ensure that the day-to-day administrative activities of the client base’s needs are met to the Family Office’s standards.</li><li>Ensure no call or communication goes unaddressed.</li><li>Build trust &amp; credibility with clients.</li><li>Compliance to privacy and confidentiality standards a must.</li><li>Be alert to client complaints when speaking with clients. Troubleshoot and follow through with administrative processes to resolve client issues.</li><li>Support the relationship management team in efforts to grow the business through client prospecting via associated research.</li><li>Access BBH internal resources as needed.</li><li>Assist with ad hoc administrative support for the team as needed.</li></ul><p></p><p><span>Client Support and Transaction Processing</span></p><ul><li>Handle asset transfers including ACH/wires, bill payments, estimated tax payments, capital calls and check requests/deposits daily.</li><li>Troubleshoot and follow through with administrative processes and across client issues.</li><li>Perform various other related duties as required to facilitate the productivity of the department.</li><li>Assisting RA’s &amp; RM’s with account maintenance.</li><li>Helping with client gift letters, mailing &amp; confirming receipt gift letters via certified mail.</li></ul><p></p><p><span>Risk Management &amp; Administration</span></p><ul><li>Elevate all client at risk issues to RM and/or OH.</li><li>The Client Associate also works with the office manager and relationship teams to minimize risk and exposure to the firm.</li><li>Adhere to Risk guidelines and all procedural controls in the delivery of services to clients.</li><li>Abide by BBH’s privacy and confidentiality standards.</li><li>Report all potential client complaints to PB Risk.</li><li>Help to monitor overdraft reporting.</li><li>Help in ensuring up to date client Investment Policy Statements or any delinquent KYC/AML/ECMS documentation are uploaded/updated in a timely manner.</li><li>Provide any documentation needed in the event of onsite audits.</li></ul><p></p><p><span>Business &amp; Professional Leadership / Processes and Productivity Improvement</span></p><ul><li>Foster a positive atmosphere within the office and with colleagues, encourage teamwork and compatibility, support goals and objectives of the business. </li><li>Assist team members with day-to-day activities when needed/providing backup.</li><li>Communicate professionally and constructively to effectively resolve issues.</li><li>Always represent professional behavior and etiquette, serve as model for other employees.</li><li>Create an office culture of accountability with respect to quality and timeliness by actively participating in performance management process.</li><li>Gain efficiencies to improve individual productivity.</li><li>Manage self to develop both professionally and personally by utilizing the internal resources at BBH.</li><li>Participate in project work as needed.</li></ul><p></p><p><span>Qualifications</span></p><ul><li>BA or Equivalent</li><li>4&#43; years or relevant experience in a Client Advisor role</li><li>Wealth Management/Private Banking experience preferred</li><li>Microsoft Office, Pivotal CRM, Outlook, Sungard Addvantage, Infuse (Worldview), ECMS</li><li>Ability to identify, escalate and resolve problems/issues</li><li>Ability to communicate professionally through effective verbal and written skills</li><li>Demonstrates efficient time management skills</li><li>Demonstrates organizational skills and an attention to detail</li><li>Ability to prioritize tasks and manage multiple projects</li><li>Interpersonal skills/ability to work in a team environment</li><li>Demonstrates analytical and research skills</li><li>Ability to meet deadlines and work under pressure</li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Chicago","postedOn":"Posted 2 Days Ago","startDate":"2023-10-05","timeType":"Full time","jobReqId":"55401","jobPostingId":"Client-Associate_55401","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Chicago","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Chicago/Client-Associate_55401","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}