{"id":"4c7966a585a90101a1f6acba25230000","title":"HR Business Partner","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Join us as a Human Resources Business Partner </b></p><p>Brown Brothers Harriman is currently recruiting an HRBP to join our Human Resources Team. In this role you will be responsible for overseeing and executing HR strategies globally for the change the bank organization within Service Delivery, which includes Alternatives; Custody Operations and Market Services, Fund Services, Transfer Agency, Workforce Transformation and Shared Services and Chief Administration Office. This role reports into a  Sr. HRBP. This position understands and anticipates the needs of LOB leadership and proactively implements HR strategies to support business goals and growth. The HR Manager collaborates with HR Centers of Knowledge to manage and coordinate all facets of HR, including Compensation, Employee Relations, Talent Acquisition, Talent and Development and Diversity to help the business achieve its goals. This position is responsible to drive for results and utilize metrics that enhance the employee value proposition organizational effectiveness, managerial capability, competitive compensation strategies, talent development and succession planning for the LOB for respective client groups or population. </p><p></p><p><b>Some of your key responsibilities include:   </b></p><ul><li>Understand and anticipate the client needs and develop HR strategies, in line with business goals.</li><li>Establish and build strong relationships with Senior leaders IN SERVICE DELIVERY to deliver business aligned HR solutions that are congruent with business goals and objectives.</li><li>Execute HR strategies and/or priorities which support business goals as appropriate for respective areas.</li><li>Assist in the development of a comprehensive talent strategy, supported by succession plans to ensure the current and future caliber of talent needed to support the business, is in place.</li><li>Take a leadership role and partner with key stakeholders in SERVICE DELIVERY Leadership to derive/implement effective workforces planning strategy to support client needs</li><li>Support the management of an effective workforce planning strategy, to support client needs.</li><li>Help implement the organizational design of the LOB and create an HR framework, which proactively supports business growth.</li><li>Collaborate and support LOB Partners and or local leadership on the BBH Performance Management program and annual compensation cycle, to ensure decisions are performance based and consistent with talent development goals.</li><li>Provide guidance and coaching to LOB management and or local leadership to increase effectiveness and global cohesiveness..</li><li>Support client leadership on BBH Performance Management program and annual compensation cycle to ensure decisions are consistent with overall business strategy.</li><li>Provide change management to guide leadership on how to effectively navigate new HR programs and/or policies, as needed.</li><li>Create change management plans for client, as needed, to support changes to the organization structure, implementation of business strategies, introduction of new business practices, etc.</li><li>Provide guidance and counsel to an organization in the midst or organization change and shifting directions.</li><li>Deliver both solicited and unsolicited leadership feedback to managers and other senior leaders. Provide coaching, as needed, to address issues.</li><li>Partner with LOB leaders to identify the HR metrics relevant for reporting to the business.</li><li>Implement appropriate metrics which correlate to the achievement of business objectives.</li><li>Analyzes data to inform key business decisions and ensure client needs and issues are addressed in connection with LOB needs.</li><li>Coordinate the analysis and publication of relevant HR metrics to communicate to Senior Leadership within client group.</li><li>Escalate issues and feedback to Sr. HRBP and/or appropriate HR area leader as appropriate on effectiveness of programs and policies.</li><li>Effectively integrates HR partners on a regular basis to deliver comprehensive HR products and advisory.</li><li>Works with HR Centers of Knowledge on the development and execution of HR programs aligned to the needs of the client or location they support.</li><li>Works with Sr. HRBP and others within HR Centers of Knowledge including Compensation, HCM, Training &amp; Development and HRDirect to ensure HR Services are aligned to provide for the needs of the business.</li></ul><p></p><p><b>Qualifications:</b></p><ul><li>Bachelors degree or equivalent required</li><li>6-8  years of relevant Human Resources experience</li><li>Experience in the financial services industry preferred</li><li>Masters or other advanced degree a plus</li><li>Exceptional relationship management and interpersonal skills</li><li>Strong negotiation and influencing skills</li><li>Experience developing, building and maintaining strong business partnerships</li><li>Strong financial and business acumen</li><li>Proven ability to effectively interact with all levels of the organization, particularly senior management</li><li>Exceptional leadership, relationship management, communication, organizational and change management skills, required</li><li>Demonstrated ability to develop creative and innovative HR solutions to business issues</li><li>Comprehensive knowledge of strategic planning, organizational effectiveness, talent development, succession planning and leadership effectiveness</li><li>Strong computer skills, including Microsoft Office Suite</li></ul><p></p><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Jersey City","postedOn":"Posted 30+ Days Ago","startDate":"2023-05-12","timeType":"Full time","jobReqId":"53553","jobPostingId":"HR-Business-Partner_53553","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Jersey-City/HR-Business-Partner_53553"}