{"id":"530b10f29f8b1001fd235d67c8d50000","title":"2024 Compliance Internship","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>2024 Compliance Internship</span></b></p><p></p><p>Solving complex issues in the financial industry requires a team of remarkable individuals who dream big and achieve goals by collaborating and innovating with integrity to provide excellent advice and solutions. We hire bright self-starters, provide them the tools to succeed, and give them the freedom to excel.</p><p></p><p>Start your career at Brown Brothers Harriman (BBH) and learn firsthand about our services, culture, and the financial services industry – while growing personally and professionally. We value our internship programs as they help us identify our future hires and leaders.</p><p></p><p>The Global Financial Crime Compliance (GFCC) team within the Compliance department provides guidance and oversight across BBH and is responsible for staying informed about existing and changing industry regulations regarding anti-money laundering (AML), economic sanctions and fraud, and ensuring the Firm adheres to them.  An internship in our GFCC area will provide interns with a deep understanding of current financial crime compliance and geopolitical risks in the finance industry and how to assess and mitigate them</p><p></p><p>Some of the core areas to which our GFCC interns will gain exposure:</p><p></p><ul><li><b><span>Regulatory Oversight</span></b>: Keeping up to date on financial crime regulations that govern our businesses and confirming necessary controls are in <span>place   </span></li><li><b><span>Risk Monitoring &amp; Assessment:</span></b> Tracking the inherent financial crime risks within our business activities and ensuring that controls are in place to mitigate that risk</li><li>Know Your Customer:</li><li><b><span>Surveillance &amp; Monitoring</span></b>: Providing monitoring and surveillance of client and employee activity to confirm adherence to BBH policies and industry regulations around topics including market manipulation, AML, know your client (KYC), economic sanctions, fraud and more  </li><li><b><span>Training &amp; Awareness</span></b>: Educating employees by providing e-learning and reference materials that raise awareness of financial crime-related topics and empower individuals to adhere to all applicable Firm policies and procedures</li></ul><p></p><p><b><span>What can you expect from an Internship with BBH?</span></b></p><ul><li>10-week program where you will be fully immersed in current business needs</li><li>Ongoing training and guidance that enable you to make an impact</li><li>Formal orientation</li><li>Feedback throughout the program to support your development and help you succeed</li><li>Opportunities to interact with senior management</li><li>Networking with other departments / business areas</li><li>Experience the BBH culture firsthand</li><li>Organized social and volunteer events</li></ul><p></p><p><b><span>What BBH’s Compliance group looks for in an intern:</span></b></p><ul><li>Currently a junior in college, entering senior year in fall of 2024</li><li>Strong academic achievement as evidenced through a GPA of 3.3 or higher</li><li>Demonstrated leadership skills through academic and extracurricular activities</li><li>Effective communication skills, written and verbal</li><li>Excellent problem solving and analytical skills</li><li>Sound judgment and demonstrated ability to identify, escalate and resolve a problem</li><li>Ability to prioritize competing demands</li><li>Demonstrated passion for teamwork and success</li><li>PC proficiency, specifically in MS Office</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>25/hour</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","postedOn":"Posted 15 Days Ago","startDate":"2023-09-22","timeType":"Full time","jobReqId":"60616","jobPostingId":"XMLNAME-2024-Compliance-Internship_60616","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/XMLNAME-2024-Compliance-Internship_60616","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}