{"id":"530b10f29f8b1002026abfc0ed270000","title":"2024 Enterprise Risk Management Internship","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>2024 Enterprise Risk Management Internship</span></b></p><p></p><p>Solving complex issues in the financial industry requires a team of remarkable individuals who dream big and achieve goals with teamwork, integrity, and excellence. We hire bright self-starters, provide them the tools to succeed, and give them the freedom to excel.</p><p></p><p>Start your career at Brown Brothers Harriman (BBH) and learn firsthand about our services, culture, and the financial services industry – while growing personally and professionally. We value our internship programs as they help us identify our future hires and leaders.</p><p></p><p>The Enterprise Risk Management (ERM) Internship is a program designed to provide interns with a foundational understanding of risk management at BBH. As an intern you will gain exposure to how ERM provides risk support across the Firm including the responsibilities of various ERM teams and how they work together.  The start of the program will be centered around getting to know BBH and ERM. As an Intern you will develop an understanding of the business and apply the principles you learn through hands-on work. BBH’s ERM internship will include exposure to Investment Management, Private Banking, Cyber/Technology Risk, and ERM Program &amp; Regulatory Management</p><p></p><p><b><span>What can you expect from an Internship with BBH?</span></b></p><ul><li>10-week program where you will be fully immersed in current business needs</li><li>Ongoing training and guidance that enables you to make an impact</li><li>Formal orientation</li><li>Feedback throughout the program to support your development and help you succeed</li><li>Organized social and volunteer events</li></ul><p></p><p><b><span>What can you expect from an Internship with BBH’s Enterprise Risk Management group?</span></b></p><ul><li>An understanding of how BBH considers risk in its strategic business decision making processes. </li><li>How BBH assesses and controls operational risk as well as how each line of business manages processes to help the business define and manage its risk profile.</li><li>As a regulated financial services firm, you will develop an understanding of how ERM, Office of General Counsel, and Compliance collaborate with the line of business to ensure we meet legal and regulatory obligations. </li><li>How ERM works with client facing staff to deliver BBH products and services in a controlled way.</li><li>Critical thinking skills, project management experience, and the ability to navigate through the organization. </li><li>The exposure to various pathways will give you a unique broad experience, with exposure to many areas across BBH in a short period of time. </li></ul><p></p><p><b><span>What BBH’s Enterprise Risk Management group looks for in an intern:</span></b></p><ul><li>Currently a junior in college, entering senior year in Fall of 2024</li><li>Strong academic achievement as evidenced through a GPA of 3.3 or higher</li><li>Demonstrated leadership skills through academic and extracurricular activities</li><li>Strong interest in businesses and financial markets</li><li>Proven leadership capability including strong interpersonal, relationship and collaborations skills</li><li>Excellent problem solving and analytical skills</li><li>Ability to manage multiple tasks simultaneously, while meeting deadlines</li><li>Fluency with MS Office (Advanced Excel, PowerPoint)</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>25/hour</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","additionalLocations":["Boston"],"postedOn":"Posted 15 Days Ago","startDate":"2023-09-22","timeType":"Full time","jobReqId":"60618","jobPostingId":"XMLNAME-2024-Enterprise-Risk-Management-Internship_60618","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/XMLNAME-2024-Enterprise-Risk-Management-Internship_60618","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}