{"id":"5a373c3b386b10015cbd47b1bdd50000","title":"Relationship Excellence - Know Your Customer (KYC) Product Manager","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>KYC Product Manager - BBH Luxembourg</b><br /><br />The Know Your Customer (“KYC”) Product Manager will have the critical responsibility for Global Relationship Excellence (“RE”), with respect to both the onboarding of new clients and periodic review of current client KYC files.  Global Relationship Management works closely with Compliance to understand evolving KYC standards, and ensure files are completed and approved in accordance with those standards.  Ongoing reporting for the program is provided to the BBH offices that are contracted with our clients as well as to the BBH Investor Services’ Client Acceptance Committee, which is made up of Partners of the firm.</p><p><br />The RE Global KYC Product Manager is the KYC Subject Matter Expert for RE’s KYC responsibilities globally, and will provide direct oversight of our KYC center of excellence based in Luxembourg. The position will report to Elizabeth Prickett.</p><p><br /><u><b>Role and Responsibilities</b></u></p><p><br /><u>As the KYC Subject Matter Expert for RE’s KYC responsibilities globally, the RE Global KYC Product Manager will have responsibility for:</u></p><p></p><ul><li>Coordination with the Global Financial Crimes Compliance and regional Compliance teams to monitor regulatory and industry developments relevant to BBH’s KYC program.</li><li>Impact analyses for regulatory changes, to include potential client, resource, process and systems implications, as applicable.</li><li>Successful implementation of BBH KYC program changes, to include client engagement protocols, as applicable. </li><li>Establishment and coordination of the KYC Oversight Committee to provide broader business awareness of KYC-related developments and the relevance of such developments to clients and internal resources. (quarterly frequency proposed).</li><li>Coordination with the Boston-based RE KYC team to:<br />- Ensure that new and renewed files are completed in a timely manager and as is consistent with BBH’s regulatory obligations. <br />- Support Compliance and Internal Audit reviews of the RE KYC responsibilities<br />- Evolve best practices, RE training, tools and protocols to ensure the best client experience and minimize overdue files<br />- Provide input to Systems on KYC<br />- View enhancements and defects.</li></ul><p></p><p><u>As part of managing the Luxembourg center of excellence, the RE Global KYC Product Manager will:</u></p><ul><li>Directly manage the four members of the Luxembourg center of excellence.</li><li>Work directly with the Luxembourg team and European relationship managers to confirm appropriate contacts are identified for KYC-related matters at each client, and help to cultivate a heathy network with client counterparts.</li><li>Serve as the escalation point in instances were a client may require additional information and/or be non-responsive; engage directly with that client to resolve any open items.</li><li>Provide reporting and insights to local senior management, to extent that KYC-related reporting is provided to local management committees and/or boards.</li></ul><p><br /><u><b>Qualifications/skills required:</b></u></p><p><br />The successful candidate will have:</p><p></p><ul><li>7&#43; years experience in financial services</li><li>Familiarity with regulatory and KYC regimes</li><li>Comfort with working with virtual teams globally, and managing a small team locally</li><li>Relationship-building skills, enabling direct client engagement on sometimes sensitive topics</li><li>Perseverance to understand the detail as part of accomplishing the larger, holistic goal</li></ul><p></p><p></p><p></p>","location":"Luxembourg","postedOn":"Posted 30+ Days Ago","startDate":"2023-07-12","timeType":"Full time","jobReqId":"59399","jobPostingId":"Relationship-Excellence---Know-Your-Customer--KYC--Product-Manager_59399","country":{"descriptor":"Luxembourg","id":"328b82f597514643a7683a78fc67c3f1"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Luxembourg","country":{"descriptor":"Luxembourg","alpha2Code":"LU"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Luxembourg/Relationship-Excellence---Know-Your-Customer--KYC--Product-Manager_59399"}