{"id":"6152bedb71c21001525dfd0f585b0000","title":"Financial Reporting Analyst - Alternative Investments","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>The Financial Reporting Analyst prepares drafts of annual and quarterly financial statements and regulatory filings (CIMA/FAR and Form PF) for hedge and private equity funds. The position provides support to senior team members and managers in connection with general fund financial information and completes various projects as assigned by the Financial Reporting Manager.</span></p><p></p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p></p><p><b><span>Responsibilities:</span></b></p><ul><li><p><span>Draft annual and quarterly financial statements and regulatory filings such as CIMA/FAR and Form PF for hedge and private equity funds, as well as internal calendars for such deliverables.</span></p></li><li><p><span>Work with the Fund Reporting Manager on the preparation of procedures.</span></p></li><li><p><span>Develop and maintain a working familiarity with applicable laws, regulations and interpretations governing financial statements and disclosure, including the Investment Company Act of 1940, the Internal Revenue Code, GAAP and other applicable requirements.</span></p></li><li><p><span>Maintain awareness of regulatory changes affecting funds.</span></p></li><li><p><span>Communicate appropriately with the Financial Reporting Team Leader with respect to all timetables and workflow.</span></p></li><li><p><span>Communicate appropriately with other departments within BBH about all relevant matters.</span></p></li><li><p><span>Evaluate and suggest enhancements to BBH Accounting system (Eagle STAR) and BBH Financial Reporting system (Unity) to automate procedures for financial reporting and compliance purposes.</span></p></li><li><p><span>Perform special projects as directed by the Financial Reporting Team Leader.</span></p></li><li><p><span>Assist in the review of work completed by junior level staff members in relation to internal policies, procedures and systems as required.</span></p></li></ul><p></p><p></p><p><b><span>Qualifications:</span></b></p><ul><li><p>BS/BA degree in Business related concentration preferred, or equivalent discipline, and/or equivalent work experience.</p></li><li><p>3&#43; years of alternative and/or mutual fund industry experience including 1 to 2 years of prior financial reporting and/or alternative investment experience.</p></li><li><p>Highly organized, detail oriented, self-motivated.</p></li><li><p>Proven ability to problem solve and recommend solutions.</p></li><li><p>Strong aptitude for accuracy and attention to detail.</p></li><li><p>Capable of monitoring and completing a variety of projects simultaneously.</p></li><li><p>Strong interpersonal skills, as well as verbal and written communication skills.</p></li><li><p>Strong Excel skills</p></li><li><p>Willingness and ability to work in a client-driven, deadline-oriented environment.</p></li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 30+ Days Ago","startDate":"2023-07-05","timeType":"Full time","jobReqId":"59150","jobPostingId":"Financial-Reporting-Analyst---Alternative-Investments_59150","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Financial-Reporting-Analyst---Alternative-Investments_59150","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}