{"id":"6a8c5abe2499010103e2a89af9b10000","title":"Investment Management Marketing Analyst","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>Join us as a Marketing Analyst </span></b></p><p></p><p>As a Marketing Analyst for Investment Management, you will be responsible for contributing and executing Marketing Activities. In this role, you will own activities to deliver high quality visual presentations and materials that capture design and branding elements, to effectively communicate Investment Management strategies and messages. There is strong interaction with infrastructure, enablement, automation, and distribution activities across multiple communication mediums, to deliver integrated marketing programs.</p><p></p><p><b><span>Some of your key responsibilities include:  </span></b></p><ul><li>Develop a comprehensive understanding of BBH Investment Managements business lines and products to produce and maintain key marketing collateral</li><li>Deliver day-to-day core marketing operations processes and/or materials to support best-in-class collateral, presentations and campaign deliver</li><li>Participate in activities that support the IM Sales Enablement platform with focus on standard and custom slides for clients/prospects</li><li>Collaborate with Business Development and Relationship Managers and other internal clients on layout, readability and branding to recommend a course of action that combines your knowledge of best practices with company objectives</li><li>Convert complex data and concepts to attractive tables, graphs, maps, and charts using Word, Excel, PowerPoint, and InDesign</li><li>Collaborate with stakeholders to understand product positioning and marketing requirements to service our existing client base and new prospects</li><li>Leverage marketing technology tools and best practices to execute on Marketing Operations deliverables and provide scale/efficiency and accuracy in all outputs</li><li>Identify and escalate issues and contribute to projects to source correct data and messaging integrity</li><li>Provide support for tracking and reporting of key budget planning, operational processes, and reports throughout the year</li><li>Assist with special ads/invitations and projects on an ad-hoc basis</li></ul><p></p><p><b><span>Qualifications:</span></b></p><ul><li>BA degree</li><li>2&#43; years of working experience and/or knowledge of the securities industry is preferred</li><li>Proficient in Adobe Creative Cloud (Illustrator, Photoshop, Acrobat, and InDesign) and ability to learn how to leverage automation platforms</li><li>Excellent written and verbal communication skills with a professional customer-service approach</li><li>Ability to multi-task and meet deadlines while working under pressure</li><li>Strong attention to detail and willingness to learn and optimize processes</li><li>Organized and willing to take on additional responsibilities</li><li>Ability to work with autonomy as well as in a team environment</li><li>Resourceful and creative problem-solver</li><li>Proficiency in Excel, Word, and PowerPoint</li></ul><p></p><p><b><span>What We Offer</span></b>:</p><ul><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—within the Firm</li><li>Build your Marketing acumen</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>High-quality benefits program emphasizing good health, financial security, and peace of mind</li><li>Volunteer opportunities to give back to your community and help transform the lives of others</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$75,000-$85,000</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","postedOn":"Posted 2 Days Ago","startDate":"2023-10-05","timeType":"Full time","jobReqId":"52855","jobPostingId":"Investment-Management-Marketing-Analyst_52855","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/Investment-Management-Marketing-Analyst_52855","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}