{"id":"886055ffaedd1000b7f7772417680000","title":"Fund Accounting Supervisor","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Risk and Workflow Management</p><ul><li>Supervise a specialized accounting group ensuring timely and accurate product delivery, proper escalation and resolution of high exposure items, and adherence to best practice standards and controls.</li><li>Communicate professionally and constructively to effectively resolve issues in order to minimize risk and NAV exposure.</li></ul><p>.</p><p>Leadership and Staff Supervision</p><ul><li>Understand competencies required for successful job performance and use knowledge to coach and develop team members as well as to identify training needs.</li><li>Energize and inspire team by generating excitement, a sense of pride, and a drive to excel.</li><li>Consistently provide employees with constructive and timely feedback, both positive and negative. Leverage metrics to quantify performance where available.</li><li>Ensure employees have the information and tools necessary to progress. Communicate a clear career path.</li><li>Assign responsibility effectively based on expertise and strengths of team members.</li></ul><p></p><p></p><p>Quality Assurance/Control</p><ul><li>Ensure daily output standards, both quality and timeliness, are met consistently.</li><li>Ensure adherence to all established best practice policies, procedures and controls.</li><li>Assist management in the implementation of policies, procedures and controls.</li><li>Monitor volume, workflows and overtime of team.</li><li>Identify and resolve workflow issues.</li><li>Review error and omission situations and look for corrective action</li><li>Assist in the development and production of management reporting</li></ul><p></p><p></p><p><span>Process Improvement </span></p><ul><li><span>Help to enhance the productivity of the unit by identifying opportunities to increase output/capacity through workflow improvements </span></li><li><span>Challenge all processes, procedures and practices and constantly look for a better way to meet deliverables.</span></li></ul><p></p><p></p><p><span>Education level and/or relevant experience(s)</span></p><ul><li><span>BS/BA degree or equivalent work experience. </span></li><li><span>2 to 3 years of fund accounting, custody, securities processing or other industry experience. </span></li><li><span>1 year supervisory experience a plus.</span></li><li><span>Interpersonal skills. </span></li><li><span> Ability to communicate professionally with others. </span></li><li><span>An aptitude for analytical and problem resolution. </span></li><li><span>Self Starter, proactive, and objective oriented. </span></li><li><span>Enthusiastic leadership skills and ability to engage others.</span></li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 12 Days Ago","startDate":"2023-09-25","timeType":"Full time","jobReqId":"60392","jobPostingId":"Fund-Accounting-Supervisor_60392","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Fund-Accounting-Supervisor_60392"}