{"id":"8d5c8e12bb571001a005a4e25d920000","title":"Investment Tax Manager II","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Investment Tax Manager II reviews work papers and analysis prepared by other staff supporting the taxation of regulated investment companies (RIC) and investment partnerships. Directly supervises other tax staff. Responsible for regularly meeting and communicating with the client and external vendors. The individual is responsible for ensuring that all deliverable schedules are met in a timely manner with accurate product. Manages staff training, trains staff, and prepares management reports.</p><p></p><p>The Investment Tax Manager II position requires a high level of specialized investment tax knowledge. This job is generally responsible for the supervision of other staff, but if warranted highly trained individuals in this specialized area will fulfill the duties of an Investment Tax Manager II, excepting responsibility for the direct management of staff.</p><p></p><p>If you are looking to push your career to the next level, introduce yourself by submitting your resume.</p><p></p><p><b>Key Responsibilities:</b></p><ul><li><p>Review RIC income tax and excise tax provision work papers; review data that supports financial statement preparation and disclosures; review analysis of securities held by RICs; review estimates of RIC distributions and work papers to support shareholder reporting; ensure departmental policies and practices are adhered.</p></li><li><p>Review partnership tax provision work papers; review data that supports financial statement preparation and disclosures.</p></li><li><p>Review analysis of securities held by partnerships; review the calculation of partnership allocations and estimates; ensure departmental policies and practices are adhered.</p></li><li><p>Review tax returns, their supporting work papers, and associated schedules.</p></li><li><p>Review work papers and other documents to support other client deliverables and other BBH deliverables.</p></li><li><p>Oversee the operations of the department including assignment and monitors departmental progress on various deliverables; ensure that all deliverable schedules are met in a timely manner with accurate product; ensure that departmental policies and practices are adhered.</p></li><li><p>Meet and communicate with the client on all tax issues.</p></li><li><p>Ensure the client’s expectations are known and met.</p></li><li><p>Work with the client to assist with investors questions.</p></li><li><p>Interpret rulings and regulations and establishes their effect on our clients’ funds and their shareholders.</p></li><li><p>Manage the status reporting for management review process.</p></li><li><p>Identify and manage process improvement projects.</p></li><li><p>Identify and manage tax automation projects.</p></li><li><p>Manage the department’s training program; participates in technical and other training to develop skills to enhance the employee and client experience; develop investment tax and other accounting skills.</p></li></ul><p></p><p><b>Desired Qualifications:</b></p><ul><li><p>BS/BA degree in Accounting/Finance or equivalent work experience</p></li><li><p>8&#43; years of RIC and investment partnership tax experience</p></li><li><p>Requires tax research skills and extensive knowledge of relevant federal, state and non-US tax statutes, regulations and interpretive rulings or case law</p></li><li><p>Proven ability to work with people and facilitate the smooth workflow between Investment Tax and other internal and external stakeholders.</p></li><li><p>Strong client service skills, team attitude and attention to detail</p></li><li><p>Strong supervisory skills with the ability to prioritize</p></li><li><p>Understanding of investment tax related tax code sections, forms and elections, and tax adjustments of securities</p></li><li><p>Ability to conceptualize and execute projects and initiatives through to completion</p></li><li><p>Creative problem-solving skills, including the ability to identify, recommend, and implement solutions for tax related client issues</p></li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 9 Days Ago","startDate":"2023-09-28","timeType":"Full time","jobReqId":"57945","jobPostingId":"Investment-Tax-Manager-II_57945","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Investment-Tax-Manager-II_57945","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}