{"id":"9fc68effea91100100b24457db850000","title":"Internal Sales Support & Business Manager","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Join us as an Internal Sales Support &amp; Business Manager</b></p><p></p><p>As BBH Investment Management’s (BBH IM) institutional fixed income and equity business grows we are currently recruiting for an Internal Sales Support &amp; Business Manager to join our Business Development &amp; Relationship Management team (BDRM). BDRM is responsible for driving the firm’s business development and ongoing client management across equity and fixed income with institutional and intermediary investors globally. The Internal Sales Support &amp; Business Manager will have wide ranging responsibilities in supporting the running and ongoing improvement of the BDRM team.</p><p></p><p><b>Key responsibilities include:</b></p><ul><li>Designing and implementing a best practice sales support model for BBH’s institutional and intermediary business development and relationship management team and our clients</li><li>Identifying and driving initiatives that will enhance client experience and drive efficiency and smooth operations in the business</li><li>Oversee the overall process for more complex new investment account and fund vehicle openings  </li><li>Lead special projects including developing and executing on plans to drive more value from the Salesforce platform (e.g., additional client/prospect insight and pipeline management)</li><li>Identify and implement ways to enhance Sales Enablement initiatives, portfolio data access and integrity amongst the BDRM team, driving further insight</li><li>Design and implement regular management reporting to increase transparency into business activity, performance, and progress on implementation of our strategy</li><li>Act as a key point of contact for BDRM and partner for multiple stakeholders across the broader business including Operations, Marketing, Technology, Risk, Compliance and Legal</li><li>Partner with Marketing to provide business input and support for various marketing campaigns and events</li></ul><p></p><p><b>Key requirements:</b></p><ul><li>7&#43; years in institutional investment management preferred, including experience as internal sales manager in a financial services organization or in management consulting</li><li>Excellent communication skills, project management skills, and business management reporting experience</li><li>Experience in developing strong, subject matter expertise of our sales service model - knowledge of separate accounts, fund vehicles and associated support needs for our client segments</li><li>Passion for talent development and coaching</li><li>Strong leadership skills with the ability to establish and maintain excellent working relationships</li><li>Strong expertise in problem-solving, continuous improvement techniques and project management</li><li>Highly motivated, self-starter who can operate in an autonomous manner</li><li>Strong interpersonal skills and workshop facilitation expertise</li><li>Strong Microsoft Excel, PowerPoint, and Word skills</li><li>Expertise in Microsoft Teams Capabilities considered a plus</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$130,000 to $160,000</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","postedOn":"Posted 2 Days Ago","startDate":"2023-10-05","timeType":"Full time","jobReqId":"59304","jobPostingId":"Internal-Sales-Support---Business-Manager_59304","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/Internal-Sales-Support---Business-Manager_59304","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}