{"id":"a3f6196e9a4e100151485412d4070000","title":"Investment Tax Analyst Sr","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>POSITION SUMMARY</p><p>The Senior Investment Tax Analyst completes complex tax analysis and prepares tax work papers supporting the taxation of regulated investment companies (RIC) and investment partnerships incorporating the work of Investment Tax Specialists. This includes tax provisions, support for financial statement preparation/disclosures, required RIC distributions and estimates, shareholder tax reporting, and preparation of partnership allocations. The Senior Analyst conducts analysis of securities, preparation of tax returns and their associated schedules and attachments.</p><p></p><p>The Senior Investment Tax Analyst also completes work paper reviews and assists Investment Tax Managers in ensuring that all deliverable schedules are met in a timely manner with accurate product. The Senior Investment Tax Analyst trains, provides technical guidance to and reviews the work of more junior Specialists. Serves as an escalation point and will provide recommendations on resolution of issues to Investment Tax Managers after consideration of options.</p><p></p><p><span>PRINCIPAL RESPONSIBILITIES</span></p><p>1. Tax provision and distribution work papers for RICs</p><ul><li><p>Prepares and reviews RIC income tax and excise tax provision work papers; Prepares data that supports financial statement preparation and disclosures</p></li><li><p>Complete complex analysis of securities held by RICs; Prepares estimates of RIC distributions</p></li><li><p>Prepares work papers to support shareholder reporting</p></li><li><p>Supports Analysts as needed</p></li></ul><p></p><p>2. Tax provision and allocation work papers for partnerships</p><ul><li><p>Prepare and review partnership tax provision work papers. Prepares data that supports financial statement preparation and disclosures</p></li><li><p>Tax analysis of more complex securities held by partnerships; Calculates partnership allocations and estimates.</p></li><li><p>Supports Analysts as needed</p></li></ul><p></p><p>3. Preparation of tax returns</p><ul><li><p>Prepares and reviews tax returns, their supporting work papers and associated schedules</p></li><li><p>Supports Analysts as needed</p></li></ul><p></p><p>4. Other client and BBH deliverables</p><ul><li><p>Prepares and reviews work papers and other documents to support other client deliverables and other BBH deliverables.</p></li><li><p></p></li></ul><p>5. Training</p><ul><li><p>Participate in technical and other training to develop skills to enhance the employee and client experience; Develops investment tax and other accounting skills.</p></li><li><p>Given opportunities to participate in Analyst training</p></li></ul><p></p><p>6. Monitor and Scheduling of deliverables</p><ul><li><p>Assists Managers in ensuring that all deliverable schedules are met in a timely manner with accurate product</p></li></ul><p></p><p><span>KNOWLEDGE, SKILLS AND ABILITIES</span></p><p>Education level and/or relevant experience(s)</p><ul><li><p>BS/BA degree in Accounting/Finance or equivalent work experience</p></li><li><p>3 to 5 years of RIC and/or investment partnership tax experience</p></li></ul><p></p><p>Knowledge and skills (general and technical)</p><ul><li><p>Solid understanding of tax concepts, practices, and procedures</p></li><li><p>Strong client service skills, team attitude and attention to detail</p></li><li><p>Ability to understand financial statements and fund accounting reports and spreadsheets</p></li><li><p>Proficiency in Microsoft Excel and Word needed</p></li><li><p>Understanding of mutual fund related tax code sections, forms and elections, and tax adjustments of securities</p></li></ul><p></p><p>Other requirements (licenses, certifications, specialized training, physical or mental abilities required)</p><ul><li><p>Ability to conceptualize and execute projects and initiatives through to completion</p></li><li><p>Creative problem solving skills, including the ability to identify, recommend, and implement solutions for tax related client issues</p></li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$75,000 - $90,500</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"Jersey City","additionalLocations":["Boston"],"postedOn":"Posted Yesterday","startDate":"2023-10-06","timeType":"Full time","jobReqId":"60047","jobPostingId":"Investment-Tax-Analyst-Sr_60047","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Jersey City","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Jersey-City/Investment-Tax-Analyst-Sr_60047","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}