{"id":"a3f6196e9a4e1001a56d1d6216760000","title":"Operations Specialist Senior IMO","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>POSITION SUMMARY</p><p>The Global Institutional Middle Office (GIMO) acts as an important conduit between a client’s front office trading, oversight functions, and back office servicing centers. This role, as part of a team, is responsible for custody reconciliations, including matching and trade dissemination to the broker, the custodian and the fund accounting agent for BBH’s institutional clients. In this role you are expected to have greater knowledge and the ability to independently process various asset types, be responsible for daily client reporting and assisting the supervisor with projects and process improvements. This role is expected to transfer knowledge and train junior staff members and may review the work of others as the “checker”.</p><p></p><p>PRINCIPAL RESPONSIBILITIES</p><p>1. Transaction Processing/Resolution</p><ul><li><p>Matches or identifies discrepancies of client’s trade economic details as compared to the client’s counterparty instruction.</p></li><li><p>Prepares communication of settlement of security and foreign exchange trades, collateral moves or corporate actions in different markets to the client’s custodian.</p></li><li><p>Monitors and resolves any failed trades, cash movements, collateral settlements or corporate actions.</p></li><li><p>Works closely with the client and client’s counterparty(s) to ensure transactions and/or reporting related to securities are processed timely and accurately.</p></li><li><p>Leveraging depth of knowledge of settlement procedures and restrictions for various markets and asset types; aids team members in resolving issues</p></li><li><p>Manages high volume of transactions of complex assets while adhering to daily deadlines with high quality of work.</p></li><li><p>Reviews team email inbox to identify any client or client counterparty trade inquiries to address and resolve in a timely and efficient manner as indicated in client’s service agreement.</p></li></ul><p></p><p>2. Technology</p><ul><li><p>Utilizes BBH GIMO technology and GIMO vendor products to perform daily transaction processes as described above.</p></li><li><p>Assists supervisor with training of new hires on how to utilize the BBH GIMO technology and IMO vendor products.</p></li></ul><p></p><p>3. Transaction Reporting/Dissemination</p><ul><li><p>Creates and distributes to client, client counterparties and team members daily reporting of unmatched and/or failed security and foreign exchange trades, cash balances, and corporate action notices.</p></li><li><p>Assists team members with timely resolution of unmatched and failed trades, cash movements, collateral settlements or corporate actions.</p></li><li><p>Ensures daily reporting is complete and accurate prior to distribution to both internal and external parties while adhering to daily deadlines.</p></li><li><p>Escalates to supervisor unresolved unmatched and failed trades, cash movements, collateral settlements or corporate actions.</p></li></ul><p></p><p>4. Teamwork</p><ul><li><p>Collectively work with team members to ensure daily requirements are met.</p></li><li><p>Create and update procedures as needed.</p></li><li><p>Assists team members as first point of contact for day to day processing questions.</p></li><li><p>Provides training on BBH settlement systems to new employees as well as assisting with training of existing employees on new task and functions within the group.</p></li></ul><p></p><p>5. Communication</p><ul><li><p>Communicates professionally and timely via email, phone, or in person with internal and external clients and counterparties</p></li><li><p>Assists the Supervisor in day to day client interactions, as needed.</p></li><li><p>Provides feedback on client’s counterparty performance.</p></li></ul><p></p><p>6. Client Service</p><ul><li><p>Provides superior client service to ensure client satisfaction and reference ability.</p></li><li><p>Responds to client inquiries in a timely and professional manner, meeting client’s standards as indicated in client’s service agreement.</p></li><li><p>Acts as first point of escalation for client on day to day questions or concerns.</p></li></ul><p></p><p>7. Risk Mitigation</p><ul><li><p>Has in depth knowledge of fundamentals of relevant systems and processes. Follows procedures and adheres to policies.</p></li><li><p>Understands how specific functions within GIMO impact other teams in Service Delivery.</p></li><li><p>Has a risk adverse mindset identifying potential areas of risk.</p></li><li><p>Proactively identifies, communicates and escalates potential risks found, errors and issues timely.</p></li><li><p>Ensures data privacy and integrity of data always. Avoids and escalates any cyber risks.</p></li><li><p>Follows our BCP protocol and security procedures</p></li></ul><p></p><p>8. Process Improvement</p><ul><li><p>Identifies and provides suggestions to Supervisor for enhanced processes and improved controls.</p></li><li><p>Participates in product tests and rollouts, as well as system upgrades to increase productivity and improve accuracy.</p></li><li><p>Understands the big picture and how a specific function impacts the team directly as well as the GIMO department and firm.</p></li></ul><p></p><p><span>KNOWLEDGE SKILLS AND ABILITIES </span><span> </span></p><p>irect Moderate Limited</p><p>Primary internal and external contacts with whom position interacts, and purpose/nature of contact:</p><p>* External: Clients, Custodians, Brokers, 3rd party Vendors, Outside Counsel, Agent Bank</p><p>* Internal: Other groups within the division and across the LOB</p><p></p><p>KNOWLEDGE, SKILLS AND ABILITIES</p><p></p><p>Education level and/or relevant experience(s)</p><ul><li><p>BA/BS degree. Preference given to Business, Economics, Accounting, and Mathematics majors</p></li><li><p>1 to 2 years of experience in the Financial Service Industry, preferably in Fund Accounting, Fund Administration or Middle Office Operations.</p></li></ul><p></p><p>Knowledge and skills (general and technical)</p><ul><li><p>Ability to communicate professionally both verbally and written.</p></li><li><p>Organizational skills and detail-oriented.</p></li><li><p>Ability to work independently, efficiently, and effectively to meet time constraints while handling multiple tasks.</p></li><li><p>Ability to work collaboratively in a team environment.</p></li><li><p>Strong commitment to quality.</p></li><li><p>Ability to adapt to a changing business, legal, and regulatory environment.</p></li><li><p>Aptitude for thorough and timely research, analysis and resolution of a problem.</p></li><li><p>Have interest and flexibility to work on different assignments and develop new skills by performing different functions within IMO</p></li><li><p>Aptitude for assisting and training other employees.</p></li><li><p>General PC skills including Microsoft Office Suite.</p></li><li><p>Knowledge of industry vendors and products, i.e. matching utilities, custodians, accounting platforms, etc.</p></li></ul><p></p><p>Other requirements (licenses, certifications, specialized training, physical or mental abilities required)</p><ul><li><p>Ability to stay focused on detailed information for long periods of time</p></li><li><p>Ability to work on a computer for several hours</p></li><li><p>Ability to discern numbers/number sequels and reading-comprehension</p></li><li><p>Ability to handle work pressure in a fast pace environment</p></li><li><p>Ability and willingness to work overtime when needed</p></li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 30+ Days Ago","startDate":"2023-08-24","timeType":"Full time","jobReqId":"59935","jobPostingId":"Operations-Specialist-Senior-IMO_59935","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Operations-Specialist-Senior-IMO_59935","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}