{"id":"a9e80990bdad1001543f5ea06d9b0000","title":"Senior Family Business Advisor","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Join us as a Senior Family Business Advisor</b></p><p></p><p>Brown Brothers Harriman is currently recruiting a Senior Family Business Advisor to join our Center for Family Business (“CFB”).  In this role you will serve as one of the firm’s subject matter experts, supporting our colleagues and some of the largest business-owning families in the world in the areas of generational transition (succession), governance, shareholder conflict resolution, shareholder strategy, and capital / liquidity strategies for private business owners.</p><p></p><p>Drawing on your deep experience, you will join the broader BBH client team when they are called to help assess practices and behaviors of complex family enterprises. You will assist in a myriad of situations from consulting with a colleague on how to think about the development of a family employment policy to assisting a group of business owners who are struggling with how to break a deadlock over control disagreements. You will work together (along with external advisors as appropriate) as a team to help deliver a best-in-class support experience to the client as the situation demands.</p><p></p><p>The Senior Family Business Advisor also creates draw to BBH by acting as a continuous purveyor of thought leadership on the topics most important to substantial family business owners. This thought leadership is informed by leading thinkers in practice and academia. You will continually test and refine the advice we offer as a firm by leading the delivery of support to large and complex business-owning families, collaborating with others to ensure we are helping our clients to the greatest extent possible.</p><p></p><p><b>Some of your key responsibilities include:   </b></p><ul><li><b>Client Engagement</b><ul><li>Serving as a senior subject matter expert with a reputation as an expert on the unique issues that occur at the intersection of a business, family, and wealth</li><li>Earning the confidence of colleagues to be invited in to work on the largest opportunities and relationships in the firm</li><li>Joining meetings with Relationship Managers and Partners who identify related needs with their business-owning prospects and clients</li></ul></li><li><b>New Business Growth</b><ul><li>Delivering CFB support in a manner that enhances the BBH value proposition for business owners such that owners want to become BBH clients, or materially deepen their relationship with BBH</li><li>Identifying opportunities for business owners and their families to leverage BBH&#39;s advisory and capital, and partnering with colleagues in our Corporate Advisory &amp; Banking team who can assist with those needs</li></ul></li></ul><p><b>Qualifications:</b></p><ul><li>15&#43; years’ experience in law, management or family business consulting, corporate or investment banking with the predominant client being business-owning families or non-institutional private business owners</li><li>Demonstrable record working with CEOs, board chairs, and private business owners ($500 million Enterprise Value) on matters of high strategic importance to those individuals</li><li>Exceptional emotional intelligence; comfort navigating high conflict situations</li><li>A keen ability to tactfully communicate difficult messages to business leaders without being argumentative</li><li>A talent for uncovering complex interrelated issues, sorting and prioritizing them; clearly communicating findings, and assembling action plans that can help create forward progress on issues of concern</li></ul><p></p><p><b>What We Offer</b>:</p><ul><li>A collaborative environment that enables you to step outside your role to add value wherever you can</li><li>Direct access to clients, information and experts across all business areas</li><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>High-quality benefits program emphasizing good health, financial security, and peace of mind</li><li>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</li><li>Volunteer opportunities to give back to your community and help transform the lives of others</li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Philadelphia","additionalLocations":["Nashville","Boston","Charlotte","Chicago"],"postedOn":"Posted 30+ Days Ago","startDate":"2023-06-07","timeType":"Full time","jobReqId":"58589","jobPostingId":"Senior-Family-Business-Advisor_58589","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Philadelphia","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Philadelphia/Senior-Family-Business-Advisor_58589","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}