{"id":"b7c7bf49c18a1001e74e84f43a2f0000","title":"Legal Support Senior Representative","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>At Brown Brothers Harriman, we believe no job is too big or small for any of us to handle if it helps our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of person who speaks their mind, truly listens and steps outside their role to add value wherever they can. Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek someone who takes great pride in their work and is inspired and motivated by their role in protecting and enhancing our client’s financial well-being.</p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p></p><p><b><span>Join us as Senior Legal Support Representative</span></b></p><p></p><p>As a Senior Legal Support Representative, you will be responsible for providing support within the Corporate Secretary and Legal Administration (CSLA) team, which is responsible for maintaining the legal and domiciliary structure of BBH clients, including board meeting preparation and support, annual general meetings, maintenance of client contracts and organizational documents, compliance with the local regulator and performing related regulatory filings, as needed.  You will be expected to perform these duties with some supervision from the Assistant Corporate Secretary.</p><p></p><p><b><u><span>Key Responsibilities</span></u></b><u><span>:</span></u></p><ul><li>Coordinate organization of Board Meetings and production of Board Meeting Materials. </li><li>Attend Board Meetings and draft minutes. </li><li>Prepare Annual General Meeting materials, or other shareholder meetings materials, attend meeting and draft <span>minutes.   </span></li><li>With minimal supervision, draft memorandum and resolutions for board meetings.</li><li>Maintain corporate calendars for Board meetings and annual general meetings.</li><li>Oversee the maintenance of the corporate records for all domiciliary clients, including confirming that all records at the time of conversion have been logged and ongoing maintenance and review of these records is being performed</li><li>Independently obtain copies of the annual financial statements and prepare filings for the local regulators (RCS).  </li><li>Prepare other regulatory filings as is necessary.</li><li>Participate in the annual review of department Policies and Procedures, in order to validate their effectiveness. </li><li>Participate in special projects involving the CSLA department, as directed by the Assistant Corporate Secretary.</li></ul><p></p><p><b><u><span>Essentials: </span></u></b></p><p><b><span>Education level and/or relevant experience(s): </span></b></p><ul><li>You have at least 2 years of experience as corporate secretary ideally acquired in an international organization in Luxembourg. BA/degree in Law or equivalent work experience will be considered as a plus.</li><li>You are familiar with corporate governance requirements applicable to regulated and unregulated companies</li><li>You have excellent verbal and written communication skills in English (a good command of any further European language an advantage)</li><li>You demonstrate accountability and resilience when facing challenges, responsive and display exceptional customer service, take ownership for tasks assigned to you, have an exceptional eye for details and have strong interpersonal skills and communicate well and timely</li><li>You are a proficient user on MS Office products, Outlook, Excel, Word, Nuance power PDF and Power Point</li></ul><p></p><p><b><u><span>What You Can Expect At BBH:</span></u></b></p><p>If you join BBH you will find collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, to take on new challenges, to maximize your potential and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program, which emphasizes good health, financial security, and peace of mind. Ultimately, we want to provide you with a position which, at the same time, is both rewarding and allows for a balanced professional and personal experience at every stage of your career. We, here at BBH, focuses on more than just the financial and business thrive. Through our BBH Cares program we offer volunteering opportunities giving you the opportunity to give back to your community and to help transform the lives of others. </p><p></p><p></p><p></p><p></p>","location":"Luxembourg","postedOn":"Posted 30+ Days Ago","startDate":"2023-08-11","timeType":"Full time","jobReqId":"59724","jobPostingId":"Legal-Support-Senior-Representative_59724","country":{"descriptor":"Luxembourg","id":"328b82f597514643a7683a78fc67c3f1"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Luxembourg","country":{"descriptor":"Luxembourg","alpha2Code":"LU"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Luxembourg/Legal-Support-Senior-Representative_59724"}