{"id":"c6b4de06d65f1001aba40d51e63a0000","title":"Sr. Risk Analyst","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>Job Description Summary</span></b></p><p>The Senior Risk Analyst is part of a global team supporting risk matters for the Investor Services business line.  The Senior Risk Analyst assists members of the Risk Management team with general risk management efforts pertaining to the proactive identification, assessment, monitoring, measurement, mitigation, and communication of risks across the organization.  This position is focused on risk analysis and support,  control evaluation and testing, and reporting of risk matters to senior Risk management and InServ management.</p><p></p><p><b><span>Key Responsibilities </span></b></p><ul><li>Provide a high standard of reporting and communication on risk and control topics to internal stakeholders, representing InServ Risk to the InServ business and control functions (Enterprise Risk Management, Legal, Compliance and Internal Audit).</li><li>Ensure new business and day to day operations are in line with the firm’s stated risk appetite.</li><li>Identify, assess and escalate trends and control weaknesses; support the development of sustainable solutions for the management of risk.</li><li>Monitor, track and report on corrective action plans, while analyzing trends and assessing root causes related to audit/regulatory findings, risk and control self-assessment gaps and risk events.</li><li>Leverage existing risk management tools, such as the firmwide risk event database and risk and control self-assessment database to assist in causal analysis of risk matters/incidents and as a tool to analyze and report on trends.</li><li>Lead and drive a culture of risk awareness, transparency and escalation across the InServ line of business.</li><li>Support the coordination and execution of externally engaged control audits across the InServ complex. </li><li>Perform targeted control reviews and analysis to support the effectiveness and strengthening of the control environment.  </li><li>Incorporate market and industry insights to initiatives under review the InServ line of business.</li><li>Support training initiatives to develop risk awareness, risk culture and an understanding of fundamental control principles across the business.</li><li>Work closely with senior business leadership and peers in Enterprise Risk Management, Legal, Compliance and Internal Audit to ensure effective and proactive business risk mitigation.</li></ul><p></p><p><b><span>Qualifications </span></b></p><ul><li>Bachelor’s degree in finance or related discipline required.</li><li>A minimum of 5 years relevant industry experience with a risk and control focus.</li><li>Proven track record of leadership.</li><li>Strong verbal and written communication and presentation skills.</li><li>Strong collaboration and interpersonal communication skills to be able to influence, guide and credibly challenge stakeholders in relation to risk and control matters.</li><li>Planning and organizational skills, analytical skills and an eye for detail.</li><li>Strong analytical and problem-solving skills with a risk and control focus and attention to detail.</li></ul><p></p><p><b><u><span>What We Offer</span></u></b></p><ul><li>A collaborative environment that enables you to step outside your role to add value wherever you can.</li><li>Direct access to clients, information and experts across all business areas around the world</li><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm.</li><li>A culture of inclusion that values each employee’s unique perspective.</li><li>High-quality benefits program emphasizing good health, financial security, and peace of mind.</li><li>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage.</li><li>Volunteer opportunities to give back to your community and help transform the lives of others.</li></ul><p></p><p>This role is based in our Boston location and will be a hybrid role, with three days in office.</p><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 11 Days Ago","startDate":"2023-09-26","timeType":"Full time","jobReqId":"54699","jobPostingId":"Sr-Risk-Analyst--InServ_54699","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Sr-Risk-Analyst--InServ_54699","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}