{"id":"c9a7dd0dc3c3100128c292d821b80000","title":"Corporate Communications and PR Manager","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p>At Brown Brothers Harriman, we believe no job is too big or small for any of us to handle if it helps our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of person who speaks their mind, truly listens and steps outside their role to add value wherever they can. Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek someone who takes great pride in their work and is inspired and motivated by their role in protecting and enhancing our client’s financial well-being.</p><p></p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p></p><p>As a private partnership who trades in trust, Brown Brothers Harriman (BBH) considers our brand reputation to be a critically important asset.  Reporting to the Head of Firmwide Brand and Communications, the Corporate Communications and PR Manager (CCM) is responsible for ensuring a unified message and consistent strategy at the brand level across lines of business and distribution channels. The CCM role is visible and high profile, working across lines of business and with the firm’s senior leadership team.</p><p>In this role, the CCM will oversee the firm’s brand positioning across distribution channels, specifically for public relations, social media, and corporate collateral. The CCM will proactively identify and recommend new opportunities for brand growth, innovation, and will help drive BBH brand awareness in local markets where we do business.</p><p></p><p>The CCM works closely with the head of Firmwide Brand and the growing Firmwide Brand team to manage the public relations programs of the firm and select lines of business. The CCM may also be asked to work collaboratively with key stakeholders to ensure the internal communications and crisis communications processes is aligned/attentive to the evolving business needs.</p><p></p><p>He or she must thrive under deadline, be able to meet established timelines, be sensitive to global cultural differences, and will be expected to safeguard confidential and highly sensitive information. The candidate must be able to work effectively across management levels, including with senior executives and key stakeholders, and be able to establish relationships with PR agency representatives and other external parties.</p><p></p><p><b><span>Some of your key responsibilities include:</span> </b></p><p><span>Brand Management:</span></p><ul><li><span>Oversee use of the Firm’s brand globally including brand content curation and distribution in collaboration with marketing, internal communications, and business teams</span></li><li><span>Oversee and manage the Firm’s trademarks and other owned </span>assets.</li><li>Proactively manage BBH branding and messaging with LOB and product marketing groups to ensure all materials present the BBH brand consistently and follow corporate standards.</li><li><span>Identify new opportunities for growth and innovation; work with LOB marketers to build the brand in local markets. </span></li><li><span>Work with business teams to develop Firm collateral and advertising, including Annual Report, Statement of Condition and other materials. </span></li><li><span>Collaborate with HR and Internal Communications to identify opportunities to evolve the employer brand. </span></li><li><span>Leverage available data/metrics to improve branding </span>efforts.</li></ul><p></p><p><span>Social media/digital content and strategy:</span></p><ul><li><span>Support the development and launch of new digital and social media channels in partnership with the larger Firmwide Marketing team. </span></li><li><span>Evaluate content and LOB materials for distribution to ensure consistency of overall Firm messaging and </span>voice.</li><li>Evaluate and make recommendations to increase corporate social media presence and visibility in support of the firm’s overall strategy.</li></ul><p></p><p><span>Firmwide Public Relations</span></p><ul><li><span>Serve as firm liaison for PR agency relationship for select lines of business as well as manage the corresponding budget. </span></li><li><span>Coordinate day-to-day requests from PR agency within Private Banking and Investment Management including recommending appropriate LOB spokesperson and preparing him/her for </span>interviews.</li><li><span>Leverage PR framework to assist spokespeople in preparing for corporate media and public engagements/communications. </span></li><li><span>Develop and implement process to evaluate PR program through </span>data.</li></ul><p></p><p><span>Crisis Communications</span></p><ul><li><span>Work collaboratively with key stakeholders to ensure crisis communications processes is aligned/attentive to the evolving business </span>needs.</li><li><span>Draft concise written external responses to sensitive issues</span></li><li><span>Work collaboratively with PR firm and digital team to pro-actively monitor media/social media activity and compile suggested </span>responses.</li><li><span>Maintain library of strategic responses to recurring crisis/issues </span></li></ul><p></p><p><span>Strategic/Internal</span> <span>Communications</span></p><ul><li>Support strategic internal brand communications that inform and engage employees</li><li>Work closely with Head of Marketing, Head of Corporate Brand and Comms, and internal communications team to develop the strategy for live presentation of business results to employees, including via an annual “Around the World” tour where results are presented in multiple offices across regions.</li></ul><p></p><p><b><span>Education level and/or relevant experience(s):</span></b></p><ul><li>7-10 years of relevant experience in a strategic marketing, brand marketing or communications role; PR agency or other experience preferred.</li></ul><p></p><p><b><span>Knowledge and skills:</span></b></p><ul><li>Excellent oral and written communication skills</li><li>Proven experience in project management, developing and implementing strategic plans.</li><li>Excellent strategic, analytical, conceptual thinking skills (big picture thinker)</li><li>Excellent interpersonal/relationship building skills, with ability to interact with senior management, business and community leaders.</li><li>Ability to represent the Marketing &amp; Communications department in senior level meetings.</li><li>Ability to quickly analyze complex issues and make sound decisions.</li><li>Entrepreneurial and flexible with the ability to thrive in a fast-paced, collaborative and quickly changing environment.</li><li>Strong knowledge of financial services industry</li><li>Knowledge of BBH products, services and investment approach is a plus.</li></ul><p></p><p><b>What You Can Expect At BBH:</b></p><p>If you join BBH you will a find collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to</p><p>enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 19 Days Ago","startDate":"2023-09-18","timeType":"Full time","jobReqId":"57365","jobPostingId":"Corporate-Communications-and-PR-Manager_57365","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Corporate-Communications-and-PR-Manager_57365","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}