{"id":"c9eaeec765a010012411090885120000","title":"Expense Admin Manager","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>BBH Job Description - Expense Administration Manager</p><p></p><p>POSITION SUMMARY:</p><p>The Expense Admin Manager oversees a staff of Expense Administration Team Leaders responsible for the daily and ongoing execution of Expense Administration including the administration of invoices, expense related forecasts and budgets, accrual calculations, periodic reporting, process maintenance and improvements, and implementing new client directed and BBH directed initiatives.</p><p></p><p>The position provides support to the Expense Administration Team Leaders in terms of leadership, guidance and communication of major initiatives and directives.</p><p></p><p>POSITION SCOPE:</p><p>1.</p><p>Follows procedures with significant independent judgement in relation to deliverables where accuracy is the priority or where workarounds are required. For appropriate cases escalation to Product Lead will be required before proceeding.</p><p>2.</p><p>Direct impact on performance of the department in meeting deliverables accurately and completely, ensuring risk of error is mitigated and queries / issue escalation are reduced. Drives improved performance and manages resource allocation on day to day basis whilst assisting in major department wide initiatives and system enhancements.</p><p>3.</p><p>Share / Exchange / Allocation of information on performance of service provider</p><p>Share / Exchange / Allocation / Resolution of client queries with service provider, team and senior leadership</p><p>Share / Exchange / Allocation of reporting and calculations with the client base and assist in resolution of queries in a timely and accurate manner.</p><p>Share / Exchange / Analyze information with internal and external parties including escalation for client contacts.</p><p>4. Provide an example of the type of oversight this position is accountable for in matters related to supervision of other employees.</p><p>There is direct oversight of employees in this position which requires the individual to aid and provide guidance to Team Leaders and in limited</p><p>cases to Supervisors, representatives and seniors ensuring all deliverables are met. In addition, the role has oversight of the service provider in</p><p>relation to assigned deliverables which will require the individual to escalate any delays or inaccuracies as identified as well as report on service</p><p>provider performance.</p><p></p><p>JOB DUTIES: Duties include, but are not limited to as applicable under local laws</p><p>* Assists in the evaluation and development of enhancements to BBH</p><p>systems for control, processing and reporting purposes as dictated by client</p><p>or internal initiatives</p><p>* Identifies, assigns, manages and reports on special projects and initiatives</p><p>* Continually meets with direct reports to review current processes and the</p><p>strengths and weaknesses of those processes; responds appropriately with</p><p>modifications, maintenance or new implementations ☒ Essential duty of the role</p><p>* Oversees planning, coordination, preparation and reviews of all expense</p><p>budgeting processes, expense structure implementations, pro forma</p><p>requests, system implementations and internal and client initiatives</p><p>* Allocates client related services appropriately to each Expense</p><p>Administration Supervisor and associated team</p><p>* Participates in development of team metrics and monitors ongoing</p><p>productivity and volume measures for all processes at a detailed and</p><p>aggregated level for all internal and client-based activities</p><p>* Stays ahead of industry issues, regulatory changes, and best practices for</p><p>all Expense Administration practices and effectively communicate these</p><p>internally and externally where required</p><p>* Communicates to and trains staff on applicable laws and regulations as</p><p>they pertain to the mutual fund and investment services industry</p><p>* Maintains knowledge over applicable laws, regulations and interpretations</p><p>governing financial statements and disclosure, including the Investment</p><p>Company Act of 1940, the Internal Revenue Code, GAAP, Regulation S-X</p><p>and other applicable requirements</p><p>* Communicates appropriately with Senior Managers and internal contacts</p><p>with respect to all timetables, workflows and other relevant administrative</p><p>matters ☒ Essential duty of the role</p><p>* Maintains a leadership role by developing internal relationships with key players in other departments to accomplish goals and resolve issues * Provides ongoing feedback and coaching to staff to improve individual and team performance. * Manages performance issues and the disciplinary process for employees failing to meet team expectations * Completes and oversees the completion of the BBH annual and mid-year performance review process * Participates in selecting and hiring new staff members ☒ Essential duty of the role</p><p>* Provides oversight of client service delivery</p><p>* Serves as a key point of escalation of contact for client contacts</p><p>* Participates in client visits to ensure client satisfaction and communicate</p><p>product related information</p><p>* Utilizes effective analytical and research techniques to resolve inquiries</p><p>* Provides leadership for projects and changes as requested</p><p>* Provides leadership for process maintenance and updates as needed</p><p>* Provides consistent, positive mentoring and development of Administrator</p><p>skills and levels of productivity</p><p>* Ensures consistent, positive self-development of technical and leadership</p><p>skills</p><p></p><p>KNOWLEDGE, SKILLS, COMPETENCIES:</p><p>Education Level BA or Equivalent</p><p>Relevant Professional Experience 10&#43; Yrs</p><p>Technical Capabilities</p><p>* Prior supervisory or management experience of staff and appropriate escalation to senior management * Highly organized and detail oriented * Strong desire to manage others and a willingness to provide the necessary support and leadership for their development * Entrepreneurial and Self-motivated, capable of monitoring and completing a variety of projects simultaneously * Strong verbal and written communication skills. * Highly developed interpersonal relationship skills including client management and new client onboarding. * Proven ability to work well in a deadline oriented, client-driven environment * Be highly engaged in the team’s collective work to foster a highly collaborative team environment * Advanced knowledge of mutual fund products, multi-class accounting, and the components of an NAV * Proactively anticipate client needs and respond effectively to client inquiries * Effectively communicate findings to clients and to colleagues verbally or written as required * Consistently meet the demands of daily responsibilities, assigned work, and the mentoring, training and guidance needs of the team * Complete and oversee the completion of the BBH annual performance review process for assigned direct reports * Maintain a leadership role by developing internal relationships with key people in other departments to accomplish goals and resolve issues * Provide ongoing feedback and coaching to staff to improve individual and team performance. * Participate in the recruiting and hiring process for new staff members</p><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 30+ Days Ago","startDate":"2023-04-26","timeType":"Full time","jobReqId":"55554","jobPostingId":"Expense-Admin-Manager_55554","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Expense-Admin-Manager_55554","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}