{"id":"e8df3131556d100192f21915ee0d0000","title":"Temporary Desktop Support Technician","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>As a Temporary Global First Level Desktop Support Technician you will be primarily responsible for supporting our global end user client excellence effort, via telephone and other remote troubleshooting tools. Users based in office and at home located in BBH’s global locations. Also, London based installations/upgrades of desktop/laptop and mobile computing devices. You will support and help troubleshoot Audio-Visual technologies such as video conferencing and video conference scheduling on a day-today basis as well as work closely with hardware vendors and internal technical support groups. Another part of your role will be to handle systems and equipment queries to identify areas of improvements.</p><p><b>Your main responsibilities will include:</b></p><ul><li>Based in the BBH London office but will be required to provide first level IT technical support to end users locally in London, and to global BBH locations.</li><li>Staff a global first level helpdesk hotline function ensuring end user client calls are answered, investigated, and resolved in a timely manner.</li><li>Liaise with other Systems support personnel within our global support model to always ensure adequate coverage for the global helpdesk hotline.</li><li>Assist with the implementation of Systems Projects/Upgrades as required.</li><li>Develop and document technology operational procedures and equipment.</li></ul><p></p><p><b><u>Client Interaction</u></b></p><ul><li>Act as liaison between Systems technical staff and end-users during troubleshooting, escalating as needed.</li></ul><p></p><p><b><u>Projects and Training </u></b></p><ul><li>Focus on client satisfaction by meeting service level agreements.</li><li>Participate in local and global technical projects, upgrades and software rollouts as required.</li><li>The role may involve the liaison with hardware vendors for break-fix.</li></ul><p></p><p><b>Qualifications:</b></p><ul><li>Two to three years English speaking IT client support experience within a business environment.</li><li>Strong familiarity with remote user support and closing out tickets.</li><li>Prioritization of end user client support over day-to-day tasks.</li><li>Strong familiarity with Windows desktop technologies/architectures and their maintenance and configuration. Ability to install hardware components such as RAM, hard drives, cables, and processors is preferable. Experience troubleshooting and resolving hardware problems and conflicts.</li><li>Proficiency with Windows 10, MS Office 365 and other standard office automation products</li><li>Experience with Cisco video conferencing technology and other industry standard collaborations tools such as Zoom, Skype and MS Teams.</li><li>Strong verbal communication skills: ability to work well in a team environment, organize multiple deliverables, and respond to changing priorities.</li><li>Strong analytical and organizational skills.</li><li>Flexibility to adapt and a passion to learn new technologies.</li></ul><p></p><p></p><p></p>","location":"London","postedOn":"Posted 2 Days Ago","startDate":"2023-10-05","timeType":"Full time","jobReqId":"60488","jobPostingId":"Temporary-Desktop-Support-Technician_60488","country":{"descriptor":"United Kingdom","id":"29247e57dbaf46fb855b224e03170bc7"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"London","country":{"descriptor":"United Kingdom","alpha2Code":"GB"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/London/Temporary-Desktop-Support-Technician_60488"}