{"id":"e8df3131556d10019eb3d60ea88e0000","title":"Department Manager III","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><div><p>Join us as our <b>Department Manager III</b> within our Workforce Transformation organization!</p> <p><b><span>Position Summary</span></b></p><p><br />The Service Delivery Business Manager is accountable for a variety of horizontal initiatives including, but not limited to, oversight and ownership of SD’s talent enablement activities from business perspective (talent reviews, HR coordination), ownership of Service Delivery Communications.  Additionally, the Service Delivery Business Manager is responsible for the governance and oversight of the execution of workforce transitions across BBH’s global offices and outsourcing partners. The role will include consulting with internal leaders to: gain buy-in on strategic direction and plans to support execution of that strategy, define skill/development requirements to make strategic decisions for Service Delivery’s training/ knowledge sharing goals and ensure seamless governance preparedness and execution. The Service Delivery Business Manager will also drive SD’s strategy definition and strategic planning and execution of SD governance (i.e. Service Delivery Oversight), oversight as needed. The role will also manage various internal workforce initiatives to meet dynamic business objectives. This role will also have management responsibility for a global team. </p><p></p><p><b><span>Principal Responsibilities</span></b></p><p>Business Manager</p><ul><li>Drive SD’s strategy definition and strategic planning exercises throughout the year</li><li>Collaborate with senior leadership to ensure preparedness forSD governance meetings (i.e. SDOC, SVP meeting), employee events, town halls and lead the creation of related materials</li><li>Accountable for the fulfillment of governance requirements by executing on the creation of executive presentations and messaging for the Service Delivery organization in relation to ISOC, PIP updates</li><li>Oversee administrative support for the CAO organization\\</li></ul><p></p><p>Talent Enablement</p><ul><li>Collaborate with HR on ensuring SD talent reviews are aligned from a timing and planning perspective</li><li>In partnership with Talent Acquisition, drive intern and consultant strategy for SD globally</li><li>Coordinate with HR and Controllers on position management, including headcount reconciliation</li><li>Develop, drive implementation, and measure success of the business knowledge and skill development (especially technical and risk training) across the Service Delivery Pillars by:</li></ul><ul><li>Assessment of current state and gaps</li><li>Developing and implementing a training strategy for each Pillar/Division, specific to function, level, responsibility</li><li>Assessing and tracking types of training available through various delivery methods (coordination with HR)</li><li>Consulting with HR on specific talent needs, advocating for SD specific requirements</li><li>Manage workforce partner/vendor relationships for SD (Broadleaf, LevelUp, etc) while working as the liaison for HR Talent Acquisition</li></ul><p></p><p>Communication</p><ul><li>Develop strategy for communication channels and best practice across Service Delivery, both from the top down and the bottom up.</li><li>Guide internal Product, Market &amp; Industry/Regulatory communications to the appropriate channels.</li><li>Consult with firmwide communication to ensure SD Communications is aligned to provide the best employee experience</li><li>Create and oversee an effective communication plan that promotes Service Delivery expertise, products and services.</li><li>Senior advisor to publishers of Departmental Newsletters &amp; Bulletins, etc. to ensure they are reaching the right audience in the most efficient way; by leveraging technology tools including, but not limited to auto generated email distributions.</li><li>Oversee creation of content with SMEs; craft the messaging; coordinate timing of messaging; leverage communication platform</li><li>Oversee the management of the content on the SD intranet page which is accessed firm-wide</li></ul><p></p><p>Transition Management Governance</p><ul><li>Ownership of the transition management governance and project management function</li><li>Ensure yearly redeployment commitments are fully approved from a legal and compliance perspective</li><li>Oversee the project management for transitions and serve as escalation point of contact</li><li>Support Krakow management related to Workforce matters</li></ul><p></p><p><b><span>Candidate Qualifications include: </span></b></p><p><span>-BA/BS degree and/or equivalent work experience.</span></p><p><span>-7&#43; years related work experience.</span></p><p><span>-Financial Services Industry experience and knowledge of Custody operations strongly preferred.</span></p><p><span>Demonstrated understanding of project management principles tools and techniques including business case development, ROI analysis, planning and issues management</span></p><p><span>Achieving Excellence</span></p><p><span>Driving the Process</span></p><p><span>Proactive</span></p><p><span>Excellent Oral, Written, Presentation Skills</span></p><p><span>Negotiation skills</span></p><p><span>Strong Interpersonal<span>  </span>skills</span></p><p><span>Proven Leadership skills</span></p><p><span>-Ability to Multi Task</span></p></div><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 2 Days Ago","startDate":"2023-10-05","timeType":"Full time","jobReqId":"60831","jobPostingId":"Department-Manager-III_60831","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Department-Manager-III_60831"}