{"id":"e8df3131556d10015a10219e9dc10000","title":"Head of Fund Accounting Systems","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Join us as our <b>Head of Fund Accounting Systems</b> within our Application Development organization!</p><p></p><p><b><span>Position Summary</span></b></p><p></p><p>The Head of Fund Accounting Systems is the overall technology leader of the group. He/she acts as the single point of contact for Fund Accounting-related technology activities across BBH Systems and is responsible and accountable for all technical aspects Fund Accounting applications including the <span>management/coordination</span> of development activities as well as the daily applications operations. This position works closely with business/product experts, architects, vendors, and application developers to conceptualize, develop, and deliver projects and solutions. This role involves strong and active participation in project and resource planning, implementation, and production support.</p><p></p><p>The Head of Fund Accounting Systems is responsible for formulating the overall technology strategy and roadmap for the groups and is responsible and executing against that plan. The individual collaborates with executive leadership to influence, shape, and determine the technology strategy for Fund Accounting. The Head of Fund Accounting Systems provides oversight and leadership of this organization by ensuring the effectiveness and efficiency of all aspects of Software Development.<b><span> </span></b></p><p></p><p><b><span>Principal Responsibilities</span></b></p><p></p><p><u><span>Leadership/ Management</span></u></p><ul><li><p>Participating and effectively representing the Fund Accounting organization in change meetings and other oversight committees.</p></li><li><p>Managing a team of employees and consultants including application administrators, developers, and system analysts.</p></li><li><p>Build an outstanding global technology team including the development, recruitment, and retention of technology leadership with effective succession plans.</p></li><li><p>Managing &amp; leading direct reports and rest of the team by establishing timely and challenging performance standards, providing ongoing feedback, and conducting annual performance appraisals.</p></li><li><p>Participating in the career development of staff, acting as a positive role model and mentor.</p></li><li><p>Keeping up to date on the current trends in asset management and servicing solutions through informal and formal industry networks, roundtables, and committees.</p></li></ul><p></p><p><span><u>Design and Implementation </u>       </span></p><ul><li><p>Ultimately responsible for the development of technical roadmaps for each of the applications within the Fund Accounting group.</p></li><li><p>Foster and drive innovation, overseeing the prioritization of new business concepts/ideas.</p></li><li><p>Coordination and prioritization of development activities with overall product <span>rollout plans/activities.</span></p></li><li><p>Leverage QA and the defined change management best practices early during new build processes.</p></li><li><p>Works with developers, product managers, and customer application experts to define solutions, products and modules with required features and functionality.</p></li><li><p>Works with the Architecture, Quality Assurance, and other development teams to successfully deliver new solutions, products, and modules in line with firm and industry best practices and standards.</p></li><li><p>Supports the systems and business teams for estimates, analysis, design, development, performance, scalability, and benchmark test guidance and providing subject matter expertise in technology and design.</p></li></ul><p></p><p><u><span>Client Service</span></u></p><ul><li><p>Responsible for measuring and improving the systems - business cross team relationships.</p></li><li><p>Working with the business to ensure that Systems response to the business requirements is appropriate, facilitation of business advocacy within Systems.</p></li></ul><p></p><p><u><span>Financial Control</span></u></p><ul><li><p>Ongoing cost management and resource planning.</p></li><li><p>Facilitate salary and bonus planning for the team.</p></li><li><p>Control expenditure against agreed budgets getting ahead of unexpected expenses early.</p></li></ul><p></p><p><b><span>Candidate Qualifications include: </span></b></p><ul><li><p>Bachelor’s Degree or higher in Engineering or Computer Science or related work experience required.</p></li><li><p>Have 15&#43; years of hands-on engineering experience, preferably designing &amp; delivering a highly scalable application, and/or support vendor platforms to service the business needs.</p></li><li><p>Strong managerial experience and transformational leadership.</p></li><li><p>Have knowledge of Fund Accounting or financial/client products and workflows in an added plus.</p></li><li><p>Have hands-on Agile transformation experience and understands Agile frameworks with its ceremonies and practices.</p></li><li><p>Must have strong technical knowledge, wide range application architectural, development and database technologies, tools, security authentication, authorization, and infrastructures.</p></li><li><p>Broad technical background spanning multiple areas among distributed system, data production and visualization, data engineering and architecture.</p></li><li><p>Experience in building and launching complex platforms at scale.</p></li><li><p>Ability to think critically and objectively; excellent problem-solving skills and the ability to make quick decisions based on business demands.</p></li><li><p>Thorough, great organizational and managerial skills.</p></li><li><p>Ability to work in high energy and visible environments.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>185,000 - 215,000 USD (Jersey City)</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"Jersey City","additionalLocations":["Boston","Krakow"],"postedOn":"Posted 2 Days Ago","startDate":"2023-10-05","timeType":"Full time","jobReqId":"60490","jobPostingId":"Head-of-Fund-Accounting-Systems_60490","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Jersey City","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Jersey-City/Head-of-Fund-Accounting-Systems_60490","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}