{"id":"fbb8f5ece7e61001210f164483760000","title":"Risk Manager","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>The Risk Manager is part of the Enterprise Risk Management - Investor Services Risk Management team supporting risk management for the Asia Pacific Legal Entities (hereinafter “BBH Asia Pacific”) as well as for the Investor Services line of business globally. The Risk Manager has overall responsibility for overall management of the risk controls of BBH Asia Pacific entities and reporting directly to senior management and the board in relation to risk management arrangements.</p><p>The position actively participates in and directs resources toward the proactive risk management support of Investor Services in product and business- related initiatives, and in the investigation of matters which arise through continued participating in various committees and review groups (e.g new business etc).  This position is also responsible for escalation, interpretation, analysis and troubleshooting of complex risks within Investor Services.</p><p></p><p>RESPONSIBILITIES:</p><ul><li><p>Develop and implement the Risk Management program for the BBH entities in Asia Pacific.</p></li><li><p>Work closely with Legal, Compliance, Audit, Strategy and other control areas in BBH Asia Pacific to ensure the robust design of products, services, processes and best practices are aligned with BBH Asia Pacific and Firmwide risk appetite.</p></li><li><p>Driving continuous enhancements to the risk management program, policies, practices and tools to analyze, remediate and report enterprise risks, including emerging risks, and to identify, assess and manage risks arising from BBH Asia Pacific business strategy and activities according to the risk management framework.</p></li><li><p>Disseminate communicate Risk Management policies and procedures to BBH Asia Pacific employees to ensure risk mitigation across business lines.</p></li><li><p>Participate in the Senior Management Committee, providing risk insights as well as challenge to business initiatives and discussions.</p></li><li><p>Support first line management in the identification, assessment and mitigation of risk inherent in BBH Asia Pacific provision of their products and services to clients.</p></li><li><p>Lead and perform targeted risk and control reviews of operational processes and workflow in BBH Asia Pacific where required; provide advice and actionable recommendations to management to assist in maintaining a strong risk and control culture.</p></li><li><p>Lead the ongoing investigation, assessment and resolution of risk issues and incidents (including data incidents and errors) that arise within BBH Asia Pacific.</p></li><li><p>Leverage existing risk management tools, such as the Risk Event and Risk &amp; Control Self- Assessment to assist in causal analysis of risk events and incidents.</p></li><li><p>Present to regulators, clients and prospects on local legal entity as well as global risk management frameworks.</p></li></ul><p></p><p></p><p>REQUIREMENTS;</p><ul><li><p>Bachelor’s degree or equivalent work experience desirable.</p></li><li><p>Minimum 10 years&#39; of relevant work experience in risk management, Compliance, Legal, Risk, external/internal audit or a related discipline in the financial services industry, preferably Asset Servicing.</p></li><li><p>Strong asset and/or fund servicing and Investor Services product knowledge</p></li><li><p>Proven analytical experience, including the ability to systematically manage a pipeline of complex product initiatives and execute accordingly</p></li><li><p>Ability to influence and educate on risk management topics</p></li><li><p>Strong English language written and verbal communication skills, including presentations.</p></li><li><p>Strong interpersonal, relationship, collaboration, and influencing skills.</p></li><li><p>Ability to work independently as well as part of a global team</p></li><li><p>Experience managing multiple priorities</p></li><li><p>Ability to effectively troubleshoot problems</p></li><li><p>Ability to manage multiple tasks simultaneously, while meeting deadlines.</p></li><li><p>Knowledge of relevant legal and compliance regulations for the industry</p></li><li><p>Inquisitive and enquiring control-oriented risk mindset</p></li></ul><p></p><p></p><p></p><p></p>","location":"Tokyo","postedOn":"Posted 3 Days Ago","startDate":"2023-10-04","timeType":"Full time","jobReqId":"60525","jobPostingId":"Risk-Manager_60525","country":{"descriptor":"Japan","id":"8b705da2becf43cfaccc091da0988ab2"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Tokyo","country":{"descriptor":"Japan","alpha2Code":"JP"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Tokyo/Risk-Manager_60525"}