{"id":"fe8d96aaa89210001007868d4e870000","title":"Senior LAN/WAN Network Engineer","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Join us as a <b>Senior LAN/WAN Network</b> <b>Engineer </b>in our Network Engineering team!</p><p></p><p>As a Senior LAN/WAN Network Engineer, you will be responsible for the management, administration, installation, configuration and maintenance of the network equipment and infrastructure at BBH. The responsibilities also include assisting in the design and analysis of the network infrastructure for capacity planning and future developments. The Senior Network Engineer must be well versed with the advanced engineering and administration of multi-protocol routers, multilayer switches, network security devices and network management systems. S/he will participate in projects to deliver technology solutions, support current infrastructure by troubleshooting and resolving incidents. Overall, the goal for this position is to ensure the smooth operation of applications and systems to provide maximum performance and availability for users.</p><p></p><p><b>Responsibilities include:</b></p><ul><li><p>Participate in network engineering development from idea to plan, design, and integration for the relevant network environments to meet stakeholder requirements</p></li><li><p>Own the delivery of a variety of concurrent projects in varying scale</p></li><li><p>Work independently and as part of a team to train operations and deployment engineers on new network designs</p></li><li><p>Provide troubleshooting assistance/escalation to support teams, as needed, for critical production issues and incident management and reporting. Urgently analyze and troubleshoot production impacting issues</p></li><li><p>Assist with complex moves/adds/changes to the environment, as needed</p></li><li><p>Work with technology operations managers to develop trending analyses and eliminate recurring incidents</p></li><li><p>Ability to impact operations and effect change while being cooperative, highly self-motivated, and capable of working under pressure. Demonstrated analytical and problem-solving skills, detail oriented</p></li><li><p>Create process and documentation</p></li></ul><p></p><p><b>Qualifications include:</b></p><ul><li><p>5&#43; years solid knowledge and experience of network routing and switching technologies, multicast expertise, public cloud networking, and network hardware</p></li><li><p>Expert level Knowledge of wireless technologies standards and protocols. Cisco WLAN and ISE specific experience desired</p></li><li><p>Cisco platforms including but not limited Cisco ACI platform, Catalyst Switches, ASR Routers, and network management tools</p></li><li><p>Hands-on experience in Cisco Wireless deployment and troubleshooting</p></li><li><p>Expert understanding of IP routing, managing, troubleshooting and deployment of global architecture</p></li><li><p>Excellent communication and documentation skills and ability to work collaboratively with other infrastructure teams across the firm, globally. Manage multiple projects simultaneously and can adapt to changing business needs</p></li><li><p>Ability to impact operations and effect change while being cooperative, highly self-motivated, and capable of working under pressure</p></li><li><p>Self-disciplined, self-starter who can provide leadership and mentor others while resolving complex incident</p></li><li><p>Detailed knowledge of network, transport and application protocols, BGP, MPLS, OSPF, 802.1Q, TCP/UDP, HTTP, FTP, DNS,</p></li><li><p>Proficiency with network management, monitoring and troubleshooting tools (sniffer, syslog, NetFlow, TCPDUMP, Wireshark)</p></li><li><p>Understanding of public clouds AWS, Azure</p></li><li><p>Technical experience working with VPN technologies such as IPSEC and GRE, WAN optimization and acceleration technologies</p></li><li><p>Ability to analyze complex problems, propose effective solutions, understand, and apply business vision / direction. Ability to be called upon 24/7 in case of emergencies</p></li><li><p>Working knowledge of ITIL processes, specifically Incident Management, Change Management, Problem Management</p></li><li><p>Hands-on experience in the use of protocol analysis tools for data packet inspection</p></li><li><p>Good oral and written communication skills</p></li></ul><p></p><p></p><p><i><b>What We Offer</b>:</i></p><ul><li><p><i>A collaborative environment that enables you to step outside your role to add value wherever you can</i></p></li><li><p><i>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm</i></p></li><li><p><i>A culture of inclusion that values each employee’s unique perspective</i></p></li><li><p><i>High-quality benefits program emphasizing good health, financial security, and peace of mind</i></p></li><li><p><i>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</i></p></li><li><p><i>Volunteer opportunities to give back to your community and help transform the lives of others</i></p></li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 30+ Days Ago","startDate":"2023-08-26","timeType":"Full time","jobReqId":"60021","jobPostingId":"Senior-LAN-WAN-Network-Engineer_60021","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Senior-LAN-WAN-Network-Engineer_60021","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}