{"id":"fe8d96aaa8921000b3cc3a48a8bd0000","title":"Senior Client Service Representative","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p><br /><b>Join us as a Senior Client Service Representative</b><br /><br />Brown Brothers Harriman is currently recruiting Senior Client Service Representative to join our Global Client Service Team, In this role you will act as primary<span> contact for clients and internal operational teams. You will be responsible for providing timely and accurate resolution of internal and client inquiries to ensure exceptional levels of client service are met. This team focuse on the Custody discipline and the applicable product offering for assigned client relationships.</span></p><p><br /><b><span>Some of your key responsibilities include:   </span></b></p><ul><li><p><span>Proactively respond to custody-related client inquiries</span></p></li><li><p><span>Provide filtering and escalation for client inquiries</span></p></li><li><p><span>Participate in scheduled client meetings as requested</span></p></li><li><p><span>Assist in activities that support the measurement of Client Service Standards across the various products BBH provides to our clients.</span></p></li><li><p><span>Work effectively with internal departments or third-party providers to prioritize client requests, deliverables and issue resolution</span></p></li><li><p><span>Execute reviews of internal reporting for assigned client relationships and escalate issues which may impact client servicing to the Client Service Supervisor</span></p></li><li><p><span>Participate in team-based project work and audits</span></p></li><li><p><span>Utilize relevant internal technology solutions to effectively manage client inquiries</span></p></li><li><p><span>Introduce and familiarize clients with new technology, automation tools and products</span></p></li><li><p><span>Where required, monitor receipt of all client documentation (tax, Accounting Elections, KYC, account information, authorized signers, etc.) and analyse exposure of missing documentation to BBH/client.</span></p></li></ul><p></p><p></p><p><b>What we offer: </b></p><ul><li><p>2 additional days added to your holiday calendar for Culture Celebration and Community Service.</p></li><li><p>Private medical care for you and your family.</p></li><li><p>Life Insurance.</p></li><li><p>Hybrid Working Opportunities.</p></li><li><p>Professional trainings and qualification support.</p></li><li><p>Thrive Wellbeing Program.</p></li><li><p>Online benefit platform.</p></li><li><p>Contracts for an indefinite period of time with no probation period.</p></li></ul><p></p><p><b>Desired Qualifications:</b></p><ul><li><p><span>BS/BA degree and/or equivalent work experience</span></p></li><li><p><span>Ability to communicate effectively both verbally and in writing</span></p></li><li><p><span>Ability to effectively prioritize and resolve client needs</span></p></li><li><p><span>Ability to learn and utilize new technologies to research, analyse, and resolve client needs</span></p></li><li><p><span>Ability to work quickly and accurately in a deadline-oriented environment</span></p></li><li><p><span>Ability to build and maintain internal and external client relationships</span></p></li><li><p><span>Ability to work in a collaborative environment</span></p></li><li><p><span>Experience in global custody and/or asset management in financial services industry is a plus,</span></p></li><li><p><span>Prior work experience in a client servicing role is preferred.</span></p></li></ul><p>At Brown Brothers Harriman, we believe no job is too big or small for any of us to handle if it helps our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of person who speaks their mind, truly listens and steps outside their role to add value wherever they can.  Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek someone who takes great pride in their work and is inspired and motivated by their role in protecting and enhancing our client’s financial well-being.</p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p></p><p></p><p></p>","location":"Krakow","postedOn":"Posted 2 Days Ago","startDate":"2023-10-05","timeType":"Full time","jobReqId":"59745","jobPostingId":"Senior-Client-Service-Representative_59745","country":{"descriptor":"Poland","id":"131d5ac7e3ee4d7b962bdc96e498e412"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Krakow","country":{"descriptor":"Poland","alpha2Code":"PL"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Krakow/Senior-Client-Service-Representative_59745"}