{"id":"fe8d96aaa8921001614c04bca9090000","title":"Compliance Analyst InServ","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>PRINCIPAL RESPONSIBILITIES</b></p><p></p><p>1. Compliance Monitoring</p><ul><li>Monitor Compliance requirements for upwards of 40 Funds daily utilizing Charles River Developments ComplianceMaster system. Take proactive steps to communicate any compliance issues contained in the reports and to develop resolutions of such issues.</li><li>Prepare monthly compliance reports and take proactive steps to communicate any compliance issues contained in the reports and to develop resolutions of such issues.</li><li>Develop and maintain methods to enhance procedures with respect to the compliance monitoring function.</li><li>Develop and maintain a working familiarity with applicable laws, regulation and interpretation governing the administration of mutual funds. This includes the Investment Company Act of 1940, Subchapter M of the Internal Revenue Code securities laws and other applicable requirements.</li><li>Perform special projects as assigned by the Fund Administration Compliance Supervisor and Manager.</li><li>Assist with the preparation of Quarterly Board Reports.</li></ul><p></p><p>2. Systems/Technology</p><ul><li>Develop and maintain a strong working familiarity with Charles River Developments ComplianceMaster system.</li><li>Assist the Fund Administration Compliance Supervisor and Manager in developing ways to enhance and automate the compliance function for areas that are manual.</li><li>Use Bloomberg to conduct research as needed.</li></ul><p></p><p>3.Client Service</p><ul><li>Develop and maintain a strong client service relationship with clients.</li></ul><p></p><p><b>KNOWLEDGE, SKILLS AND ABILITIES</b></p><ul><li>BS/BA degree and/or equivalent work experience.</li><li>Two to four years of prior industry experience.</li><li>Prior compliance experience preferred.</li><li>Knowledge and skills (general and technical)</li><li>Highly organized, detail oriented, self-motivated, capable of monitoring and completing multiple projects and tasks.</li><li>Strong oral and written communication skills.</li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 30+ Days Ago","startDate":"2023-08-30","timeType":"Full time","jobReqId":"60226","jobPostingId":"Compliance-Analyst-InServ_60226","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Compliance-Analyst-InServ_60226"}