{"id":"03f500d6ddab1001e44dc65d9f5b0000","title":"Transfer Agency Investor on Boarding Representative Sr","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p></p><p><b><u><span>Join us as an Investor On-Boarding (IOB) Senior Representative</span></u></b></p><p></p><p>Brown Brothers Harriman is currently recruiting a <span>Senior Administrator</span> to join our TA Investor On-Boarding Team. In this role you <span>will be responsible for due diligence checks on all shareholder accounts within the department with the objective to achieve overall accuracy and high client satisfaction. He/she will be evaluated on their ability to perform Transfer Agency IOB </span></p><p><span>functions in a controlled and efficient manner while maintaining high client satisfaction. The Role of IOB Senior Representative will display a high degree of professionalism and integrity through their work and will possess solid experience in an Anti-Money Laundering (AML) / Know you Client (KYC) role within a Client On-Boarding team. The ideal candidate will have AML experience within the financial industry, has good software systems skills, is a capable team player and is able to manage a demanding workload. The role will require a high level of accuracy and attention to detail.</span></p><p></p><p><b><u><span>Some of your key responsibilities include:</span></u></b></p><ul><li><span>Perform AML/KYC due diligence on a range of institutional clients types with different legal structures, in all jurisdictions, to support businesses across various product groups.</span></li><li><span>Fully conversant with the AML/KYC rules and regulations.</span></li><li><span>Solid proven experience in Financial Services within Compliance/AML</span></li><li><span>Experience with Irish AML/KYC account opening</span> <span>requirements.</span></li><li><span>Liaise internally with Client Relationship Managers and escalate sources of AML risk to AML Manager and the Compliance Manager when required.</span></li><li><span>Assist in drafting and documenting procedures, policies and processes as necessary.</span></li><li><span>In-depth understanding of typical legal structures including hedge funds, special purpose vehicles, partnerships, trusts and charities.</span></li><li><span>Familiarity with public sources of information across most jurisdictions (stock exchanges, regulators, company registers) pertaining to client due diligence.</span></li><li><span>Ability to work effectively in a fast-paced and, at times, pressured environment.</span></li><li><span>Assist in drafting and documenting procedures, policies and processes as necessary.</span></li></ul><p></p><p>Human Resources Management:</p><ul><li>Successfully meet objectives as determined by the IOB Manager/Supervisor via the review process.</li><li>Attend and complete the necessary training in order to maintain accuracy and knowledge.</li><li>Regularly attend both team and individual meetings which will include action points and follow up.</li></ul><p></p><p>Improve Efficiency:</p><ul><li>Must be willing to work as part of a team in a client focused, high quality service environment.</li><li>Progressive attitude to work, with a view to continuous improvement.</li><li>Proven aptitude for problem solving.</li></ul><p></p><p>Accuracy and Efficiency:</p><ul><li>Efficient implementation of daily controls to ensure that at all times accuracy standards and deadlines are met</li><li>Ensure shareholder files are kept up to date with relevant information including AML/KYC information.</li></ul><p></p><p><b><u><span>Qualifications:</span></u></b></p><ul><li>Communicates Effectively.</li><li>Demonstrates Respect and Values Diversity of Ideas.</li><li>Exhibits Sound Judgment and Solves Problems.</li><li>Hands on Approach paired</li><li>Strong Attention to Detail Attitude.</li><li>Fosters Team Spirit.</li><li>Demonstrates Flexibility.</li><li>Strong Analytical Skills.</li><li>Strong self-organization and negotiation skills.</li><li>Minimum of 1 year Financial Services experience; knowledge or prior experience within Transfer Agency is considered an advantage</li><li>Knowledge or prior experience of AML/KYC legal requirements is considered an advantage</li><li>Third Level education in the area of Financial Services is considered an advantage</li><li>Ability to liaise across <span>departments/functions</span> when needed to handle specific client requests.</li><li>Ability to identify, recommend and implement improvements to existing processes.</li><li>Fluency in English is mandatory; other languages are considered a plus.</li><li>Knowledge or prior experience of Multifonds TA is considered essential/an advantage.</li><li>Good knowledge of standard Office applications. (MS Word, Excel, Powerpoint).</li></ul><p></p><p></p><p></p><p></p>","location":"Dublin","postedOn":"Posted 30+ Days Ago","startDate":"2023-06-08","timeType":"Full time","jobReqId":"58648","jobPostingId":"Transfer-Agency-Investor-on-Boarding-Representative-Sr_58648","country":{"descriptor":"Ireland","id":"04a05835925f45b3a59406a2a6b72c8a"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Dublin","country":{"descriptor":"Ireland","alpha2Code":"IE"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Dublin/Transfer-Agency-Investor-on-Boarding-Representative-Sr_58648"}