{"id":"03f500d6ddab1000b57b5149ef140000","title":"Security Operations Manager","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>Join us as a Security Operations Manager</span></b></p><p></p><p>Brown Brothers Harriman is currently recruiting a Security Operations Manager to join our Global Security team.  In this role you will, at the direction of the Regional Senior Security Manager, leads the operations of a multi-function team based at the firm’s Global Security Operations Center (GSOC). The GSOC provides critical system monitoring to ensure the continued safety and security of the firm’s employees, facilities, and worldwide assets against threats, e.g., extreme weather conditions, political instability, crime, and infrastructure failures. The Security Operations Manager is also responsible for assessing domestic and international risk and providing duty of care support for the firm’s travelers and operations. The Security Operations Manager is responsible for the effective management of global security operations, they will work with Regional Security Managers to provide support and alignment to the team. Specific duties may vary, but the Security Operations Manager will be responsible for reporting and conducting routine audits of the GSOC, its personnel, systems, and procedures, as well as ensure the effective and timely response to alarms, calls of distress, incidents, and notification of major incidents to senior <span>management.  </span></p><p></p><p><b><span>Some of your key responsibilities include:</span></b>  </p><p><b><span>GSOC development and Operations   </span></b>           </p><ul><li>Provide 24x7 supervision of the GSOC, security operation’s along with staff, operators, and analysts.</li><li>Establish and maintain Operational SOP’s in support of the GSOC and the broader global security team.</li><li>Establish and maintain training plans and conduct quarterly training of the GSOC staff; establish a development program to foster professional advancement of the GSOC staff.</li><li>Ensure serviceability and accountability of all GSOC equipment and software.</li></ul><p></p><p><b><span>Technology</span></b></p><ul><li>Continue to develop the access control systems, CCTV operation and support the maintenance of electronic security systems.</li><li>Developing the teams computer skills, including proficiency in the use of the internet, open-source searches, human intelligence gathering, email, word processing, database programs and specialized software systems.</li></ul><p></p><p><b><span>Security Operations     </span></b>      </p><ul><li>Align with Senior Security Manager Americas and Europe, coordinating efforts as required to ensure that overall Global Security mission is achieved.</li><li>Incident management and appropriate escalation of incidents to senior leadership.</li><li>Responsible for maintaining specific awareness of domestic and international risks.</li></ul><p></p><p><b><span>Vendor/contractor Management</span></b></p><ul><li>Selection and management of contracted staff, providing leadership and guidance, critically reviewing work product and invoices submitted.</li><li>Create and manage work scheduling of contractors to ensure appropriate coverage.</li><li>Investigations and Reporting</li></ul><p></p><p><b><span>Global incident reporting</span></b></p><ul><li>Conduct critical research related to global events that could potentially impact the firm.</li><li>Create specialized reports and develop a metrics program</li><li>Develop a process to audit physical access control systems (PACS). </li></ul><p></p><p><b><span>Desired Qualifications:</span></b></p><p><b><span>Education level and/or relevant experience(s)</span></b></p><ul><li>BA/BS Degree in an area of study relevant to the position or equivalent experience.</li><li>Five years of operational security experience in corporate environment with multi-facility operations.</li><li>Prior operations center experience in Security, Military or Law Enforcement field</li><li>Ability to conduct training in all areas associated with a GSOC and Crisis Management.</li><li>Minimum four years supervisory experience. </li></ul><p></p><p><b><span>Knowledge and skills (general and technical)</span></b></p><ul><li>Strong written and verbal communication skills, including the ability to gather and critically evaluate information and prepare written documents that clearly and concisely identify the issues presented and their proposed resolution.</li><li>Proficient in MS Office applications, such as Word, Excel, and PowerPoint.</li><li>Strong business acumen and vendor management experience.</li><li>Excellent organizational, collaboration and interpersonal skills.</li><li>Strong reasoning competence to investigate, analyze and draw appropriate conclusions.</li><li>Ability or aptitude to learn to operate C-Cure 9000 Access Control System. </li></ul><p></p><p><b><span>Other requirements (licenses, certifications, specialized training, physical or mental abilities required)</span></b></p><ul><li>Professional certification in the security field desirable (CPP, PSP, PCI).</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$110,000 to $140,000 New York City, NY</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","postedOn":"Posted 10 Days Ago","startDate":"2023-09-27","timeType":"Full time","jobReqId":"58332","jobPostingId":"Global-Security-Operations-Center--GSOC-_58332","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/Global-Security-Operations-Center--GSOC-_58332","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}