{"id":"087bb65203f71001ad4682defef00000","title":"Senior Audit Manager","jobDescription":"<p></p><p></p><p></p><div><p><b>Job Description</b></p><p><b>Senior Audit Manager-IT/Systems Officer Title: VP</b></p><p></p><p><b>Location NY or Boston</b></p><p><b>Limited travel</b></p><p></p><p><b>POSITION SUMMARY</b></p><p>Internal Audit provides services that assist BBH’s businesses and support areas in improving their control environments, streamlining their businesses, and achieving operational excellence. The Senior Audit Manager-IT/Systems is responsible for delivering audit services, as well as risk and controls advice (particularly with respect to systems and applications). S/he manages the work of multiple project-specific teams simultaneously, providing supervision and direction on specific <span>technology/integrated</span> audit engagements, and is responsible for providing ongoing progress reports to the business line and audit management.</p><p>The Senior Audit Manager-IT/Systems may also serve as a key Internal Audit representative in important new business initiatives, new products, special investigations, and other control-related projects, working with middle to senior management to facilitate the identification and resolution of risk and control issues. The Senior Audit Manager-IT/Systems will in most instances work directly with the Sr Audit Manager-IT/Systems assigned to the Line of Business (LOB) and will be responsible for reporting and working through issues with audit senior management, LOB management, and supporting control groups. The individual will play a key role in developing and driving tactical solutions to problems and issues.</p><p>Administratively, the Senior Audit Manager-IT/Systems is responsible for developing and maintaining relationships with business counterparts, developing risk assessments and the annual plan (including resource allocation and scheduling), coordinating regulatory requests, developing staff (including formal performance evaluations and development plans), and assisting or leading department initiatives.</p><p><b>PRINCIPAL RESPONSIBILITIES</b></p><p>List and describe this position’s key responsibilities in concise, comprehensive statements. Address what the position holder does to achieve the position’s main purpose. Also check the approximate amount of time spent on each Area of Responsibility. Time should be expressed relative to 100%.</p><p>Note: These statements are intended to describe the general nature of the job and are not intended to be an exhaustive list of all responsibilities, skills and duties.</p><p>Area of Responsibility Key Activities/Elements % Time Spent</p><p>1. Management / Staff</p><p>Leadership</p><ul><li>Direct and review the activities of the audit project team and work collaboratively on audit reports</li><li>Provide overall leadership to the team in connection with performance of the work and personal development and growth</li><li>Plan and conduct effective meetings with staff and internal clients</li></ul><p>2. Analysis and Reporting</p><ul><li>Participate in more complex audits and/or subject matter and deliver industry expertise and perspective to the team and management</li><li>Evaluate risks, controls, policies, and procedures and how management monitors, communicates, and mitigates risk</li><li>Follow up on identified issues and recommend corrective actions to ensure problem resolution</li><li>Propose and facilitate viable solutions to issues identified and refine and recommend alternatives proposed by members of the audit team</li><li>Draft complete audit reports that provide a clear description of issues identified, related implications to the business or company as a whole, and recommendations to resolve the issues</li></ul><p>3. Communications</p><ul><li>Maintain effective working relationships at all levels of management in client organizations</li><li>Escalate significant audit issues, set <span>direction/communicate</span> proposed manner of resolution of audit issues and concerns that have a significant impact</li><li>Develop and maintain peer relationships with auditors to share best practices</li><li>Present audit results and recommendations to senior management</li><li>Work with senior management to stay abreast of changes in the business and growth plans and provide strategic advice and counsel on risk-related matters</li></ul><p><span>4.Administrative/Other</span></p><ul><li>Assist regulators and external auditors in accomplishing their goals</li><li>Recruit, train, supervise and develop staff</li></ul><p>POSITION SCOPE</p><p>Primary internal and external contacts with whom position interacts, and purpose/nature of contact:</p><ul><li>Internal: Other members of Audit Department, Sr. Executives including partners</li><li>External: External auditors</li></ul><p></p><p><b>KNOWLEDGE, SKILLS AND ABILITIES</b></p><p>Indicate the education level, previous experience, specific knowledge, skills and abilities required to meet minimum requirements for this position.</p><p>Education level and/or relevant experience(s)</p><ul><li>Bachelors Degree in Finance, Accounting, Information Systems, or a related field of study</li><li>7 - 10 years audit, audit-related or relevant business line experience</li></ul><p><b>Knowledge and skills (general and technical)</b></p><ul><li>Project management experience</li><li>Excellent analytical, communication and interpersonal skills required with ability to present complex and sensitive issues to senior management</li><li>Areas of expertise should ideally include abilities in accounting, regulatory, etc.</li><li>Demonstrate technical abilities for most of the following: Access control software Business process mapping Security architecture and administration, Security policies and standards, Operating systems (Windows NT, UNIX/Linux, MVS) Database platforms (SQL, Oracle, DB2), IT Business Continuity and Recoverability, IT Production Operations, Active Directory, and Third Party Services (including Cloud)</li><li>Advanced knowledge in IT Frameworks (COBIT, NIST, FFIEC, ISO, ITIL)</li></ul><p>Other requirements (licenses, certifications, specialized training, physical or mental abilities required)</p><ul><li>Professional audit certifications preferred (CIA, CPA, CISA, CISSP, etc.)</li></ul></div><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p>&nbsp; &nbsp;</p>Full time<p></p><p></p><p></p>Boston","location":"Boston","postedOn":"Posted 30+ Days Ago","startDate":"2022-12-01","timeType":"Full time","jobReqId":"56480","jobPostingId":"Senior-Audit-Manager_56480","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Senior-Audit-Manager_56480","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}