{"id":"087bb65203f71001fe81142238ac0000","title":"Senior Compliance Officer (Private Banking)","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p>At Brown Brothers Harriman, we believe no job is too big or small for any of us to handle if it helps our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of person who speaks their mind, truly listens and steps outside their role to add value wherever they can. Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek someone who takes great pride in their work and is inspired and motivated by their role in protecting and enhancing our client’s financial well-being.</p><p></p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p></p><p>Join us as a Senior Compliance Analyst.</p><p></p><p>Brown Brothers Harriman is currently recruiting a Senior Compliance Analyst to join our Private Banking Team. In this role you will assists the Private Banking Compliance Manager with the firm’s compliance program covering the Private Banking business, with an emphasis on private funds, regulatory reporting, and overall compliance with the Investment Advisers Act and Investment Company Act. </p><p>The individual will serve in a consultative/advisory capacity to the line of business with a focus on policies and procedures, regulatory developments and reporting obligations, conflicts of interest, and assisting with the review of new products, services, or activities.</p><p></p><p>The position partners with the line of business and other compliance teams, including Investment Management, to ensure the business understands and complies with firm policies and procedures as well as applicable securities and banking rules, regulations, and laws such as the Advisers Act, Company Act, and SEC rules thereunder, as well as state and FINRA rules/regulations as applicable. </p><p></p><p>A successful candidate will help Private Banking identify, avoid, and mitigate regulatory and compliance risk across its business areas.</p><p></p><p>The right candidate may also be asked to assist with additional matters, such as performing compliance testing, conducting compliance training, and supporting other Private Banking business initiatives.</p><p></p><p><b>Key responsibilities include:   </b></p><ul><li>Support the PB Compliance Manager and broader Compliance department in the ongoing review of  policies and controls related to 3(c)(1) and 3(c)(7) private funds and other investment offerings to ensure that they remain robust and in line with regulatory standards and industry/peer best practices</li><li>Work with Private Banking trading team as well as Investment Management to address trading issues such as restricted stock, soft dollars, best execution, options strategies, agency, principal and cross transactions, Reg S, block trading, and/or tax loss harvesting</li><li>Serve in an advisory capacity to the relevant line of business with respect to the structure, conduct, and management of its business activities</li><li>Where gaps in the firm’s control framework have been identified or escalated, assist the relevant business area(s) with implementing the requisite policies and procedures</li><li>Educate BBH personnel regarding the laws and regulations applicable to their businesses</li><li>Liaise with core compliance on issues such as FCPA, political contributions, OBAs, personal trading, privacy, and email escalations</li><li>Assist in annual compliance testing, including management reporting and action item implementation/tracking</li><li>Work on special projects and miscellaneous issues such as state overlay issues, cash sweep, audit coordination, RFP responses, international solicitation, NDAs, and escheatment processes and generally be available to the front office for day-to-day questions</li></ul><p></p><p><b>Qualifications:</b></p><ul><li>BA</li><li>5&#43; years relevant experience</li><li>JD preferred</li><li>Strong written and oral communication skills</li><li>Knowledge of the financial services industry and applicable laws and regulations, including the Investment Advisers Act and Investment Company Act</li><li>Familiarity with regulation related to trust administration, commercial lending, ERISA, and/or banking is a plus</li><li>Ability to manage projects, work in a team environment, and work well under pressure</li></ul><p></p><p><b>What We Offer:</b></p><ul><li>A collaborative environment that enables you to step outside your role to add value wherever you can</li><li>Direct access to clients, information, and experts across all business areas around the world</li><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself - within the Firm</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>High-quality benefits program emphasizing good health, financial security, and peace of mind</li><li>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</li><li>Volunteer opportunities to give back to your community and help transform the lives of others</li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$100,000 -$140,000</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","postedOn":"Posted 29 Days Ago","startDate":"2023-09-08","timeType":"Full time","jobReqId":"56004","jobPostingId":"Sr-Analyst--Compliance_56004","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/Sr-Analyst--Compliance_56004","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}