{"id":"0befccb25aac01009d76e3e70fc20000","title":"Investment Operations Implementation and Support Analyst","jobDescription":"<p></p><p></p><p></p><p>The Investment Operations Implementation and Support Analyst works as part of a global team providing day-to-day client service, production support, management of client implementation projects, and onboarding for the Investment Operations global client base with specific focus on regional support and local language servicing for Investment Operations’ portfolio of products and services.</p><div><div><div><div><p></p><p>The successful candidate will be a self-starter who demonstrates a combination of excellent problem solving and client servicing skills. The ideal candidate will be an experienced technologist with an aptitude for technical support and solution definition. The candidate will possess business analysis and project management experience and will be able to handle multiple tasks at once.  He/she will anticipate and respond to client requirements, issues, questions, and requests. He/she will work with the global Investment Operations organization to recommend, create, and implement operational efficiencies with a focus on improving client experience for Investment Operations clients with specific attention to the needs of within their locale.</p><p></p><p>The ideal candidate will be a bilingual technologist, and knowledgeable with regard to all associated customs and etiquette.</p><p></p><p>The candidate will act as the spokesperson and advocate for the client both in live production support and in project development. Candidate to perform business analysis, research, and testing to support key business initiatives and solutions to ensure the correct business functionality, requirements, and industry standards are addressed within the envisioned <span>solution.  </span></p><p></p><p><b>RESPONSIBILITIES:</b></p><p></p><p><b>Client Service:</b></p><ul><li>Demonstrate superior client service and relationship management skills; Escalate issues as appropriate; Support and respond to client <span>inquiries/problems. </span></li><li>Dedicated support contact for local clients inclusive of training, inquiry resolution, market updates and relationship excellence meetings.</li><li>Manage day to day inquires across Investment Operations’ client base with special attention to those originating from locally domiciled clients. This is including but not limited to new user requests, system failures, market practice inquires and product issues.</li><li>Will have frequent interaction with members of other user groups within the Investment Operations Business Unit, Investor Services, Systems, and business units outside Investor Services.  Will have extensive, direct contact with clients.</li></ul><p></p><p><b>Problem Solving:</b></p><ul><li>Assist in the development of case studies to communicate to division, sales representatives, and other clients how BBH’s products solve client workflow issues.</li></ul><p></p><p><b>AML Compliance:</b></p><ul><li>Managing sensitive client information resulting from AML and OFAC message scanning.Preliminary understanding of firm&#39;s KYC procedures and documentation requirements.</li></ul><p></p><p><b>Product Advocacy:</b></p><ul><li>Actively engage in the product development and release process.Help to shape product design by representing the end user support strategy as an ICS product advocate, with specific regard to regional requirements</li></ul><p></p><p><b>Business Analysis:</b></p><ul><li>Compose business requirement documents, use cases, issue logs, project status documents, scope change documents, mapping specifications, test plans and test cases.Ensure current and accurate documentation of the solution is maintained.</li><li>Create/Maintain support documentation for the client and internal support teams.With specific focus and ownership of local language documentation and materials.</li><li>Responsible for determining how changing business needs will affect the system and client.Describe the business need and potential solution in terms that both business and technical teams can understand.Review and approve all technical documentation related to the approved solution.</li></ul><p></p><p><b>Project Management:</b></p><ul><li>Perform project management activities on assigned projects and tasks to ensure projects stay on budget and are completed within agreed upon timeframes.Conduct budget reviews and escalate budget and/or change of scope variances as appropriate.</li><li>Manage expectations of Stakeholders: External Clients and Internal Systems/Business teams to achieve a mutually beneficial result on all projects</li></ul><p></p><p><b>Problem Solving:</b></p><ul><li>Assist in the development of case studies to communicate to division, sales representatives, and other clients how BBH’s products solve client workflow issues.</li></ul><p></p><p><b>REQUIREMENTS:</b></p><p>Bachelor&#39;s degree preferred with a mimimum 5&#43; years of experience directly related to the duties and responsibilities specified and/or 8&#43; years related business or technology experience.  Prior work experience in Financial Services and a basic knowledge of global asset management middle and back-office operations is <span>preferred.   </span> Direct client service experience both in day to day support as well as supporting the overall client relationship as part of their strategic roadmap</p><p></p><p>KNOWLEDGE, SKILLS, AND ABILITIES REQUIRED:</p><ul><li>Demonstrated ability to work autonomously in a remote environment as a multidisciplined individual contributor within a global team</li><li>High level of customer service and support including exceeding the expectations of both internal and external clients. </li><li>Strong communication skills, both oral and written.  Communicate concisely and with clarity, regardless of form.  Strong listening, analytical, and negotiation skills, with close attention to detail.  </li><li>Strong problem-solving and analytical skills.  Solves difficult problems with effective solutions.  Asks good questions and looks beyond the obvious.</li><li>Demonstrated teamwork.  Creates strong morale and spirit in his/her team and across divisions.  Shares wins and losses and celebrates team achievements</li></ul><ul><li>Understanding and exposure to project management principles, practices, tools and techniques, including planning, organization, scope and issues management, budgeting, and facilitation.</li></ul><ul><li>High level of computer literacy and understanding of SWIFT messaging, file transfer, and Internet technologies preferred.</li><li>Understanding and appreciation of business concepts and requirements as applicable to a multi-faceted financial services <span>organization. Ability</span> to grasp and master new skills quickly.</li></ul><ul><li>Understand the roles and functions of Custodians, Fund Accountants; Fund/Asset Managers and Transfer Agents</li><li>Understand a broad spectrum of financial product types and their position within SWIFT including: Equity; Fixed Income; Funds; Corporate Actions; FX; Money Markets and Cash</li><li>Understanding and exposure to project management principles, practices, tools and techniques, including planning, organization, scope and issues management, budgeting, and facilitation.</li><li>Ability to stay calm under pressure and multitask effectively</li><li>Ability to compose, review, and edit written materials – most importantly business requirement documents, use cases, issue logs, project status documents, scope change documents, mapping specifications, test plans and test cases.</li><li>Language skills –Japanese and English are musts, Mandarin is a plus.</li></ul></div></div></div></div><p></p><p></p><p></p><p>&nbsp; &nbsp;</p>Full time<p></p><p></p><p></p>Tokyo","location":"Tokyo","postedOn":"Posted 30+ Days Ago","startDate":"2023-02-28","timeType":"Full time","jobReqId":"52614","jobPostingId":"Investment-Operations-Implementation-and-Support-Analyst_52614","country":{"descriptor":"Japan","id":"8b705da2becf43cfaccc091da0988ab2"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Tokyo","country":{"descriptor":"Japan","alpha2Code":"JP"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Tokyo/Investment-Operations-Implementation-and-Support-Analyst_52614"}