{"id":"18e5d389ba451001da78c557da820000","title":"Senior Financial Accountant","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><div><p>At Brown Brothers Harriman, we believe no job is too big or small for any of us to handle if it helps our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of person who speaks their mind, truly listens and steps outside their role to add value wherever they can. Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek someone who takes great pride in their work and is inspired and motivated by their role in protecting and enhancing our client’s financial well-being. If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p></p><p><b>Join us as Senior Financial Accountant</b></p><p>The Senior Financial Accountant is responsible for moderate complex accounting activities relating to the maintenance of a complete and accurate general ledger and the resultant managerial reports and financial statements as well as the Regulatory Bank and Investment firm reporting requirements (basel requirements, etc.)</p><p>The Accounting and Regulatory Reporting supervisor will ensure compliance with financial, regulatory and tax reporting requirements for the BBH European entities (Luxembourg, London and Zurich).</p><p>The role is also responsible for the maintenance of policies and procedures, adequate local controls over the financial assets and processes, and the documentation requirements.</p><p>This position provides informal leadership to the team under the direction of the Finance Director</p><p></p><p><b>Key Responsibilities</b></p><p></p><p>1. General Accounting</p><ul><li><p>Oversees the accounting records and financial information and oversees month end close.</p></li><li><p>Maintains proper controls and in accordance with procedures for accounting and reporting. Where applicable, review and propose updates to procedures.</p></li><li><p>Performs analysis of revenue and expense accounts as part of the monthly closing of the books process.</p></li><li><p>Participates in the testing and implementation related to periodic updates to the general ledger or the feeder systems.</p></li><li><p>Ensure that the reporting requirements and guidelines of applicable regulatory agencies are followed and prepare required financial reports.</p></li><li><p>Preparation and review of TAX and VAT filings</p></li></ul><p></p><p>2. Financial and Regulatory Reporting</p><ul><li><p>Responsible for generating internal and external financial reports, prepares analysis of report variances. Where applicable, performs checker function on reports prepared by the Financial Accountant.</p></li><li><p>External Audit: responsible for preparation of audited financial statements. Works in close liaison with the external auditors, setting the timeline for deliverables, managing information requests and where applicable, screening information provided to the auditors by other groups around the Firm.</p></li><li><p>Ensures Corporate Tax and VAT compliance.</p></li><li><p>Prepares reports to monitor and report on the Firm’s and the subsidiaries’ capital and liquidity to ensure compliance with regulatory and Firm guidelines (EU&amp;AS).</p></li><li><p>Assist with the implementation of new regulatory reporting requirements, accounting policies, controls and system development</p></li><li><p>Ad-hoc financial analysis and reporting, as needed.</p><p></p></li></ul><p>3. Accounting policy</p><ul><li><p>Assist with implementation of new accounting policies and regulations.</p></li><li><p>Maintain accounting policies and procedures</p><p></p></li></ul><p>4. Other</p><ul><li><p>Prepare and maintain procedures for all routine functions, processes and reports.</p></li><li><p>Is proactive in finding opportunities to streamline processes and improve efficiency in performing tasks.</p></li><li><p>Monitors regulatory developments and analyzes possible impact to the Firm.</p></li><li><p>Corresponds with other departments to resolve problems and correctly account for and report financial information.</p><p></p></li></ul><p></p><p><b>Knowledge, skills and competencies:</b></p><ul><li><p>BA or Equivalent</p></li><li><p>5&#43; years of experience in the field</p></li><li><p>Knowledge of EU banking regulations.</p></li><li><p>Excellent analytical skills.</p></li><li><p>Strong organizational, management and supervisory skills.</p></li><li><p>Excellent communication and problem solving skills.</p></li><li><p>Strong computer spreadsheet skills.</p></li><li><p>Preference for an accounting qualification (CPA, ACCA, ACA, etc.)</p></li></ul><p></p><p><b>What You Can Expect At BBH:</b></p><p>If you join BBH you will find collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, to take on new challenges, to maximize your potential and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program, which emphasizes good health, financial security, and peace of mind. Ultimately, we want to provide you with a position which, at the same time, is both rewarding and allows for a balanced professional and personal experience at every stage of your career. We, here at BBH, focuses on more than just the financial and business thrive. Through our BBH Cares program we offer volunteering opportunities giving you the opportunity to give back to your community and to help transform the lives of others.</p></div><p></p><p></p><p></p>","location":"Luxembourg","postedOn":"Posted 30+ Days Ago","startDate":"2023-07-21","timeType":"Full time","jobReqId":"59627","jobPostingId":"Accounting-Supervisor_59627","country":{"descriptor":"Luxembourg","id":"328b82f597514643a7683a78fc67c3f1"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Luxembourg","country":{"descriptor":"Luxembourg","alpha2Code":"LU"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Luxembourg/Accounting-Supervisor_59627"}