{"id":"18e5d389ba4510014fdf668e7c420000","title":"Governance and Regulatory HR Senior Manager","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><div><div><div><div><div><p>At Brown Brothers Harriman, we believe no job is too big or small for any of us to handle if it helps our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of person who speaks their mind, truly listens and steps outside their role to add value wherever they can. Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek someone who takes great pride in their work and is inspired and motivated by their role in protecting and enhancing our client’s financial well-being.</p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p></p><p><b>Join us as a </b><b>Governance and Regulatory Program HR Senior Manager</b></p><p>In this role you will be responsible for management of effective governance programs related to HR processes across our European locations. This role requires a deep understanding of HR regulations and best practices within the European Union, exceptional program management skills, ability to drive cross-functional collaboration, as well as exceptional communication skills.</p><p></p><p>The role reports to:<b> </b>Head Of HR, Europe</p><p></p><p><b>Key Responsibilities:</b></p><ul><li><p><b>Partner with governance (Legal, Risk, ER &amp; Compliance), HRBP, Country Leads and business stakeholders: </b>Collaborate with governance and business stakeholders to understand their needs, align HR governance programs (e.g. Working Time Act) accordingly, and ensure effective communication and coordination.</p></li><li><p><b>Program manage change impact assessments: </b>With HR <b>C</b>entres <b>O</b>f <b>E</b>xcellence (“COE”) and governance stakeholders to proactively conduct change impact assessments on new regulations and identify potential risks and gaps; guiding the CoEs to develop change implementation plans to address any necessary modifications to local HR practices and policies.  </p></li><li><p><b>Respond to regulatory exams and implement changes:</b> Coordinate with HR COEs to respond to regulatory exams. This may include coordination with internal / external communications and training to ensure the workforce is compliant with regulatory requirements per locations.</p></li><li><p><b>Chair and lead committees:</b> Chair and lead committees comprising cross-functional colleagues to ensure adherence to regulatory outsourcing frameworks, facilitating regular meetings, tracking action items, and driving accountability</p></li><li><p><b>Create, maintain, and execute against KPIs and monitoring:</b> Design and agree key performance indicators (KPIs) with COEs and monitoring mechanisms to track the effectiveness and compliance of HR governance programs, ensuring timely reporting and that COEs take corrective actions when necessary.</p></li><li><p><b>Represent at local industry groups</b><b>:</b> Act as a representative of the organization at local industry groups, staying informed about relevant HR governance topics, establishing a feedback loop, and leveraging industry insights to enhance HR governance programs.</p></li></ul><p></p><p><b>Qualifications / Experience:</b></p><ul><li><p>Extensive experience in program management, HR governance, compliance, or related roles, with a focus on European regulations and practices.</p></li><li><p>Strong knowledge of European labour laws, data privacy regulations (e.g., GDPR) and HR best practices</p></li><li><p>Excellent understanding of HR processes and operations, including employee lifecycle management, compensation and benefits, talent acquisition and performance management.</p></li><li><p>Proven track record in developing and executing on HR policies, procedures and governance frameworks.</p></li><li><p>Outstanding communication and interpersonal abilities with the capacity to build effective relationships and collaborate with stakeholders at all levels.</p></li><li><p>Ability to work independently, prioritize tasks and meet deadlines in a fast-paced environment.</p></li></ul><p></p><p><b>What You Can Expect At BBH</b><b>:</b></p><p></p><p>If you join BBH you will find collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, to take on new challenges, to maximize your potential and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program, which emphasizes good health, financial security, and peace of mind. Ultimately, we want to provide you with a position which, at the same time, is both rewarding and allows for a balanced professional and personal experience at every stage of your career. We, here at BBH, focuses on more than just the financial and business thrive. Through our BBH Cares program we offer volunteering opportunities giving you the opportunity to give back to your community and to help transform the lives of others</p><p></p></div></div></div></div></div><p></p><p></p><p></p>","location":"London","postedOn":"Posted 19 Days Ago","startDate":"2023-09-18","timeType":"Full time","jobReqId":"59593","jobPostingId":"HR-Senior-Manager---Governance-Program-Manager_59593","country":{"descriptor":"United Kingdom","id":"29247e57dbaf46fb855b224e03170bc7"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"London","country":{"descriptor":"United Kingdom","alpha2Code":"GB"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/London/HR-Senior-Manager---Governance-Program-Manager_59593"}