{"id":"25acfb80ae59100165e71336c3bb0000","title":"Compliance Analyst – Employee Trading","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><i><b>This is a fully remote role, but to be eligible <u>candidates must reside in the Upstate NY region. </u></b></i></p><p></p><p><b><span>Join us as a Compliance Analyst – Employee Trading</span></b></p><p><span>Brown Brothers Harriman (“BBH”) is currently recruiting a Compliance Analyst – Employee Trading to join our Core Compliance team. The Compliance Analyst – Employee Trading performs a variety of activities designed to help ensure that BBH and its employees satisfy applicable securities regulations and industry best practices. Responsibilities include assisting employees with personal trading requirements such as account reporting and trade pre-clearance, maintaining restricted securities lists, and reviewing trade surveillance reports to detect potential violations of firm policy or applicable regulations.</span></p><p><span> </span></p><p><b><span>Some of your key responsibilities will include:   </span></b></p><ul><li><p><span>Educate employees regarding applicable personal trading requirement</span></p></li><li><p><span>Review and approve new account disclosures, trade pre-clearance requests, and private securities transactions</span><span><span><span>  </span></span></span><span>Work closely with LOB colleagues to update and maintain restricted and watch lists</span></p></li><li><p><span>Review trade surveillance reports and alerts to detect potential violations of the Personal Trading Policy or applicable regulations; escalate suspicious activity for further review</span></p></li><li><p><span>Assign personal trading designations based on employees’ access to material nonpublic information (MNPI)</span></p></li><li><p><span>Review account reconciliation reports to identify potential undisclosed accounts</span></p></li><li><p><span>Issue corrective action in response to policy violations</span></p></li><li><p><span>Work with BBH Systems colleagues and third-party vendor regarding surveillance system requirements</span></p></li><li><p><span>Provide personal trading metrics for management and oversight committee reports</span></p></li><li><p><span>Continuously evaluate the program’s effectiveness and identify opportunities for enhancement</span></p></li></ul><p><b><span> </span></b></p><p><b><span>Qualifications:</span></b></p><ul><li><p><span>BA/BS degree </span></p></li><li><p><span>Three or more years of regulatory compliance experience (experience with personal trading, control room, and/or code of ethics programs is preferred)</span></p></li><li><p><span>Familiarity with, and an interest in, financial markets and securities trading</span></p></li><li><p><span><span><span> </span></span></span><span>Experience with a compliance management system such as MCO is preferred</span></p></li><li><p><span>Experience with MS Office Suite (Word, Excel, PowerPoint)</span></p></li><li><p><span>Excellent writing skills</span></p></li><li><p><span>Excellent organizational skills and attention to detail; ability to balance multiple priorities</span></p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$60,000 - $70,000 base salary</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"Utica","postedOn":"Posted 4 Days Ago","startDate":"2023-10-03","timeType":"Full time","jobReqId":"58828","jobPostingId":"Core-Compliance-Analyst-II_58828","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Utica","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Utica/Core-Compliance-Analyst-II_58828","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}