{"id":"2f69decd3e161001187f055eb3c40000","title":"Model Risk Senior Analyst","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>At Brown Brothers Harriman, we believe no job is too big or small for any of us to handle if it helps our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of person who speaks their mind, truly listens and steps outside their role to add value wherever they can.  Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek someone who takes great pride in their work and is inspired and motivated by their role in protecting and enhancing our client’s financial well-being.</p><p></p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p></p><p><b><span>Join us as a Model Risk Senior Analyst</span></b></p><p></p><p>Brown Brothers Harriman is currently recruiting a Model Risk Senior Analyst to help lead our Enterprise Risk Management team.  You will be one of the core members of the Enterprise Model Risk Management Program providing a second line of defense for all bank models. In this role, you will get the opportunity to work with a variety of other teams across the bank on projects with great exposure to senior leaders.</p><p></p><p>Enterprise Model Risk Management is one of the most dynamic technical teams performing validations on the multi-disciplinary inventory of firm-wide models, algorithms, and computations – cutting across econometrics, financial forecasting, balance sheet management, capital liquidity, and financial regulations. On a cyclical basis, model risk ensures the proper functioning of models used within all lines of business and verifies their effectiveness against business and regulatory requirements. These models include the full range of finance risk models including, credit risk, liquidity risk, portfolio management, and other regulatory driven models. These models also include algorithms used in monitoring anti-money laundering risks and sanctions compliance screening.</p><p></p><p><b><span>Some of your key responsibilities include:   </span></b></p><ul><li>Conduct data quality and integrity analysis on model data inputs;</li><li>Analyze model functionality and output to assess effectiveness;</li><li>Evaluate model design against business requirements and industry standard;</li><li>Maintain and follow model risk management policies and procedures;</li><li>Participate in other team initiatives such as model risk training.</li></ul><p></p><p><b><span>Qualifications</span></b></p><ul><li>Bachelor of Science degree plus 4 years of experience in computer science or similar domain, or Master’s degree plus 3 years of experience in computer science or similar domain;</li><li>Development experience with SQL querying within relational databases;</li><li>Strong programming skills in language such as Python, R, SAS, or other coding plus experience with large scale data analysis projects;</li><li>Experience with banking and financial industry analytics and monitoring tools such as Alteryx, Actimize, Fircosoft;</li><li>Demonstrated understanding of financial industry, especially pertaining to risk management and regulatory compliance;</li><li>Strong technical writing and briefing skills.</li></ul><p></p><p><b><span>Preferred qualifications:</span></b></p><ul><li>Master’s degree in mathematics, computer science, information technology, or finance;</li><li>2 years’ experience in financial risk and compliance industry;</li><li>2 years’ experience with compliance analytics, risk and finance modeling;</li><li>Basic knowledge in AML and Sanctions and other compliance regulations</li><li>Experience with machine learning and artificial intelligence related to the financial sector and application to risk management .</li></ul><p></p><p><b><span>What We Offer</span></b>:</p><ul><li>A collaborative environment that enables you to step outside your role to add value wherever you can</li><li>Direct access to clients, information and experts across all business areas around the world</li><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>High-quality benefits program emphasizing good health, financial security, and peace of mind</li><li>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</li><li>Volunteer opportunities to give back to your community and help transform the lives of others</li></ul><p></p><p><i><b>This role is based in our Boston location and will be a hybrid role, with three days in office.</b></i></p><p></p><p><span>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.</span></p><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 16 Days Ago","startDate":"2023-09-21","timeType":"Full time","jobReqId":"60225","jobPostingId":"Model-Risk-Senior-Analyst_60225","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Model-Risk-Senior-Analyst_60225","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}