{"id":"341215c180e41001a9b1c3dd44160000","title":"Trust Administrator","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Brown Brothers Harriman is looking for a proactive, detail-oriented individual to join our Delaware office as a Trust Administrator supporting the coordination and administration of trust accounts for various clients.  You will be responsible for monitoring account transactions, ensuring all records are accurately maintained and keeping the Client Relationship Manager (CRM) informed of any client contact updates. You will also be expected to respond to internal and external requests for information and discuss client accounts and requirements with Trust Officers.</p><p></p><p><b><span>Some of your responsibilities include:</span></b></p><p></p><p><b>Monitor and Controls:</b></p><ul><li>Support the Trust Officers in opening and closing accounts for clients, including preparation of checklists.</li><li>Coordinate and administer trust accounts for various clients in a support role</li><li>Monitor account transactions, including daily review and correction of overdrafts, automatic deposits, and weekly review of standing remittances.</li><li>Maintain complete records, including supporting documentation, for accounts, discretionary distributions, and payments.</li><li>Maintain client contacts to keep CRM up to date.</li><li>Support the Trust Officers in preparing discretionary distribution memoranda and completion of annual administrative account reviews.</li><li>Provide general administrative support for the department.</li></ul><p></p><p><b>Client Interface:</b></p><ul><li>Respond to internal and external requests for information.</li><li>Discuss client accounts and requirements with Trust Officers.</li></ul><p></p><p><b>Portfolio Accounting:</b></p><ul><li>Willing to learn, or knowledge of, Sunguard or other trust accounting systems.</li><li>Prepare/input requests for client payments and transfers.</li></ul><p></p><p><b>Tax:</b></p><ul><li>Provide tax department with trust agreements, outlines, and gift calculations, as necessary</li></ul><p></p><p><b>General:</b></p><ul><li>Interest in learning about or knowledge of trust and estate documents, including recognition of key dispositive provisions and the ability to independently interpret legal documentation.</li><li>Work independently on assigned tasks with minimal oversight by Trust Officer.</li></ul><p></p><p><b><span>Qualifications:</span></b></p><ul><li>Bachelor’s degree and 2 to 3 years of relevant work experience.</li><li>Outstanding written and oral communication skills are a must.</li><li>Strong interpersonal skills.</li><li>Willingness to take on new responsibilities.</li><li>Willingness to learn new systems and procedures and the flexibility to change when necessary.</li><li>Experience with Sunguard or other trust accounting systems preferred.</li><li>Excellent organizational skills with a strong attention to detail.</li><li>Proficiency in Microsoft Office products, particularly Excel and Word.</li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Wilmington","postedOn":"Posted 2 Days Ago","startDate":"2023-10-05","timeType":"Full time","jobReqId":"56807","jobPostingId":"Trust-Administrator_56807","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Wilmington","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Wilmington/Trust-Administrator_56807","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}