{"id":"45cd3dddf872100136ac83e3ab1a0001","title":"(Senior) Custody Representative - Alternative Investment Funds","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><div><b>Join us as </b><b>a (Senior) Custody Representative in Alternative Investment Funds Team</b></div><div><div><div><div><p></p><p>Brown Brothers Harriman is currently recruiting (<b>Senior) Custody Representative </b>to join our <b>Alternative Investment Funds Team.</b> In this role you will be responsible for performing reviews of daily service, transaction work and indirectly participate in the execution of client’s investment activities in the Real Estate Investment Funds environment. Your experience in documents analysis, fund industry and, preferably customer service will enable you to multi-task in a fast-paced environment. You will cooperate with other BBH offices to provide timely and accurate completion of all selected client deliverables and inquiries. To be successful, you will need to be detailed and customer oriented, well organized, and eager to learn.</p><p></p><p><b>Some of your key responsibilities include:   </b></p><ul><li>Reviewing of Legal Documentation related to Real Estate Investments.</li><li>Comparing and analyzing Depositary positions vs accounting records</li><li>Monitoring Cash Flow movements and other tasks resulting from depositary duties.</li><li>Analyzing changes in Fund Structures, by collecting and understanding of corporate documentation.</li><li>Analyzing transactions of various asset classes (Real Estate, Private Equity, Funds of Funds)</li><li>Proactive responding to Alternatives Custody related internal and external client’s inquiries on a daily basis by providing quality, accurate and timely service.</li><li>Ensuring department procedures and controls are followed and adhered to.</li><li>Supporting Team’s supervisors in the management of some processes including escalations.</li><li>Working on potential process flow improvements and efficiencies.</li><li>Acting as the role model and trainer for less experienced Team members.</li></ul><p></p><p><b>What we offer: </b></p><ul><li>2 additional days added to your holiday calendar for Culture Celebration and Community Service</li><li>Private medical care for you and your family</li><li>Life Insurance</li><li>Hybrid Working Opportunities</li><li>Professional trainings and qualification support</li><li>Thrive Wellbeing Program</li><li>Online benefit platform</li><li>Contracts for an indefinite period with no probation period</li></ul><p></p><p><b>Desired Qualifications:</b></p><ul><li>BA/BS degree, and/or equivalent work experience.</li><li>At least 1 year of experience in financial environment.</li><li>Experience in accounting/client service/work with legal documentation preferred.</li><li>Fluency in English required. German or French will be an asset.</li><li>Ability to effectively prioritize tasks and resolve client needs.</li><li>Ability to build and maintain internal and external client relationships.</li><li> Ability to learn and utilize new technologies to research, analyze, and resolve client needs.</li><li> Experience in reporting and managing multiple data sources.</li><li>Comprehensive working knowledge of Excel.</li></ul></div></div></div></div><p></p><p></p><p></p>","location":"Krakow","postedOn":"Posted 30+ Days Ago","startDate":"2023-09-04","timeType":"Full time","jobReqId":"58640","jobPostingId":"XMLNAME--Senior--Custody-Representative---Alternative-Investment-Funds_58640-1","country":{"descriptor":"Poland","id":"131d5ac7e3ee4d7b962bdc96e498e412"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Krakow","country":{"descriptor":"Poland","alpha2Code":"PL"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Krakow/XMLNAME--Senior--Custody-Representative---Alternative-Investment-Funds_58640-1"}