{"id":"530b10f29f8b1000c847082027f40000","title":"Legal Analyst","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>RESPONSIBILITIES:</b></p><p></p><p>1. Paralegal Support</p><ul><li>Support Senior Counsel or Practice Leader in providing corporate secretarial and regulatory services to a variety of fund clients.</li><li>Prepare board and committee meeting materials, amendments to registration statements, proxy statements, Section 16 and Form NPX filings and other regulatory filings for review by Counsel.</li><li>Draft compliance policies and procedures for review by Counsel.</li><li>Prepare various EDGAR and NYSE/AMEX filings for review by Counsel.</li><li>Prepare and submit various EDGAR filings under the supervision of Sr. Legal Analysts/Counsel.</li><li>Review regulatory filings prepared by Financial Reporting such as Form NSARs, Form NCSRs and Form NQs; coordinate comments on such forms with Counsel.</li><li>Assist Counsel in responding to SEC requests for information.</li><li>Prepare and maintain board and regulatory calendars for clients.</li></ul><p></p><p>2. Research and Analysis</p><ul><li>Analyze proposed and final rule changes and prepare summaries and analyses for review by Counsel.</li><li>Acquire/strengthen knowledge of and experience with federal securities laws with a focus on the Investment Company and Investment Advisers Acts and other laws, rules and regulations affecting mutual funds and exchange traded funds.</li><li>Research, analyze and prepare memoranda for Counsel on a variety of issues relating to the federal securities laws.</li></ul><p></p><p>3.Administrative Support</p><ul><li>Coordinate the production and mailing of board and committee books.</li><li>Coordinate the production and mailing of compliance manuals.</li><li>Prepare and maintain change logs for compliance manuals</li></ul><p></p><p><b>KNOWLEDGE, SKILLS AND ABILITIES</b></p><p>Education level and/or relevant experience(s)</p><ul><li>BS/BA degree and/or equivalent work experience.</li><li>1 to 3 years of paralegal or related experience.</li><li>Understanding of Mutual fund operations and/or &#39;40 Act experience a plus.</li></ul><p></p><p>Knowledge and skills (general and technical)</p><ul><li>Communication skills.</li><li>Attention to detail.</li><li>Ability to drive open issues and projects to resolution.</li><li>Ability to successfully manage competing priorities.</li><li>Ability to work with others in team atmosphere.</li><li>Paralegal certificate or comparable training required.</li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 19 Days Ago","startDate":"2023-09-18","timeType":"Full time","jobReqId":"60256","jobPostingId":"Legal-Analyst_60256","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Legal-Analyst_60256"}