{"id":"530b10f29f8b1001945ab858a3e20000","title":"Junior Custody Representative - Alternative Investment Funds","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Join us as a Junior Custody Representative - Alternative Investment Funds!</b></p><p>Brown Brothers Harriman is currently <span>recruiting </span>Junior Custody Representative - Alternative Investment Funds to join our Asset Supervision and Custody Cash Team.</p><p>In this role you will perform reviews of daily service, transaction work and indirectly participate in the execution of client’s investment activities in the Real Estate, Private Equity and Private Debt Investment Funds environment. Your experience in documents analysis, fund industry and, preferably customer service will enable you to multi-task in a fast-paced environment. You will cooperate with other BBH offices like Luxembourg and Boston in US to provide timely and accurate completion of all selected client deliverables and inquiries. To be successful, you will need to be detailed and customer oriented, well organized, and eager to learn.</p><p>If you are looking for an environment where new experiences related to Alternatives Funds can be acquired, Brown Brothers Harriman is the right place for you.</p><p></p><p><b>Some of your key responsibilities include:   </b></p><ul><li><p>Reviewing of Legal Documentation related to Real Estate, Private Equity and Private Debt Funds’ Investments</p></li><li><p>Analyzing changes in Fund Structures, by collecting and understanding of corporate documentation.</p></li><li><p>Analyzing transactions of various asset classes (Real Estate, Private Equity, Private Debt Funds)</p></li><li><p>Proactive responding to Alternatives Custody related internal and external client’s inquiries on a daily basis by providing quality, accurate and timely service</p></li><li><p>Monitoring Cash Flow movements and other tasks resulting from depositary duties</p></li><li><p>Ensuring department procedures and controls are up to date and followed to.</p></li><li><p>Working on potential process flow improvements and efficiencies.</p></li><li><p>Supporting Team’s supervisors in the management of some processes including escalations.</p></li></ul><p></p><p><b>What we offer: </b></p><ul><li><p><b>2 additional days added </b>to your holiday calendar for Culture Celebration and Community Service</p></li><li><p>Private medical care for you and your family</p></li><li><p>Life Insurance</p></li><li><p>Hybrid Working Opportunities</p></li><li><p>Professional trainings and qualification support</p></li><li><p>Thrive Wellbeing Program</p></li><li><p>Online benefit platform</p></li></ul><p></p><p><b>Desired Qualifications:</b></p><ul><li><p><b>BA/Law degree, and/or equivalent work experience.</b></p></li><li><p>Nice to have at least 1 year of experience in financial environment</p></li><li><p>Experience in client service/work with legal documentation preferred.</p></li><li><p><b>Fluency in English required (minimum B2/C1 level). German or French will be an asset.</b></p></li><li><p>Ability to effectively prioritize tasks and resolve client needs.</p></li><li><p>Ability to build and maintain internal and external client relationships.</p></li><li><p>Self-motivation, capability of monitoring and completing a variety of projects simultaneously</p></li><li><p>Ability to learn and utilize new technologies to research, analyze, and resolve client needs.Comprehensive working knowledge of Excel</p></li></ul><p></p><p></p><p></p>","location":"Krakow","postedOn":"Posted 16 Days Ago","startDate":"2023-09-21","timeType":"Full time","jobReqId":"59940","jobPostingId":"Junior-Custody-Representative---Alternative-Investment-Funds_59940","country":{"descriptor":"Poland","id":"131d5ac7e3ee4d7b962bdc96e498e412"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Krakow","country":{"descriptor":"Poland","alpha2Code":"PL"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Krakow/Junior-Custody-Representative---Alternative-Investment-Funds_59940"}