{"id":"530b10f29f8b1001b1b09f2e442b0000","title":"Senior Auditor","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>Brown Brothers Harriman is currently recruiting for a Senior Auditor to join our Auditing team.  In this role you will assist in delivering internal audit services that help BBH businesses improve their control environment, streamline their business, and achieve operational excellence.   As a Senior Auditor, you will have the responsibility for evaluating risks and controls, executing audit tests, communicating issues and findings to management, devising solutions for business improvements, and following up on corrective actions.  To be successful, you will need to be a team-oriented individual with an enthusiasm to learn and the ability to communicate well with employees of all levels. If you are looking to push your career to the next level, introduce yourself by submitting your resume.</span></p><p><span> </span></p><p><b><span>Key responsibilities include:   </span></b></p><ul><li><p><span>Individually and as part of a project team: develop, execute, and document control evaluations</span></p></li><li><p><span>Analyze and organize audit data and summarize audit findings for management review</span></p></li><li><p><span>Assess and escalate issues identified during audit assignments or special projects</span></p></li><li><p><span>Participate in audit results conversations with management</span></p></li><li><p><span>Apply and leverage current and emerging audit tools and techniques in data analysis</span></p></li><li><p><span>Perform technical research using external and internal source material</span></p></li><li><p><span>Perform testing and carry out components of the audit program within established timelines</span></p></li><li><p><span>Throughout the audit, effectively utilize the automated work papers system to document work Ad-hoc projects</span></p></li></ul><p><span> </span></p><p><b><span>Qualifications:</span></b></p><ul><li><p><span>Bachelor’s degree in accounting, finance, or related discipline</span></p></li><li><p><span>3-5 years of work in audit or relevant experience</span></p></li><li><p><span>Strong Analytical skills</span></p></li><li><p><span>Excellent verbal and written communication skills with ability to present complex and sensitive issues to senior management</span></p></li><li><p><span>Works well individually and in teams by sharing information and supporting colleagues</span></p></li><li><p><span>Ability to effectively prioritize multiple tasks</span></p></li></ul><p><span> </span></p><p><b><span>What We Offer:</span></b></p><ul><li><p><span>A collaborative environment that enables you to step outside your role to add value wherever you can</span></p></li><li><p><span>Direct access to clients, information, and experts across all business areas around the world</span></p></li><li><p><span>Opportunities to grow your expertise, take on new challenges, and reinvent yourself - within the Firm</span></p></li><li><p><span>A culture of inclusion that values each employee’s unique perspective</span></p></li><li><p><span>High-quality benefits program emphasizing good health, financial security, and peace of mind</span></p></li><li><p><span>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</span></p></li><li><p><span>Volunteer opportunities to give back to your community and help transform the lives of others</span></p></li></ul><p></p><p>This role is based in our New York City location and will be a hybrid role, with three days in office.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$75,000 - $85,000 base salary</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","postedOn":"Posted Yesterday","startDate":"2023-10-06","timeType":"Full time","jobReqId":"59967","jobPostingId":"Senior-Auditor_59967","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/Senior-Auditor_59967","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}