{"id":"5a373c3b386b1000dbe2e205fcc80000","title":"Junior FX Relationship Manager (Associate)","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><div><p>The Junior FX Relationship Manager holds responsibility  to contribute to the relationship management and desk activity for the assigned region and is a representative of the BBH FX business line for the HK desk jurisdiction.</p><p>This role is responsible to contribute to the team’s activities which comprise of day-to-day servicing of existing clients as well as promotion and business development of BBH products and services to both existing and prospective FX clients from the international population of financial institutions with a demand for currency exchange. <br />This position will work with the Team Leader FX RM Hong Kong to align desk strategy and management with regional /overall strategies, plus supporting to identify and generate new leads, deliver product expertise and close new business to expand the BBH client base and increase the profitability of the foreign exchange business.</p></div><div><div><div><div><p></p><p><b>Responsibilities:</b></p><p></p><p><span>Relationship Management Support</span>:</p><ul><li><p>Support the FX Relationship Managers in meeting client service expectations, and serving as a point of contact for client issues.</p></li><li><p>Support FX Relationship Management staff with client contact as required.</p></li><li><p>Assist FX Relationship Managers in preparation of  client meetings.</p></li><li><p>Support BBH&amp; Co’s client communication activities for thought leadership and market insights.</p></li><li><p>Support and execute FX RM function including:</p><ul><li><p>Management of the overall relationships with key BBH clients ensuring their currency trading requirements and servicing needs are satisfied.</p></li><li><p>Obtaining price quotes from FX Traders and accepting trade orders, on behalf of clients.</p></li><li><p>Determining BBH profitability on trade orders, based on client pricing.</p></li><li><p>Building overall credibility and fostering trust with clients, FX team and regulators.</p></li><li><p>Communication with clients to ensure their understanding of market changes, product developments and new opportunities.</p></li></ul></li></ul><p></p><p><span>Internal/External Business Engagement</span>:</p><ul><li><p>Assist in researching and resolving client inquiries and issues in a timely manner.</p></li><li><p>Partner with internal departments to ensure consistent &amp; superior handling of client requests.</p></li><li><p>Prepare and distribute reports and correspondence to clients as needed.</p></li><li><p>Coordinate the distribution of product and service information to existing clients.</p></li><li><p>Assist in the development of new procedures, products, and technologies to improve service levels and reduce risk</p></li><li><p>Support conversion activities for new and existing clients &amp; borrowers</p></li><li><p>Interact and resolve problem with traders, FX Relationship Managers and operational personnel</p></li><li><p>Perform quantitative analysis relative to client earnings and trade book</p></li></ul><p></p><p>Business Development:</p><ul><li><p>Engages in business development efforts to grow existing FX client relationships across the FX continuum, including Info FX and direct execution.</p></li><li><p>Engages as a FX products and services subject matter expert to develop business with prospective clients, coordinating with Head of Markets Products Asia.</p></li><li><p>Provide tactical guidance to global FX sales staff and Inserv RM/Sales for individual sales efforts and opportunities that involve FX. Partner with FX Trading on the pricing for new and prospective clients.</p></li><li><p>Implement BBH FX cross sell culture and develop skill set with Inserv teams across Greater China to ensure prospects and demands are identified, and business development activities are effectively conducted. Focus on lead generation, product/insight delivery, and closing/implementation.</p></li><li><p>Works with Head of Markets Products Asia to align desk strategy and management with regional /overall strategies.</p></li><li><p>Works with Head of Markets Products Asia to track sales performance against targets and communicate results and/or risks to senior management.</p></li></ul><p></p><p></p><p><b>Requirements:</b></p><ul><li><p>Bachelor’s degree in finance or related discipline required.</p></li><li><p>Minimum 4 years of relevant work experience.</p></li><li><p>Experience working in the financial services industry.</p></li><li><p><span>Knowledge of BBH products, services and practices</span></p></li><li><p><span>Excellent interpersonal, negotiating and influencing skills.</span></p></li><li><p><span>Affinity with international currency markets, including impact of economic and political factors.</span></p></li><li><p><span>Experience with foreign exchange</span></p></li><li><p><span>Knowledge of emerging trends in the industry.</span></p></li><li><p><span>Strong ability to make sound business decisions, under pressure.</span></p></li><li><p><span>Creative problem solving skills, with the ability to quickly identify, recommend and implement solutions.</span></p></li><li><p><span>Ability to manage multiple tasks simultaneously, while meeting deadlines.</span></p></li><li><p><span>Experience with Microsoft Office products.</span></p></li><li><p></p></li><li><p><span>Excellent written and verbal communication skills, including presentations.</span></p></li><li><p></p></li><li><p><span>Multiple language skills, primarily Englsh, Mandarin and preferably Japanese is highly desired</span></p></li></ul><p></p></div></div></div></div><p></p><p></p><p></p>","location":"Hong Kong","postedOn":"Posted 3 Days Ago","startDate":"2023-10-04","timeType":"Full time","jobReqId":"59329","jobPostingId":"FX-Relationship-Manager_59329","country":{"descriptor":"Hong Kong","id":"d4afdeb461d446e4babd204bd102dba8"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Hong Kong","country":{"descriptor":"Hong Kong","alpha2Code":"HK"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Hong-Kong/FX-Relationship-Manager_59329"}