{"id":"709abf0882631000af5b9423a6cf0000","title":"Investor On Boarding SME","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>Join us as an Investor On Boarding SME!</span></b></p><p></p><p>Brown Brothers Harriman is currently recruiting an <b>Investor On Boarding SME</b> to join our Transfer Agency group in Krakow. In this key role you will be responsible for supporting team members in the Client On Boarding team and ensure that Transfer Agency IOB functions are performed in a controlled and efficient manner while maintaining high client satisfaction.</p><p>As an Investor On Boarding SME you will work together your dedicated team members and other experts at the bank. At BBH our employees are highly valued, trusted and rewarded for their expertise. We offer all of our employees wide learning and development opportunities. If you join us we will invest heavily in your future.</p><p></p><p><b><span>Some of your key responsibilities include:   </span></b></p><ul><li>Working as an SME maker within of the Investor On Boarding Team</li><li>Following internal SLA requirements in order not to violate any agreed timelines</li><li>Adhering to AML/KYC requirements for varying investor types when opening accounts</li><li>Overseeing the remediation of accounts that are non-compliant to in adherence with current local regulations</li><li>Discussing together with Team Leader, IOB Manager, Compliance Manager and Senior Management any issues including AML/KYC requiring escalation</li><li>Supporting Team Leader in participating and working closely with Client Service Managers and TA Production Support in the launch of new business</li><li>Establishing solid contacts with all areas and all levels at clients’ organizations to ensure high quality client service</li></ul><p></p><p><b><span>What we offer: </span></b></p><ul><li>2 additional days added to your holiday calendar for Culture Celebration and Community Service</li><li>Private medical care for you and your family</li><li>Life Insurance</li><li>Hybrid Working Opportunities</li><li>Professional trainings and qualification support</li><li>Thrive Wellbeing Program</li><li>Online benefit platform</li><li>Contracts for an indefinite period of time with no probation period</li></ul><p></p><p><b><span>Desired Qualifications:</span></b></p><ul><li>BS/BA degree (law, finance or accounting related field is preferred), and/or equivalent work experience</li><li>Minimum of 5 years of relevant industry experience</li><li>Good knowledge of Anti Money Laundering and Know Your Client legal requirements aligned to current regulations</li><li>Ability to identify, recommend and implement improvements to existing processes</li><li>High level of communication skills in English, both verbally and written.</li><li>German and French language skills will be an asset</li></ul><p></p><p></p><p></p><p></p>","location":"Krakow","postedOn":"Posted 26 Days Ago","startDate":"2023-09-11","timeType":"Full time","jobReqId":"60031","jobPostingId":"Investor-On-Boarding-SME_60031","country":{"descriptor":"Poland","id":"131d5ac7e3ee4d7b962bdc96e498e412"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Krakow","country":{"descriptor":"Poland","alpha2Code":"PL"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Krakow/Investor-On-Boarding-SME_60031"}