{"id":"709abf08826310011809f62782a40000","title":"Internal Communications Specialist","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Join us as a Communications Specialist</b></p><p>Brown Brothers Harriman is currently recruiting a Communications Specialist to join our HR Team.  In this role you will drive strategic communications that increase employee engagement and impact the success of the Firm. Your ability to translate business strategy into key messages, using a storytelling approach and various communication vehicles will enable you to influence others in a fast-paced environment driven to educate employees on our business and benefits. To be successful, you’ll need to be proactive, view situations from various perspectives, build strategic relationships within the Firm, be agile in your work management, exercise sound judgment, enjoy working with others, and have exceptional writing skills that incorporate your knack for creativity.</p><p>If you are looking to push your career to the next level, introduce yourself by submitting your resume.</p><p></p><p><b>Some of your key responsibilities include:   </b></p><ul><li>Cultivate strong relationships with internal client groups, key subject matter experts, and leaders across lines of business and geographies to deliver relevant communications</li><li>Craft key messages, consulting with project teams and leaders on the communication approach</li><li>Help employees understand their total rewards and inspire them to take advantage of all the resources</li><li>Research, write and edit content that demonstrates an understanding of audience, various perspectives, messaging, and tone for various internal channels, including announcements, newsletter stories, web, videos, desk drops and digital signage</li><li>Create and manage communication/change management plans, providing advice on key stakeholders and appropriate communication vehicles</li><li>Publish communications through a variety of channels, managing all aspects of distribution</li><li>Drive Firm strategic messages and educate employees on strategy, culture, benefits and resources</li><li>Generate creative campaigns that increase participation in activities and usage of Firm resources</li></ul><p></p><p><b><span>Qualifications:</span></b></p><ul><li>Bachelors degree; degree in English/Journalism preferred</li><li>5&#43; years of professional communications experience</li><li>Content management/intranet systems knowledge a plus</li><li>Self-starter with the ability to build your own internal credibility and become a sought-after resource for communications advice and counsel</li><li>Project management experience and ability to translate and convey complex, sometimes sensitive, information to target audiences</li><li>Resourceful story-teller with demonstrated written communication and proofreading skills, with knowledge of AP style guide rules</li><li>Excellent verbal communication and presentation skills, including listening effectively, interviewing and gathering information from sources at all levels of the company</li><li>Working well as part of a team, yet also able to operate independently</li><li>Operating as a business partner, not simply taking direction, but driving strategic communication programs, providing valuable counsel and advice.</li><li>Using creative approaches to grab reader’s interest</li></ul><p></p><p><b>What We Offer</b>:</p><ul><li>Direct access to clients, information and experts across all business areas around the world</li><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>High-quality benefits program emphasizing  good health, financial security, and peace of mind</li><li>Rewarding  work with the flexibility to enjoy personal and family experiences at every career stage</li><li>Volunteer opportunities to give back to your community and help transform the lives of others</li></ul><p></p><p></p><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 25 Days Ago","startDate":"2023-09-12","timeType":"Full time","jobReqId":"60204","jobPostingId":"Internal-Communications-Specialist_60204","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Internal-Communications-Specialist_60204","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}