{"id":"886055ffaedd1000ff52461d61df0000","title":"Financial Reporting Supervisor","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Join us as a <b>Financial Reporting Supervisor</b></b><br /> </p><p>Brown Brothers Harriman is currently recruiting <b>Financial Reporting Supervisor </b>to join our <b>Financial Reporting Team</b>. In this role you will be responsible for preparation, review and delivery of financial statements in accordance with account­ing standards, local regulations and clients’ specifications. The team has a client facing role and services clients from all around the world different domiciles; it is also responsible for completion of regulatory reporting and audit coordination from financial statements perspective in cooperation with “Big 4” companies. The team has exposure to different GAAPs, utilizes newest technology solutions allowing for process automation and works closely with many internal departments and external stakeholders (investment funds representatives, audit managers/partners, legal advisors, management companies and other professionals) which gives a great opportunity to learn about investment funds and the way they operate.</p><p>In this role you will be responsible for managing the day-to-day provision of financial reporting services of the Financial Reporting Department. Working closely with the Financial Reporting Team Leader you will allocate tasks and workload to the team members and ensure the timely and high-quality preparation of statutory annual and semi-annual financial statements.<br /><br /><b>Some of your key responsibilities include:   </b></p><ul><li>Management of preparation of annual and semi-annual financial statements of the investment funds under different accounting standards (Irish GAAP, IFRS, Luxembourg GAAP, US GAAP).</li><li>Responsibility for communications to clients / key stakeholders  and internal / and external audit.</li><li>Acting as a key client contact, ensuring timely and accurate responses to any client queries.</li><li>Responsibility for coaching and developing team members.</li><li>Providing appropriate feedback via periodic meetings and the firm’s performance appraisal process.</li><li>Assisting in improvement and standardization projects in the Department within Financial Reporting Department including standardization. and workload optimization to improve the efficiency, quality and accuracy of deliverables.</li></ul><p></p><p><b>What we offer: </b></p><ul><li>2 additional days added to your holiday calendar for Culture Celebration and Community Service</li><li>Private medical care for you and your family</li><li>Life Insurance</li><li>Hybrid Working Opportunities</li><li>Professional trainings and qualification support</li><li>Thrive Wellbeing Program</li><li>Online benefit platform</li><li>Contracts for an indefinite period with no probation period</li></ul><p></p><p><b>Desired Qualifications:</b></p><ul><li>Primary degree in accounting / banking and finance / economics / mathematics or related discipline.</li><li>Previous experience in financial reporting, accounting or audit.</li><li>Knowledge of accounting standards. Professional accountancy qualification will be an asset (qualified or part qualified).</li><li>Prior experience in people management will be an asset.</li><li>Prior experience in investment funds industry will be an asset.</li><li>Highly computer literate with strong Excel and Word skills.</li><li>Fluency in English is essential.</li><li>Detail oriented and high organizational skills.</li></ul><p></p><p></p><p></p>","location":"Krakow","postedOn":"Posted 11 Days Ago","startDate":"2023-09-26","timeType":"Full time","jobReqId":"60536","jobPostingId":"Financial-Reporting-Supervisor_60536","country":{"descriptor":"Poland","id":"131d5ac7e3ee4d7b962bdc96e498e412"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Krakow","country":{"descriptor":"Poland","alpha2Code":"PL"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Krakow/Financial-Reporting-Supervisor_60536"}