{"id":"8d5c8e12bb571001e49569587db10000","title":"AML Audit Supervisor","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b><span>AML Audit Supervisor</span></b></p><p></p><p><span>Brown Brothers Harriman is currently recruiting an AML Audit Supervisor to join our Auditing team. In this role you will assist in delivering audit services that consistently satisfy the needs and reasonable expectations of auditees by helping them improve the control environment, streamline their business, and achieve operational excellence. Leading an audit, s/he has responsibility for evaluating risks and controls, executing audit reviews, supervising others during the planning and fieldwork phases of the review, communicating issues and findings to management, devising solutions for business improvements, and following up on corrective actions.  The AML Audit Supervisor will need to work effectively in a team setting to perform all audit work in accordance with department and professional standards.  Additionally, the AML Audit Supervisor will prepare detailed reports of audit findings, recommend control improvements as appropriate and complete assignments in an efficient manner with sufficient attention to detail to ensure accuracy and thoroughness of coverage.</span></p><p></p><p><b><span>Key responsibilities include:</span></b></p><ul><li><u>Analysis and Reporting:</u><ul><li>Individually and as part of a project team, develop, execute, and document control evaluations</li><li>Evaluate the system of internal controls and prepare risk assessment matrices, audit programs and audit planning memos as appropriate</li><li>Organize and analyze audit data and summarize audit findings for management review</li><li><span>Assist in preparing audit reports and findings that identify clear root cause and risk impact</span></li></ul></li><li><u>Communication:</u><ul><li>Assess and escalate issues identified during audit assignments or special projects</li><li>Participate in discussions of audit results with management</li><li><span>Supervise/review others during planning and fieldwork</span></li></ul></li><li><u>Research:</u><ul><li>Apply and leverage current and emerging audit tools and techniques in data analysis</li><li>Perform technical research using external and internal source material</li></ul></li></ul><p><b><span>Candidate Qualifications include:</span></b></p><ul><li><u><span>Education level and/ or experience</span></u><ul><li><span>Bachelor’s degree or equivalent</span></li><li>4 - 7 years’ <span>experience in internal or external auditing</span></li></ul></li><li><u><span>Knowledge and skills</span></u><ul><li>Proficiency in risk analysis and report preparation</li><li>Strong analytical skills</li><li>Excellent communication and interpersonal skills required with ability to present complex and sensitive issues to senior management</li><li>Works well individually and in teams by sharing information and supporting colleagues</li><li>Working knowledge of Regulatory Compliance</li><li>Knowledgeable in local regulatory requirements: Regulators (Federal Reserve, OCC, etc.) with Private Banking / Know Your Customer &#34;KYC&#34; / Anti Money Laundering &#34;AML&#34; / USA PATRIOT ACT Experience</li><li>Effectively supervise/coach, motivate and provide feedback to team members</li><li>Able to multi-task effectively; juggle several components of an audit at the same time</li></ul></li><li><u>Other requirements (licenses, certifications etc.)</u><ul><li><span>Relevant professional certification preferred (e.g., CIA, ACA, ACCA, CPA, CISA,CAMS)</span></li></ul></li></ul><p></p><p>This role is based in our New York City location and will be a hybrid role, with three days in office.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$80,000 - $110,000 base salary</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","postedOn":"Posted Yesterday","startDate":"2023-10-06","timeType":"Full time","jobReqId":"58189","jobPostingId":"AML-Audit-Supervisor_58189","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/AML-Audit-Supervisor_58189","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}