{"id":"9fc68effea911001f7d694c91fb40000","title":"Strategic Alliance Lead","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>BBH Investor Services differentiates through exceptional client service, deep subject matter expertise and differentiated technology-based offerings and experiences. In our Infomediary Data Solutions division we are focused on improving Asset Managers’ and Financial Institutions’ operating models through delivery of data solutions based on our subject matter expertise, advanced technology, and global service model.</p><p></p><p>We believe an optimal operating model accommodates multiple best in breed solution providers and provide clients flexibility across their front, middle, and back-office – keeping what works, improving only what doesn’t, and preserving choice for the future. Therefore, in addition to building BBH data products, an essential part of our Infomediary Data Solutions product development cycle is focused on identifying compatible firms that we can strategically partner with and / or connect with to create value for our clients.</p><p></p><p>The <b>Strategic Alliance Lead</b> will focus on a variety of areas around how BBH considers working with third parties. The primary focus of the role will be to define and execute the strategy around partnering and connecting with third party solution providers for the Infomediary Data Services business. This role will also collaborate with the broader Investor Services product areas to establish “best practices” regarding partnering and connecting.</p><p></p><p>With respect to the responsibilities of the role as it applies to Infomediary Data Services, the goal of the role is to build a platform of connected third parties that provide clients with a variety of solutions, all connected by BBH’s data products and technology.</p><p></p><p><b>Specific responsibilities include:</b></p><ul><li>Maintain a contemporary view of the provider landscape.</li><li>Collaborate with various client and market facing groups to identify use cases and solution providers for inclusion on our platform.</li><li>Educate internal constituents on partners, and the capabilities they offer clients and the market.</li><li>Manage internal processes for onboarding of new partners.</li><li>Develop and manage commercial model, legal model, operating model, and technical integration associated with the connector and partnership models.</li><li>Develop a service model (KPIs, SLAs, etc.) that ensures clients have seamless experience irrespective of whether BBH or a strategic partner is providing underlying service.</li><li>Manage ongoing relationships with partners and any change management necessary.</li></ul><p></p><p>With respect to the responsibilities of the role as it applies to collaborating with broader Investor Services, the objective is to establish a durable discipline that supports capability assessment and development pathways across the organization. This includes instituting a methodology for assessing buy versus build or partner decisions and collaborating with Product Owners to identify and execute arrangements with external partners to round out our asset servicing related product offerings and capabilities as well as a framework for Product Owners to integrate and manage their ongoing partnership constructs.</p><p></p><p>The successful candidate for this role must be comfortable engaging with clients and the market, must be an assured and confident presenter, and must be familiar with relevant technology and able to clearly explain technical concepts to internal and external constituents.</p><p></p><p>Finally, this is a senior leadership role, and it is essential that the successful candidate is an active listener, collaborative, transparent, and open to peer review; and will model those behaviors through the organization.</p><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 30+ Days Ago","startDate":"2023-08-25","timeType":"Full time","jobReqId":"59350","jobPostingId":"Connector-and-Strategic-Alliance-Lead_59350","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Connector-and-Strategic-Alliance-Lead_59350","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}