{"id":"9fc68effea911001075ac8e1a3ea0000","title":"Section Manager I-Trade Management","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p></p><p></p><p></p><div><p> Section Manager I Trade Management is responsible for the management and direction of a specific function within the Operations Line of Business. S/he has direct oversight of activities and issues that may impact the achievement of the objectives of the department. This includes management of a small to moderate-sized group of employees who typically receive direct management from team specific supervisors.  S/he will also contribute to the broader, strategic planning of their department.<br /> </p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p></p></div><p><b>Key responsibilities include:</b><br /><b>People Management</b></p><ul><li><p>Responsible as the day to day technical or functional expert in their assigned areas and directs the activity of supervisors and staff.</p></li><li><p>Understand competencies required for successful job performance and use knowledge to coach and develop supervisors and team members as well as to identify training needs.</p></li><li><p>Responsible for developing and maintaining a plan to ensure unit has appropriate resources to meet business objectives of the department.</p></li><li><p>Develop employees by providing training, mentoring, performance management, succession planning as well as appropriately challenging assignments and assistance with career planning.  This includes accountability for partnering with Human Resources on recruiting, hiring and orientation.</p></li><li><p>May be responsible for managing staff across multiple shifts and/or locations or BPO.</p></li><li><p>Ensures a positive learning environment focused on an exchange of values, respect for one another and continued self, departmental and BBH improvement</p></li></ul><p></p><p><b>Strategic Planning/Budget</b></p><ul><li><p>In conjunction with the Section Manager II/Department Manager, develop, maintain and achieve an integrated Business Plan for the function. An integrated Business Plan aligns the following in support of business goals and objectives: organizational structure, systems priorities, budget, management reporting, and job descriptions. The plan must support the business goals and objectives of the Division and Service Delivery.</p></li><li><p>Responsible for developing and meeting budget goals.</p></li><li><p>Ensure standard suite of products is competitive, strategic, well defined and critical to our clients.</p></li></ul><p></p><p><b>Process Improvement</b></p><ul><li><p>Develop and maintain a culture of results-oriented, continuous, process improvement which includes developing and achieving leap goals, challenging all processes, procedures and practices, and focusing on solutions (not “good reasons”). This culture must reach to all levels of the division and transcend the manager’s tenure in the job.</p></li><li><p>Lead process improvement initiatives and development of new products and workflows to address to improve efficiency, effectiveness and/or control.</p></li></ul><p></p><p><b>Client Service</b></p><ul><li><p>Lead new business/due diligence client presentations and meetings.</p></li><li><p>Build and maintain relationships at all levels both within and outside the organization.</p></li><li><p>Assess and provide solutions for requirements and risks of new <span>business/products/services/asset</span> classes as it relates to Trade Management processing.</p></li><li><p>Develops and maintains product knowledge and advises management and clients on the implications of business trends, issues and operating environment changes within their product.</p></li><li><p>Participate in industry forums and initiatives</p></li></ul><p></p><p><b>Risk Management</b></p><ul><li><p>Ensure product delivery, escalation and resolution of high exposure items, maintaining the proper balance of cost, control and client service (3Cs), and maintaining standards and controls.</p></li><li><p>Review E&amp;O situations, identify points of failure and develop and execute corrective action plan.</p></li><li><p>Communicate professionally and constructively to effectively resolve issues in order to minimize risk and exposure.</p></li><li><p>Act as a lead in internal and external Audit reviews of Trade Management practices.</p></li><li><p>Ensure the RCSA is current and reflective of all key controls and risks, subject to continuous review.</p></li></ul><p></p><p><b>Desired Qualifications:</b></p><ul><li><p>BA/BS degree or equivalent work experience.</p></li><li><p>5&#43; years of Securities Processing, Financial Services and/or Transfer Agency experience.</p></li><li><p>(general and technical)</p></li><li><p>Maintain a strong knowledge of BBH’s Departments/LOBs, systems, and services.</p></li><li><p>Build and maintain relationships at all levels both within and outside the organization.</p></li><li><p>Effective people management and leadership skills – ability to develop others; lead a positive work environment focused on process <span>improvements/solutioning/product</span> enhancement; identify and ensure succession planning is in place</p></li><li><p>Customer Service orientation, works to exceed client expectations</p></li><li><p>Demonstrated excellence in Written/Verbal communications to a variety of audiences</p></li><li><p>Demonstrate strong project management skills</p></li><li><p>Demonstrate strong risk management skills</p></li><li><p>Facilitate process improvements</p></li><li><p>Ability to participate in planning and budgeting process</p></li></ul><p></p><p></p><p></p><p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.</p><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 30+ Days Ago","startDate":"2023-06-27","timeType":"Full time","jobReqId":"59295","jobPostingId":"Section-Manager-I-Trade-Management_59295","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Section-Manager-I-Trade-Management_59295","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}