{"id":"a9e80990bdad1001625d0369ab210000","title":"Individual Retirement Account (IRA) Specialist","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Join us as an Individual Retirement Account (IRA) Specialist.</b></p><p></p><p>The IRA Specialist is a member of the Brown Brothers Harriman Trust Company’s Business Management and Operations Team, which supports BBH’s two National Trust Companies.   The role requires a general understanding of trust administration, and expert knowledge of IRA banking concepts, rules, and regulations.  The IRA Specialist prepares transfers, distributions, rollovers, conversations, death claims and closures in accordance with government regulations and bank policies. The IRA Specialist must maintain accurate and complete retirement records, perform annual account reviews, and ensure all regulatory reporting requirements are met.   The IRA Specialist have strong interpersonal skills and the ability to responds quickly and accurately to Client Relationship Manager inquiries regarding IRA transactions, policies, procedures, and compliance. </p><p></p><p><b>Key responsibilities include:  </b></p><ul><li>Keep abreast of IRA regulations and assess the impact to IRA administration.</li><li>Serve as the subject matter expert for our internal teams</li><li>Perform responsibilities related to IRA products</li><li>Reviewing account documentation for accuracy and completeness, initiating and or approving transfers, facilitating distributions, and ongoing account monitoring for compliance</li><li>Ensure overall compliance with IRA operations policies and procedures</li><li>Assist with responses to IRA Audits.</li><li>Review and provide input to manager on any relevant changes in annual system release as well as year-end updates.</li><li>Maintain proficient knowledge of, and demonstrate ongoing compliance with the laws and regulations applicable to this position, ensure ongoing adherence to pertinent policies, procedures, and internal controls, and meet all job specific requirements in a timely fashion</li><li>Work closely with the Operations Manager, Audit, Compliance, Legal and Tax to ensure all procedures adhere to applicable IRA regulations &amp; laws</li><li>Lead research and provide recommendations on operational and product initiatives and improvements</li><li>Maintains service delivery standards through staff priority scheduling and peak period planning</li><li>Monitors risk controls related to financial transactions processed against customer accounts</li><li>Respond to client request in a highly professional and effective manner</li><li>Ensure compliance in the annual processing of all tax filings, including 5498 and 1099R</li><li>Work the Business Management Operations to support centralized Trust administration activities</li></ul><p></p><p><b>Qualifications:</b></p><ul><li>BA / BS degree or equivalent preferred, specialized IRA training and/or work experience</li><li>Minimum five (5) years’ experience in banking, specifically in bank operations, with a minimum of two (2) years IRA product experience</li><li>Demonstrated Microsoft Office skills</li><li>Research, analysis, and problem resolution skills</li><li>Strong verbal and written communication skills</li><li>Organizational skills and detail-oriented</li><li>Ability to manage time efficiently and effectively</li><li>Strong interpersonal skills</li><li>Ability to work in a team environment</li><li>Ability to meet deadlines and work under pressure</li><li>Proactive self-starter who is detail and goal oriented</li></ul><p></p><p><b>What We Offer:</b></p><ul><li>A collaborative environment that enables you to step outside your role to add value wherever you can</li><li>Direct access to clients, information, and experts across all business areas around the world</li><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>High-quality benefits program emphasizing good health, financial security, and peace of mind</li><li>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</li><li>Volunteer opportunities to give back to your community and help transform the lives of others.</li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$100,000 to $120,000</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"New York","postedOn":"Posted 10 Days Ago","startDate":"2023-09-27","timeType":"Full time","jobReqId":"58215","jobPostingId":"Individual-Retirement-Account--IRA--Specialist_58215","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"New York","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/New-York/Individual-Retirement-Account--IRA--Specialist_58215","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}