{"id":"b7c7bf49c18a1000b8707683b6960000","title":"HR Workday Sr. Developer/Analyst","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Brown Brothers Harriman is currently recruiting <b>HR Workday Sr Developer/Analyst</b> to join our CorpTech organization.</p><p></p><p><b>Position Summary:</b></p><p></p><p>Brown Brothers Harriman (BBH) is looking for a talented and self-motivated Developer to be a member of the HRIS team.  This person will be responsible for maintaining and supporting HR Technology and related processes.  This includes the system administration and maintenance of Workday. The primary focus would be to support various Workday functional areas such as Core HCM, Talent, Time Off/Time Tracking, Payroll functions etc. This position will strive towards maximizing efficiency and improving processes.  This will include but is not limited to the evaluation of system functionality, development of enhancements, testing of system configuration changes, and project management of small to mid-size HR projects. </p><p></p><p><b>Responsibilities include:</b></p><ul><li><p>Provide production support for clients on HR related applications, including addressing inquiries on various Workday functional areas, processes, or end user issues</p></li><li><p>Configure Workday for enhancements, address defects, and new functionality (i.e., Time Off Rule, Time Off Plans, Business Process Config/Policy, Alerts etc.), based on business requirements, including testing activities; document test scenarios, create test scripts. </p></li><li><p>Partner with business clients to gather and document business requirements</p></li><li><p>Lead design and implementation of new Workday functionality, including manage implementation phases of projects</p></li><li><p>Actively pursue innovative initiatives and improvements in current processes.</p></li><li><p>Perform mass data loads in Workday (EIBs)</p></li><li><p>Lead cyclical events for time off/time tracking and payroll processes.</p></li></ul><p></p><p><b>Qualifications include:</b></p><ul><li><p>5&#43; years relevant experience in HRIS and related disciplines, Workday experience highly preferred</p></li><li><p>Experience with requirements documentation, ability to provide feedback on design of processes</p></li><li><p>Strong analytical, organizational, and problem-solving skills</p></li><li><p>Agile learner: desire to learn new skills, self-sufficient in seeking out colleague support</p></li><li><p>Strong understanding of the HR processes and procedures (i.e., compensation, benefits, payroll, time tracking, etc.)</p></li><li><p>Ability to manage multiple, high priority tasks and adjust to shifting priorities, while meeting deadlines and knowledge of project management lifecycle</p></li><li><p>Strong knowledge of Microsoft Office Suite, especially Excel</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$90,000 - $120,000 USD (Jersey City)</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"Jersey City","postedOn":"Posted 3 Days Ago","startDate":"2023-10-04","timeType":"Full time","jobReqId":"57961","jobPostingId":"HR-Workday-Sr-Developer-Analyst_57961","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Jersey City","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Jersey-City/HR-Workday-Sr-Developer-Analyst_57961","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}