{"id":"b7c7bf49c18a10015f72ca3e98dd0000","title":"IT Procurement Specialist","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Join us as <b>IT Procurement Specialist </b>in our Technology Vendor Mgmt. <span>organization!</span></p><p></p><p>The Procurement Specialist is responsible for day-to-day operations of all IT Procurement activity related to technology hardware, software and services.  This consists of managing requests, purchasing process/lifecycle, vendor relations, negotiations, product research, pricing and vendor alternatives.  The individual works closely with the technology teams and outside vendors to understand the needs of our organization and ensure we achieve our supply goals in a timely manner. The individual presents solutions for IT purchasing practices and offers cost savings/avoidance suggestions.</p><p></p><p><b><span>Some of your key responsibilities include: </span></b></p><p></p><p>Sourcing/Vendor Management:</p><ul><li><p><span>Gathering and preparing documents like quotes, proposals and purchase terms and conditions from suppliers and presenting to management and stakeholders in a clear and concise format.</span></p></li><li><p><span>Establish and build strong relationships with suppliers to evaluate and secure the best prices and favorable terms for BBH according to key business criteria.</span></p></li><li><p><span>Analyze and monitor supplier performance and </span>resolve issues and concerns with a goal of vendor consolidation and optimization.</p></li><li><p>Stay up to date on industry trends and new products and support stakeholders with the development and implementation of sourcing strategies.</p></li><li><p>Compare available goods with industry trends to determine appropriate pricing. </p></li><li><p>Proactively present opportunities for cost savings and efficiency gains.</p></li><li><p>Researching and identifying prospective suppliers.</p></li><li><p>Collaborating with internal technology teams to ensure a strong understanding of the desired business goals.</p></li><li><p>Regular maintenance of all internal applications/tools used to track status of new requests, renewals, orders and purchasing metrics including cost savings.</p><p></p></li></ul><p>Purchasing Operations:</p><ul><li><p>Purchase goods or services that meet the quantity and quality expectations of the organization.</p></li><li><p>Order Tracking, monitoring of ETAs and follow thru to confirmed delivery of goods/services.</p></li><li><p>Serve as a Subject Matter Expert for the e-Procurement application and provide end user training and guidance as needed.</p></li><li><p>Assist with maintenance of the P2P system item catalog on a regular cadence to ensure up to date pricing and avoid product obsolescence.</p></li><li><p><span>Understand and uphold the IT Purchasing Strategies, processes and procedures for procuring all hardware, software and IT services.</span></p></li><li><p>Ensure compliance with all IT Procurement &amp; Leasing practices and Vendor Risk Management and onboarding that is required for net new purchases or renewals.</p></li><li><p>Address internal customer questions/issues related to the daily purchasing activities and escalate as needed.</p></li><li><p>Assess gaps, trends and challenges and escalate to management with client focused solutions.</p></li></ul><p></p><p>Technology Leasing:</p><ul><li><p><span>Assist with IT Leasing program as applicable and assigned, including preparation of lease bids, reconciliation of leases and assistance with end of lease management.</span></p></li></ul><p></p><p><b><span>Desired Qualifications:</span></b></p><ul><li><p>BA/BS in <span>Business, Finance, Logistics or Supply Management</span></p></li><li><p><span>Possess a minimum of 3 years’ experience in Technology Procurement</span></p></li><li><p>Excellent communication, interpersonal and negotiation skills</p></li><li><p>Good working knowledge of purchasing strategies</p></li><li><p>Strong analytical thinking and problem-solving skills</p></li><li><p>Strong computer and technical skills to effectively conduct research on potential suppliers and ability to maintain the products in the BBH P2P system</p></li><li><p>Strong strategic skills for vendor negotiations to secure the best quality products with suppliers at reasonable prices</p></li><li><p>Strong verbal and written communication skills.  The individual must use these skills to determine the product needs and to create constructive relationships with vendors and internal stakeholders.  Must be comfortable communicating with a wide spectrum of individuals of all levels of the organization that have varying degrees of technical procurement understanding</p></li><li><p>Strong creative thinking and collaboration skills are required to improve gaps and challenges across teams</p></li><li><p>The candidate should be detail oriented, organized and possess the ability to prioritize in a fast-paced environment with shifting priorities</p></li><li><p>Able to perform well in a team environment</p></li><li><p>Understands IT hardware and software terminology</p></li><li><p>The ability to plan, delegate and evaluate progress toward goals is necessary for managing projects</p></li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 2 Days Ago","startDate":"2023-10-05","timeType":"Full time","jobReqId":"59860","jobPostingId":"IT-Procurement-Specialist_59860","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/IT-Procurement-Specialist_59860","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}