{"id":"c6b7b2c83d4e1000bd15519dd98b0000","title":"Risk Manager, Investor Services","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Risk Manager, Investor Services</b></p><p>At Brown Brothers Harriman, we believe it is essential that all jobs focus on helping our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of persons who speak their mind, truly listen and step outside their role to add value wherever they can.  Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek employees who take great pride in their work and are inspired and motivated by their role in protecting and enhancing our clients’ financial well-being.</p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you.</p><p></p><p><b>Join us as a Risk Manager, Investor Services</b></p><p>The successful candidate will be responsible for proactive identification, assessment, monitoring, measurement, and mitigation of operational risks.  As a risk management subject matter expert, the Risk Manager will also provide analysis and support the Product Divisions in understanding their risk profile. The individual will play a key role in the development, maintenance, and continuous enhancement of the group’s risk management and control program including raising risk awareness across the organization.  </p><p></p><p>Core activities include the provision of advice on risk and control matters, ongoing monitoring and assessment of operational risks, controls incidents; identification of control gaps; and assessment of control remediation activities.</p><p></p><p>The individual will lead or participate in risk management initiatives such as targeted control reviews and assessment of new products, services, activities, and processes and will occasionally present findings and recommendations to senior management, oversight committees, etc.</p><p></p><p>In carrying out the above, the Risk Manager will work across levels, functions, and locations within Investor Services in close coordination with their colleagues and other control groups.     </p><p></p><p>Key responsibilities include:</p><ul><li>Assist Product Division management in understanding the risk profile (including inherent risks) of their business.</li><li>Provide advice and actionable recommendations to Product Division management to assist in maintaining a strong risk and control structure.</li><li>Provide support to Product Division management with respect to control enhancements and process improvements and participate in integration and implementation of proposed solutions.</li><li>Supporting the holistic management of risk associated with new products, services, business change and issue resolution and their overall impact on the risk profile of the Product.</li><li>Ensuring new business and day to day operations are in line with the firm’s stated risk appetite.</li><li>Identifying, assessing and escalating trends, control weaknesses and supporting the development of sustainable solutions for the management of risk.</li><li>Providing a high standard of risk reporting, communication on risk and control topics and representing the ERM InServ Risk function within the Product.</li><li>Lead/Perform targeted risk/control reviews of Operational processes/workflows.</li><li>Monitor/Track corrective action plans, analyze trends and assess root causes re: audit/regulatory findings, risk and control self-assessment gaps and risk events.</li><li>Leverage existing risk management tools, such as the firmwide risk event database and risk and control self-assessment database to assist in causal analysis of risk matters/incidents</li><li>Fostering a culture of risk transparency, regulatory risk awareness and appropriate risk escalation to the senior management team.</li><li>Leading and driving a culture of risk awareness, transparency and escalation across the LOB, particularly in the product areas they support.</li><li>Providing support and insights from developments in the market and on industry best practice to initiatives impacting or may potentially impact the Investor Services Line of Business.</li><li>Supporting training initiatives to develop risk awareness, risk culture and understanding of fundamental control principles across the business.</li><li>Working closely with senior business leadership and peers in ERM, Legal, Compliance and Internal Audit to ensure effective and proactive business risk mitigation.</li></ul><p></p><p>Qualifications:</p><ul><li>BS/BA degree or equivalent work experience required</li><li>Proven track record of leadership</li><li>A minimum of 7 years relevant industry experience with a risk and control focus.</li><li>Planning and organisational skills, analytical skills and an eye for detail.</li><li>Strong communication skills, both written and oral.</li><li>Strong collaboration and interpersonal communication skills to be able to influence, guide and credibly challenge stakeholders in relation to risk and control matters.</li></ul><p></p><p><b>What We Offer</b>:</p><ul><li>A collaborative environment that enables you to step outside your role to add value wherever you can</li><li>Direct access to clients, information and experts across all business areas around the world</li><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>High-quality benefits program emphasizing good health, financial security, and peace of mind</li><li>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</li><li>Volunteer opportunities to give back to your community and help transform the lives of others</li></ul><p></p><p>This role can be based in our Boston or Jersey City locations and will be a hybrid role, with three days in office.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>$100,000 - $140,000 base salary</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"Boston","additionalLocations":["Jersey City"],"postedOn":"Posted Yesterday","startDate":"2023-10-06","timeType":"Full time","jobReqId":"57713","jobPostingId":"Senior-Risk-Analyst_57713","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Senior-Risk-Analyst_57713","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}