{"id":"e3ae2a9ab3f40101b49a7cf8f2630000","title":"Network Management Risk & Compliance Manager","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>At Brown Brothers Harriman, we believe no job is too big or small for any of us to handle if it helps our clients. We value passionate, committed people who enjoy collaborating with others to find new solutions to complex business challenges. We are looking for the type of person who speaks their mind, truly listens, and steps outside their role to add value wherever they can.  Someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. Above all, we seek someone who takes great pride in their work and is inspired and motivated by their role in protecting and enhancing our client’s financial well-being.</p><p>If you are looking for an entrepreneurial environment where you can learn and thrive, Brown Brothers Harriman is the right place for you</p><p></p><p>Join us as a <b><span>Network Management Risk &amp; Compliance Manager</span></b></p><p></p><p>Brown Brothers Harriman is currently recruiting a Network Management Risk &amp; Compliance Manager to join our Network Management Team.</p><p></p><p>Network Management is a global function within the Administration business organization responsible for managing Brown Brothers Harriman’s (BBH) relationships with their network of agent banks and market infrastructure entities and for providing global market insights to our clients. <span>The network of providers includes cash banks, subcustodians and securities depositories. </span>Consistent with the group’s mission, the global Network Management team is organized around three primary <span>functions:  </span>Bank Relationship Management, Global Market Information, and Risk &amp; Compliance. </p><p></p><p>The Network Risk &amp; Compliance Manager is responsible for the execution of the risk and regulatory framework related to the management of the agent bank network. In this role, the Risk &amp; Compliance Manager is responsible for ensuring that our overall Network Management program, which includes selection, oversight and monitoring of the agent bank network, markets intelligence products, and client reporting incorporates regulatory requirements and risk best practices. In addition, the Network Risk &amp; Compliance Manager is responsible for our internal and external risk and compliance reporting requirements and deliverables. </p><p></p><p>As a liaison to internal subject matter experts in the Office of General Counsel, Compliance, Risk, and Regulatory groups, the Network Risk &amp; Compliance Manager will keep abreast of regulatory changes impacting our Network Management <span>program.  In</span> this capacity, the Risk &amp; Compliance Manager will ensure department management maintains a comprehensive understanding of the regulations impacting our network and will work closely with the teams to ensure they are properly incorporated in our policies, procedures and deliverables.</p><p></p><p><b><span>Some of your key responsibilities include:   </span></b></p><p><b><i><span>Risk Management</span></i></b></p><ul><li>Perform core risk management responsibilities in collaboration with broader Network Management team to ensure execution of best practices around risk and control self-assessments, data maps, subcustodian network and BBH contingency planning, annual due diligence reporting and requirements, etc.</li><li>Responsible to inform department management of new risks impacting our network either directly or via regulatory change impacting our clients. Act as central lead on ensuring our network program is updated accordingly (including establishing internal working groups across network to assess potential impact, developing recommendations on changes required, establishing subcustodian and/or client communication plans, etc).</li><li>Represent the Network Management group in the handling of market, bank and infrastructure disruptions and crisis events and as a Network Management representative on the firm wide Event Response.</li><li>Represent Network Management in new business initiatives to evaluate and identify risks associated with new / prospective engagements, products, or businesses.</li><li>Assist in promoting a risk-aware culture and support department team members in understanding risk and regulatory matters impacting the to the network.  </li></ul><p></p><p><b><i><span>Regulatory/Compliance</span></i></b></p><ul><li>Maintain a strong understanding of risk and regulatory requirements impacting BBH and our bank network (e.g., AIFMD, 17f-5, 17f-7, UCITS V, CSDR, etc).</li><li>Lead annual assessment of agent bank due diligence/monitoring policies, protocols, and best practices to ensure they reflect current and evolving risk, regulatory and compliance obligations, and considerations as well as internal policy requirements. </li><li>Ensure all Network Management products and reports comply with our risk and regulatory reporting requirements.</li><li>Provide support to the due diligence process performed on the agent bank network.</li><li>Act as liaison to our global legal entities to ensure we maintain an awareness of the requirements of our bank network derived from this client group’s regulatory obligations and perform the annual review of the service level document with applicable global legal entities.  </li><li>Represent Network Management as subject matter expert in cross divisional and industry working groups on regulatory matters to ensure compliance with regulations and regulatory guidance impacting the agent bank network. Ensure BBH’s regulatory advocacy groups reflect a practical understanding of the operation of our agent bank network in conducting their assessment of new developments or regulatory changes.</li></ul><p></p><p><b><i><span>Reporting</span></i></b></p><ul><li>Contribute to the preparation and presentation to department management and internal oversight committees on risk reporting, escalation items and overall policy and protocols for the bank network. </li><li>Conduct periodic evaluations of the governance and oversight requirements for the agent bank network recommending changes to support regulatory compliance as necessary or applicable to the relevant risk factors and reporting framework.</li><li>Manage and support the preparation and delivery of client reporting on agent bank network. </li><li>Maintain content to be used for client due diligence and Request for Proposal responses received on BBH’s agent bank network program.  </li><li>Monitor and report on developments relating to risk and regulatory matters operating in global markets via network of subcustodian and cash clearing banks for purpose of presenting to department management, internal oversight committees and for client due diligence discussions.</li><li>Maintain and update information on agent bank assignments for global custody clients in BBH’s systems and applications for client reporting and local market account opening requests.</li></ul><ul><li>Act as a Network Management escalation point for our clients and internal partners and stakeholders.</li><li>Participate client due diligence/board meetings to discuss risk and regulatory compliance priorities for the agent bank network.</li><li>Foster an innovative and inclusive team-oriented work environment.</li></ul><p></p><p></p><p><b><span>Qualifications:</span></b></p><ul><li>Bachelor’s degree in finance or related discipline required.</li><li>Previous experience working with agent banks, market infrastructure entities preferred.</li><li>Previous Network Management experience a plus.</li><li>7&#43; years of relevant work experience.</li><li>Experience in the financial services industry.</li><li><span>Experience in third party oversight, risk, control, and regulatory management.</span></li><li>Self-motivated with the ability to build relationships with key internal functional teams and external bank network.</li><li>Strong analytical and problem-solving skills with a risk and control focus and attention to detail.</li><li>Strong communication, project management and presentation skills.</li><li>Strong collaborative work style.</li><li>Ability to make sound decisions and solve problems, based on a balance of facts, experience and common sense.</li><li>Foreign language skills, a plus.</li></ul><p></p><p><b><span>What We Offer:</span></b></p><ul><li>A collaborative environment that enables you to step outside your role to add value wherever you can</li><li>Direct access to clients, information, and experts across all business areas around the world</li><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>High-quality benefits program emphasizing good health, financial security, and peace of mind</li><li>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</li><li>Volunteer opportunities to give back to your community and help transform the lives of others</li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted 4 Days Ago","startDate":"2023-10-03","timeType":"Full time","jobReqId":"53604","jobPostingId":"NCRM-Risk-Manager_53604","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/NCRM-Risk-Manager_53604","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}