{"id":"e8df3131556d1001588a5db6d1620000","title":"Relationship Associate","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Join us as a Relationship Associate</b></p><p></p><p>Brown Brothers Harriman is currently recruiting a Relationship Associate (RA) to join our Private Wealth Management department. BBH&#39;s Relationship Management team focuses on providing Investment Advisory and Wealth Management advice to families and institutions with at least $10 million of investable assets.</p><p></p><p>As a Relationship Associate (RA), you will support Sr. Relationship Associates (Sr. RA) and Relationship Managers (RM) by serving as a point of contact for high-net-worth clients and institutional contacts on behalf of the Sr. RA or RM.</p><p></p><p>You will manage the day-to-day activities of the RM’s client base and ensures that client needs are met, including managing all account maintenance activities, resolving all account related problems, preparing client presentation materials and on occasion participating in client meetings. To be successful, you will need excellent verbal and written communication skills, a dedication to superior client service, and a passion for wealth management.</p><p></p><p><b><span>Some of your key responsibilities include:   </span></b></p><p></p><p><b><span>Relationship Management</span></b></p><ul><li>Coordinate day to day activities of dedicated client base and ensure client needs are being met and that BBH services are properly delivered.</li><li>Serve as point of contact for all portfolio related questions (e.g., cash availability, money transfers, reporting concerns).</li><li>Assist Sr. RA, RM or Office Head with presentations for client meetings on specific client information such as holdings, capital activity and performance in client accounts.</li><li>Participate in prospect and client meetings, including but not limited to, discussions surrounding our service offerings.</li></ul><p></p><p><b><span>Investment Execution</span></b></p><ul><li>Implement and execute all core portfolio activities including those related to investments in Equities, Fixed Income and Cash Management on behalf of the RM.</li><li>Serve as interface on behalf of client with central management teams within BBH.</li><li>Identify accounts that should be rebalanced or repapered in preparation for account reviews, including reviewing asset allocation and making sure guidelines for investing have not changed.</li><li>Create client meeting materials.</li><li>Assist with the management of all non-strategic decisions (checks, funds transfers, and gifting etc.).</li><li>Interact with 3rd party service providers (e.g., outside custodian, NFC, Schwab, Merrill SPA).</li><li>Interface with the Trust Company regarding distributions and terminations.</li><li>Troubleshoot client account issues such as portfolio reporting/activity, client reference data, RM client data requests, assistance with understanding statement or non-receipt of mailing.</li></ul><p></p><p><b><span>Risk Management &amp; Administration</span></b></p><ul><li>As day-to-day contact point with clients, elevate all at risk issues to Sr. RA and/or RM.</li><li>Document start of relationship (e.g., new account documents, fee schedule).</li><li>Ensure total compliance at the account level and oversee and respond to all compliance reports (i.e., overdraft reports, approved trades, delinquent documentation, Investment Policy Statements (IPS)).</li><li>Initiate all account maintenance activities, including account reviews/approvals, documentation, meeting materials, address or name changes, and performance evaluations.</li><li>Assist in efforts relating to the completion of client requests.</li><li>Ensure client account materials are up to date and accurate (e.g. IPS).</li></ul><p></p><p><b><span>Qualifications:</span></b></p><ul><li>Bachelor’s degree</li><li>0-3 years of relevant work experience</li><li>Demonstrated academic interest and achievement as evidenced through strong academic credentials and/or extracurricular activities</li><li>Client service experience and aptitude strongly preferred</li><li>Strong organizational and analytical skills</li><li>Strong attention to detail</li><li>Ability to work effectively in a team environment</li><li>Proficient in MS Office, particularly Excel</li></ul><p></p><p><b><span>What We Offer</span></b>:</p><ul><li>Direct access to clients, information, and experts across all business areas around the world</li><li>Opportunities to grow your expertise, take on new challenges, and reinvent yourself—within the Firm</li><li>A culture of inclusion that values each employee’s unique perspective</li><li>High-quality benefits program <span>emphasizing good</span> health, financial security, and peace of mind</li><li>Rewarding work with the flexibility to enjoy personal and family experiences at every career stage</li><li>Volunteer opportunities to give back to your community and help transform the lives of others</li></ul><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Chicago","postedOn":"Posted 3 Days Ago","startDate":"2023-10-04","timeType":"Full time","jobReqId":"59840","jobPostingId":"Relationship-Associate_59840","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Chicago","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Chicago/Relationship-Associate_59840","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}