{"id":"e8df3131556d10020555ecc5f9fe0000","title":"Client Service Representative","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Client Service Representative</p><p></p><p>Working under direct supervision, as a Client Service Representative, you will be responsible for servicing and maintaining oversight of assigned client relationships by understanding your clients and their needs. The individual focuses on the Fund Accounting, Administration and Custody disciplines and the applicable product offering for assigned client relationships. The role will require you to establish relationships with client contacts as well as internal teams. A Client Service Representative will collaborate with team members and managers to discuss client trends, provide insights, offer automated solutions and assist in onboarding clients, conversions, reporting and analyses to ensure high client satisfaction</p><p></p><p>POSITION SCOPE</p><ul><li><p>As a client service representative, you will be responsible for managing the day to day inquiries of your clients. You will need to collaborate with internal teams to resolve your inquiries timely. You are expected to keep your clients updated on the status of the inquiry until completion. Furthermore, finding out ways to teach clients how to utilize BBH Infuse to obtain answers is important.</p></li><li><p>As a Client Service Representative, you are presented with client insights throughout your day to day interactions. Sharing insights with your peers can detect similar themes which directly impacts your department. For example, if multiple clients are having issues with a specific product/team, raising this to management can lead to a possible solution that impacts multiple clients.</p></li><li><p>As client service representative, you are the first point of contact for your clients. Sharing possible escalations/new business with appropriate teams will lead to better management of them.</p></li><li><p>This position is accountable for the management of clients, which requires strong collaboration with internal product teams. For example, if a client is planning on investing in multiple private equity funds, you are required to notify the appropriate Product team and communicate to your peers the impact that this has on everyone’s day to day.</p></li></ul><p></p><p>JOB DUTIES:</p><p></p><p>Client Service</p><p>1. Review and pro-actively respond to client and internal inquires daily, keeping client up to date on status, and escalating to Sr. Client Service Rep. as necessary</p><p>2. Research, identify and escalate internal issues that may impact client servicing</p><p>3. Work effectively with internal departments to support client requests, deliverables and issue resolution</p><p>4. Analyze inquiry trends and determine if training is required to help either reduce or automate.</p><p>5. Meet with your client contacts regularly to review pending items.</p><p>6. Execute reviews of internal reporting and reconciliations for assigned client relationships and escalate issues which may impact client servicing to the Sr. CSR</p><p>7. Prepare agendas, minutes and coordination of the meetings, and review with your manager.</p><p>8. Meet with your manager and peers regularly to share insights and communicate to senior management when necessary.</p><p></p><p>Technology Management &amp; Effectiveness</p><p></p><p>1. Working with Supervisor, communicate product enhancements to clients and conduct training sessions when necessary.</p><p>2. Stay abreast of and utilize relevant internal technology solutions to effectively manage client inquiries</p><p>3. Coordinate regular demos with your clients to teach them how to use the platform and reduce manual intervention.</p><p></p><p>Relationship Building &amp; Networking</p><p></p><p>1. Collaborate with internal teams to share insights and improve the client experience.</p><p>2. Understand your clients organizational chart to ensure you contact appropriate members to review items.</p><p>3. Actively participate in BANC events, townhalls, simulcasts, read firm wide communication to stay abreast of firm activities</p><p>Risk &amp; Control</p><p>1. Adhere to all BBH policies and best practices</p><p>2. Identify opportunities to reduce/eliminate sending correspondence with attachments and/or client sensitive information.</p><p>3. Pay attention to detail and contacts sent in emails.</p><p></p><p>KNOWLEDGE, SKILLS, COMPETENCIES</p><ul><li><p>BA or Equivalent</p></li><li><p>Ability to communicate effectively with both verbal and written skills</p></li><li><p>Ability to learn and adapt to new technologies and systems</p></li><li><p>Strong analytical and problem-solving skills</p></li><li><p>Language skills commensurate with office location and client relationships supported</p></li><li><p>Comprehensive working knowledge of Microsoft Office Products</p></li></ul><p></p><p></p><p></p><p></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.","location":"Boston","postedOn":"Posted Yesterday","startDate":"2023-10-06","timeType":"Full time","jobReqId":"60099","jobPostingId":"Client-Service-Representative_60099","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Boston","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Boston/Client-Service-Representative_60099"}