{"id":"fbb8f5ece7e6100195475fbeee160000","title":"Health and Safety Specialist","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p></p><p><b>Join us as a <span>Health and Safety Specialist!</span></b></p><p></p><p><span>Brown Brothers Harriman is currently recruiting Health and Safety Specialist to join our Global Security Team. In this role you will </span>be responsible for supporting, deploying, and managing health and safety policies, programs, and procedures within the company to improve health and safety. You will provide guidance and ensure the compliance of safe activities and operations. As a member of Health and Safety team you will be creating and supporting an initiative-taking safety culture within company and increasing employees’ awareness.</p><p></p><p><b>Some of your key responsibilities include:   </b></p><ul><li>Conducting accident investigations and proposing corrective actions</li><li>Advising and collaborating with managers on compliance monitoring and safety issues to mitigate risks.</li><li>Organizing ongoing safety trainings and conducting initial trainings.</li><li>Participating in conducting occupational risk assessments.</li><li>Reviewing all offices fire and life safety programs and making improvement recommendations.</li></ul><ul><li>Preparing the periodic analysis of work-related Health and Safety for the employer - at least once a year. It should include recommendations for technical and organizational measures to prevent life and health threats of employees and improve working conditions.</li><li>Maintaining records, completing and storing documents about work related accidents, occupational diseases and identified suspicions of such diseases, test results and the measurements records of the harmful factors in the working environment.</li><li>Submitting proposals for the requirements of health and safety both in applied and newly introduced processes.</li><li>Participating in the development of company collective agreements, internal regulations, rules and instructions for general safety and health at work and in determining the tasks of executives who are in charge of coordination of health and safety issues at work.</li></ul><p></p><p><b>What we offer: </b></p><ul><li>2 additional days added to your holiday calendar for Culture Celebration and Community Service</li><li>Private medical care for you and your family</li><li>Life Insurance</li><li>Hybrid Working Opportunities</li><li>Professional trainings and qualification support</li><li>Thrive Wellbeing Program</li><li>Online benefit platform</li><li>Contracts for an indefinite period with no probation period</li></ul><p><b>Desired Qualifications:</b></p><ul><li>IOSH or NEBOSH certification or equivalent experience.</li><li>Position requires 2 - 4 years of operational life safety experience.</li><li>Understanding of risk management and compliance.</li><li>Excellent written and oral communication presentation and interpersonal skills.</li><li>Familiarity with life safety and fire regulations.</li><li>Verbal and written English skills required.</li><li>Good knowledge of Microsoft Office (Word, Excel, PowerPoint), Lotus Notes.</li><li>Analytical skills.</li><li>Ability to lead and manage as well as work independently.</li></ul><div><div><div><p></p></div></div></div><p></p><p></p><p></p>","location":"Krakow","postedOn":"Posted 9 Days Ago","startDate":"2023-09-28","timeType":"Full time","jobReqId":"60619","jobPostingId":"Health-and-Safety-Specialist_60619","country":{"descriptor":"Poland","id":"131d5ac7e3ee4d7b962bdc96e498e412"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Krakow","country":{"descriptor":"Poland","alpha2Code":"PL"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Krakow/Health-and-Safety-Specialist_60619"}