{"id":"fe8d96aaa8921001436ebb73db150000","title":"Performance Measurement Analyst - Senior Representative","jobDescription":"<p>At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p></p><p><u><b>What You Can Expect At BBH:</b></u></p><p>If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Join us as <b><span>Performance Measurement Analyst/Senior Representative</span></b></p><p></p><p>Brown Brothers Harriman is currently recruiting <b>Performance Measurement Analyst </b>to join our Performance Measurement Team. In this role you will be performing analytical, control and client servicing activities to ensure accurate and timely performance measurement reporting and/or attribution reporting for BBH’s clients according to established standards. The Individual will take ownership of tasks and works independently yet will receive supervision when needed by the Senior Performance Analyst and the Performance Manager, particularly with regards to instructions on new assignments and client developments.</p><p></p><p></p><p><b><span>Some of your key responsibilities include:   </span></b></p><ul><li>Calculate, analyze and report performance and attribution calculations for BBH’s clients</li><li>Provide data to database companies including portfolio holdings and information to calculate accurate performance and statistics</li><li>Ensures the accurate and timely performance measurement and attribution reporting. Reconciles and analyzes data source for calculations. Prepares reporting with necessary supporting documentation for review by Manager</li><li>Field and respond to client inquiries and escalate issues</li><li>Exhibit a sound understanding of BBH products and services</li><li>Maintain relationships with internal and external clients</li><li>Respond to internal and external audit requests promptly and accurately</li><li>Assist in the coordination of new business and product implementations and conversions</li><li>Promotes a cohesive team atmosphere through exhibition of leadership, effective communication, professionalism and development of own career path</li></ul><p></p><p></p><p><b><span>What we offer: </span></b></p><ul><li><span>2 additional days added to your holiday calendar for Culture Celebration and Community Service</span></li><li><span>Private medical care for you and your family</span></li><li><span>Life Insurance</span></li><li><span>Hybrid Working Opportunities</span></li><li><span>Professional trainings and qualification support</span></li><li><span>Thrive Wellbeing Program</span></li><li><span>Online benefit platform</span></li><li><span>Contracts for an indefinite period with no probation period</span></li></ul><p></p><p></p><p><b><span>Desired Qualifications:</span></b></p><ul><li>BA/BS degree</li><li>A minimum of 2 years mutual fund industry experience</li><li>Strong analytical and problem-solving skills</li><li>Technical proficiency, Eagle Star Accounting System and Bloomberg would be an asset</li><li>Very good English skills (B2 level is a must)</li><li>Ability to plan and prioritize assignments through multi-tasking while dealing with competing deadlines</li><li>Strong knowledge of Excel</li></ul><p></p><p></p><p></p>","location":"Krakow","postedOn":"Posted Yesterday","startDate":"2023-10-06","timeType":"Full time","jobReqId":"60165","jobPostingId":"Performance-Measurement-Analyst---Senior-Representative_60165","country":{"descriptor":"Poland","id":"131d5ac7e3ee4d7b962bdc96e498e412"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Krakow","country":{"descriptor":"Poland","alpha2Code":"PL"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Krakow/Performance-Measurement-Analyst---Senior-Representative_60165"}