{"id":"fe8d96aaa89210015667412b2fa00000","title":"Sr. z/OS System Programmer / Architect (OSS MVS group)","jobDescription":"<p style=\"text-align:left\">At BBH we value diverse backgrounds, so if your experience looks a little different from what we&#39;ve outlined and you think you can bring value to the role, we will still welcome your application!</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><u><b>What You Can Expect At BBH:</b></u></p><p style=\"text-align:left\">If you join BBH you will find a collaborative environment that enables you to step outside your role to add value wherever you can. You will have direct access to clients, information and experts across all business areas around the world. BBH will provide you with opportunities to grow your expertise, take on new challenges, and reinvent yourself—without leaving the firm. We encourage a culture of inclusion that values each employee’s unique perspective. We provide a high-quality benefits program emphasizing good health, financial security, and peace of mind. Ultimately we want you to have rewarding work with the flexibility to enjoy personal and family experiences at every career stage. Our BBH Cares program offers volunteer opportunities to give back to your community and help transform the lives of others.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><span>Join us as a </span><b><span>Sr. z/OS System Programmer / Architect</span></b><span> in our Operating System Support MVS group.</span></p><p></p><p><b><span>Overview:</span></b></p><p></p><p>The OSS MVS group (Operating System Support MVS) is responsible for the mainframe z/OS operating system environment and all the mainframe vendor products that are used for supporting both  production and test environments.  Reporting to the OSS MVS manager, the Sr. z/OS System Programmer / Architect is responsible for maintaining the z/OS environment, which primarily includes: keeping the operating system and program products at their most current level, performance and tuning, debugging and troubleshooting system related issues, and providing technical support to the application development community.</p><p></p><p>The candidate must have expert knowledge and hands-on experience, working with the latest generation of IBM mainframes, and the more recent releases of the z/OS operating system. The candidate must also provide expert guidance to the application development community and the data center operations staff, in all areas of operating systems functionality, as well as mainframe program products usage.</p><p></p><p><b><span>Responsibilities:</span></b></p><ul><li><p>z/OS operating system installation and customization using the IBM Serverpac process</p></li><li><p>Program product installation and customization</p></li><li><p>Performance and tuning activities, which includes monitoring the system activities and making recommendations to the application developers on how to improve the overall performance of their application</p></li><li><p>Apply operating system and program product  fixes on a regular basis</p></li><li><p>Analyze and debug operating system and program product related issues</p></li><li><p>Provide technical leadership on best practices for operating system configurations, in areas of resiliency and performance</p></li><li><p>Review and update the mainframe disaster recovery procedures as needed, and act as the team lead in the quarterly mainframe BCP recovery test events.</p></li></ul><p></p><p><b><span>General Skills:</span></b></p><ul><li><p>Ability to interface effectively with all areas affected by major system upgrades (e.g. business users, other infrastructure support groups, and the application development community).</p></li><li><p>Excellent interpersonal skills and responsiveness to client need</p></li><li><p>Strong organizational, time management and communication (written and oral) skills</p></li></ul><p></p><p><b><span>Qualifications &amp; Technical Skills:</span></b></p><ul><li><p>Minimum of 10&#43; years of experience as Sr. z/OS System Programmer, including 5&#43; years of technical experience in designing and implementing medium to large scale Parallel Sysplex configurations.</p></li><li><p>Strong knowledge of z/OS operating system architecture, internals, operations, and recovery scenarios</p></li><li><p>Experience in the installation and customization of CA program products, such as: CA-Scheduler, CA-TopSecret, CA-TLMS, and CA-11, is preferred</p></li><li><p>Experience with  RACF, IBM Z Workload Scheduler, or Content Manager on Demand is a plus.</p></li><li><p>Ability to code user exits in either Assembler, REXX, or COBOL</p></li><li><p>Experience with mainframe automation tools such as: AutoOperator, OPS/MVS, ori AF/Remote</p></li><li><p>Experience with various SNA and TCP/IP networking configurations</p></li><li><p>Hands-on experience with I/O configuration definitions using HCD</p></li><li><p>Excellent debugging skills and expert knowledge of IPCS</p></li><li><p>Must have the ability to write REXX or CLIST routines</p></li><li><p>Working experience with major subsystems, such as: CICS, DB2, and MQSeries</p></li><li><p>Must be familiar with mainframe performance and tuning best practices, as well as expert knowledge of various monitoring tools, such as: Omegamon/MVS, Omegamon/CICS, RMF, and CMF.</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, genetic information, creed, marital status, sexual orientation, gender identity, disability status, protected veteran status, or any other protected status under federal, state or local law.<p style=\"text-align:inherit\">   </p><p style=\"text-align:left\"><u><b>Salary Range</b></u></p><p>140,000-170,000 USD (Jersey City)</p><p><b><i>BBH’s compensation program includes base salary, discretionary bonuses, and profit-sharing. The anticipated base salary range(s) shown above are only for the indicated location(s) and may differ in other locations due to cost of living and labor considerations. Base salaries may vary based on factors such as skill, experience and qualification for the role. BBH&#39;s total rewards package recognizes your contributions with more than just a paycheck—providing you with benefits that enhance your experience at BBH from long-term savings, healthcare, and income protection to professional development opportunities and time off, our programs support your overall well-being. <br /> </i></b></p><p></p><p></p>","location":"Jersey City","postedOn":"Posted 30+ Days Ago","startDate":"2023-08-30","timeType":"Full time","jobReqId":"59973","jobPostingId":"Sr-z-OS-System-Programmer---Architect--OSS-MVS-group-_59973","country":{"descriptor":"United States of America","id":"bc33aa3152ec42d4995f4791a106ed09"},"canApply":true,"posted":true,"includeResumeParsing":true,"jobRequisitionLocation":{"descriptor":"Jersey City","country":{"descriptor":"United States of America","alpha2Code":"US"}},"externalUrl":"https://bbh.wd5.myworkdayjobs.com/BBH/job/Jersey-City/Sr-z-OS-System-Programmer---Architect--OSS-MVS-group-_59973","questionnaireId":"d3f82191e722015fd92504d227cf15b8"}